export default [
  {
    'date': '2024-02-02',
    'author': '调和',
    'name': '刀拒气焰万丈！',
    'desc': '偷鸡卡组。八相开遗响壁，然后刀刀命吃；4-5命开气焰万丈，下轮转到自己可以洗牌进决死，律动八面斩连打，打不死也扒层皮。对面使用王牌攻击需求高浦可以换果果（可能偷到超克6/6）。',
    'decklink': 'sdrice.name/random/?ver=S9&lang=cn&isShow=1&girls=0+0,1+2&girlscard1=1,6+1&girlscard2=0,2,3,5,6+0,2'
  },
  {
    'date': '2024-02-29',
    'author': 'CheeseFox',
    'name': '伞算',
    'desc': '用合伞的对装的高伤害不停地削血，市价也会提高。傘飛轉也可以保持高盾状态',
    'decklink': '//sdrice.name/random/?ver=S9&lang=cn&isShow=1&girls=5+0,22+0&girlscard1=0,1,2,4+0,3&girlscard2=1,3,4+3'
  },
  {
    'date': '2024-04-30',
    'author': 'yume',
    'name': '算遗旗pick 算遗',
    'desc': '开局找神授，变武器或者铃铛(一般个人理解是变武器，因为投机的缘故，对面一直不反证的话有时候可能会浪费ap)第二回合，金融可以直接拿去伪证铃铛，被翻了也不亏(一轮牌库能买命)。中期就靠一轮两次武器，武器恫吓-2，武器杀谎给对面择(11+32 -2 22)(这里伪证有一点学问)后期可以开方打两血，或者吸装+巫女剑+杀谎两种斩杀(王牌也可带打手表或4气对应，硬烫)。樱铃成功的话资源比较多，不怕高装压',
    'decklink': 'sdrice.name/random/?ver=S9&lang=cn&isShow=1&girls=21+1,22+0&girlscard1=0,5+3&girlscard2=1,3,4,5,6+0,3'
  },
  {
    'date': '2024-04-30',
    'author': 'yume',
    'name': '算遗旗pick 旗遗',
    'desc': '这个轴核心是神授变一定要变31(可以不贪铃铛，骗一次也行)。前期就靠小刀慢慢打，杀谎换樱吹雪赚ap而且没距离限制，核心就是找个3牌库回合，开觉悟(一般只开这一次)，伪证刃本靠四季或者唆使打两遍配合突击和此旗打四刀32。此旗甚至可以续觉悟下轮再来一波小爆发，翅膀就是拿来再起四季打突击用的，前期盖掉或者当伪证打掉。',
    'decklink': 'sdrice.name/random/?ver=S9&lang=cn&isShow=1&girls=13+0,21+1&girlscard1=0,3,5+1,2&girlscard2=0,2,3,5+0'
  },
  {
    'date': '2024-05-02',
    'author': 'yume',
    'name': '算遗旗pick 算旗',
    'desc': '算遗旗pick。如果你遇到遗物被ban了，那恭喜你，其实我也不知道算旗怎么玩儿。这里主要根据对手的特点选择构筑，因为旗子单卡质量不高，因此可以采用只携带两张旗子的牌加四季，然后带上算盘最核心的六张牌加心算(或护符比如对弓)的主算玩法，依靠旗子强力的开花和回牌库效果反复投资。也可以考虑使用主旗玩法，携带樱吹雪指挥进行资源压制，此旗配合突击，狂盘破弃配奥华进行连续压制。由于明算的强聚气效果，在遇到对手比较慢且无法压气的情况下，甚至可以考虑不带四季转而携带义旗和此旗加开方法出其不意()。',
    'decklink': 'sdrice.name/random/?ver=S9&lang=cn&isShow=1&girls=13+0,22+0&girlscard1=0,1,5+1,2&girlscard2=1,3,4,5+3'
  },
  {
    'date': '2024-07-11',
    'author': 'Klx_Akira',
    'name': '凌迟至死之络伞',
    'desc': 's9-2伞飞转加强后的络伞。齿轮粘伞飞转，核心是31+11+伞飞转循环，抽上来结缘就31+11+结缘+伞飞转，模块化展开中31+11+手上1-3张伞飞转循环，31再起配合魔能吸收可以获得大量的ap，电疗凑数卡可以换成kururu或者伞的通常牌31。',
    'decklink': '//sdrice.name/random/?ver=S9-2&lang=cn&isShow=1&girls=5+0,9+0&girlscard1=1,2,4,5,6+0&girlscard2=0,5+0,2'
  },
  {
    'date': '2024-07-21',
    'author': '苍之狩人',
    'name': '更加快乐的骑旗',
    'desc': '基于山神的“骑旗飙车”卡组改编而来。S9-2的骑喜提加强，使得SC的出手可能性更高（3距打WE就能进1），不再需要追风来辅助了，因此空出来的卡位就给了指挥补伤害。Thallya\'s Master被重做成回油卡也使得作为斩杀卡的此旗编入可能性增加。主体思路依旧是回5打突击。碰见难以回5的情况或是需要跳距康的情况，樱吹雪可以换成TS。',
    'decklink': '//sdrice.name/random/?ver=S9-2&lang=cn&isShow=1&girls=10+0,13+0&girlscard1=0,1,2,5+2&girlscard2=0,1,5+1,2'
  },
  {
    'date': '2024-07-28',
    'author': 'Peter Tse',
    'name': '铳爪疯狂输出打雷',
    'desc': '与@朝霧的铳爪卡组较为相似，将意义不明的回燃换为有一点用的迷烟。第一轮洗牌之前随便打，尽可能触发连火效果，要注意麦林加农炮的使用，其他就比较无所谓，抽到吼叫就盖掉或者用效果一，同时要尽量把距离控制到5以后（迷烟卡对手前进）；第二轮基本就斩杀了，连招是：真红凶弹-射击/麦林-速射-风雷之智（拉起速射）-后跳抽回速射-速射；如果对方前进比较猛的话可以转换思路，等一波吼叫然后天雷带走。',
    'decklink': '//sdrice.name/random/?ver=S8&lang=cn&isShow=1&girls=2+0,11+0&girlscard1=0,1,2,4,6+1,2&girlscard2=4,5+1'
  },
  {
    'date': '2024-07-28',
    'author': 'Peter Tse',
    'name': '伞毒大招流',
    'desc': '第一轮洗牌前手牌基本可以全部盖掉来前进加聚气，拉到约5.6距，有条件可以偶尔打一打 藏/含 和 预/猫 配合 纷扬如雪 刮点盾，或者塞一张减灯毒卡对面手牌，注意保持合伞状态不要暴露进攻意图；第二轮爆发，连招（括号内内容代表距离变化）：结缘（-1）-泥泞-开伞回合结束，卡对面后退空间，下一回合开始：结缘（-1）-蹑足（-2）-闪/潜（-1）-2AP前进（-2）-拒/引（-2）从最多9距直接拉到0（上述为极限连招，可酌情减少），此时需保证对手装少于三，然后开大 明减如灯 打命5点，配合剩余卡牌带走（也可以第二轮继续打连招刮血（减灯毒破盾），第三轮再开大带走）',
    'decklink': '//sdrice.name/random/?ver=S9-2&lang=cn&isShow=1&girls=5+0,8+0&girlscard1=0,1,2,5,6+0,1&girlscard2=5,6+0'
  },
  {
    'date': '2024-08-09',
    'author': 'R.R.',
    'name': '紙上談兵之—女神安岐那挑戰對策',
    'desc': '以英雄戰被禁「工業時代」「大魔像」為前提構築，當然沒禁就可以電療軸、魔像軸。主思路是「雷螺爪」然後「加速」「回收利用」多一次，可考慮多扣「風雷擊」在手，混淆對方的「收購」。「龍捲轟」2綠燈時候使用，視乎熟悉程度可換成「電療」。',
    'decklink': 'https://sdrice.name/random/?ver=S9-2&lang=jp&isShow=1&girls=9+0,11+0&girlscard1=1,2,3,4,5+3&girlscard2=1,3+0,3'
  },
  {
    'date': '2024-09-30',
    'author': '调和',
    'name': '见面3t开始斩杀',
    'desc': '开局调度保证3t上手伴奏，伞飞转，预演猫骗。\n1t聚2气，八相开唱。（最好留转伞上1装）\n2t在保护唱歌的前提下，尝试接近5距，并调整为闭伞。\n3t进到5，开伴奏（不要怕扣装）。然后开始表演：\n伴奏（王牌-1气），纷扬如雪，预演，（伞飞转），聚气，复返其身，（伞飞转），纷扬如雪，预演，（伞飞转），伞飞转，聚气，纷扬如雪，预演，装附。\n一套下来，消耗资源是：伴奏，伞飞转，复返其身，花1气启动。\n效果是3刀3/2，3刀1/2，回4装，展开一个伴奏。\n对手如满装装吃3/2，或者不满装，能直接入到6命，加上你的第四张牌，很可能打8命，基本只能投降了。\n启动资源低到令人发指，爆发强度高到令人咋舌。',
    'decklink': '//sdrice.name/random/?ver=S9-2&lang=cn&isShow=1&girls=1+1,5+0&girlscard1=0,2,5+1&girlscard2=0,1,2,4+0,3'
  },
  {
    'date': '2024-12-11',
    'author': 'cx233666',
    'name': '赛马特胜金面',
    'desc': '娱乐卡组，最速5t特胜，金的王牌非常适合做困难任务，第一个困难任务大重力过樱飞沫，最后一个任务用大破钟过鼓动中间的任务随便做做就行，只需要考虑防守即可。',
    'decklink': '//sdrice.name/random/?ver=S9-2&lang=cn&isShow=1&girls=7+1,19+0&girlscard1=0,1,2,3,6+1,2&girlscard2=1,3+0'
  },
  {
    'date': '2025-06-20',
    'author': '宇景海人',
    'name': '拒现魂3pick 拒现',
    'desc': '简单粗暴的萌新蓄爆卡组，有什么打什么就行了，不需要什么思考，火力特别高。',
    'decklink': '//sdrice.name/random/?ver=S10&lang=cn&isShow=1&girls=1+2,25+1&girlscard1=0,1,2+0,2&girlscard2=0,1,2,3+2'
  },
  {
    'date': '2025-06-20',
    'author': '宇景海人',
    'name': '拒现魂3pick 魂现',
    'desc': '开局萬葉，然后就是一直蓄爆。找到机会就开千芳猶增色抽三打爆对面，針雨·覆逆可以看情况带。',
    'decklink': '//sdrice.name/random/?ver=S10&lang=cn&isShow=1&girls=15+2,25+1&girlscard1=0,1,6+0&girlscard2=0,1,2,3+0,2'
  },
  {
    'date': '2025-06-20',
    'author': '宇景海人',
    'name': '拒现魂3pick 拒魂',
    'desc': '开局萬葉和集气起手，然后放弃思考，疯狂蓄爆。对面一装时可以使用意志把他装扣掉，再裏斬入3血，另外如果对面很能拉扯距离，可以考虑带个響鳴共振。',
    'decklink': '//sdrice.name/random/?ver=S10&lang=cn&isShow=1&girls=1+2,15+2&girlscard1=0,1,2+0,2&girlscard2=0,1,4,6+0'
  },
  {
    'date': '2025-06-23',
    'author': '宇景海人',
    'name': '削血弓过',
    'desc': '简单粗暴的削血卡组，有什么打什么，掩郁·埋葬看情况带。',
    'decklink': '//sdrice.name/random/?ver=S10&lang=cn&isShow=1&girls=24+0,25+0&girlscard1=0,2,3+2,3&girlscard2=0,1,2,3+0'
  },
  {
    'date': '2025-06-23',
    'author': '宇景海人',
    'name': '摆烂衣未',
    'desc': '未来强度真的不高，也只能打打那些拉距能力不强的女神了，遇上近距女神还是投了吧。',
    'decklink': '//sdrice.name/random/?ver=S10&lang=cn&isShow=1&girls=21+0,25+2&girlscard1=0,2,5+0,3&girlscard2=0,1,2,6+0'
  },
  {
    'date': '2025-06-23',
    'author': '宇景海人',
    'name': '公式电金',
    'desc': '大煉成主敲全息苦無，自定义零件主拿C，用来调整位置打炼成攻击，核心零件看情况选，主要流程就是利用设置反复打炼成攻击，没什么难的。',
    'decklink': '//sdrice.name/random/?ver=S10&lang=cn&isShow=1&girls=4+2,7+1&girlscard1=0,3,4,5+1&girlscard2=0,1,6+0,3'
  },
  {
    'date': '2026-01-25',
    'author': '殇梦无吟',
    'name': '欧耶逆反斩',
    'desc': '四叶镜吃遗响壁，运气好能入很多',
    'decklink': '//sdrice.name/random/?ver=S10-2&lang=cn&isShow=1&girls=1+2,15+0&girlscard1=0,1,6+0,2&girlscard2=0,1,3,4+1'
  },
  {
    'date': '2026-01-29',
    'author': 'KlaiRvoyanS~',
    'name': '络锯电疗',
    'desc': '传统电疗 茨道看着换反射',
    'decklink': 'https://sdrice.name/random/?ver=S10-2&lang=cn&isShow=1&girls=9+0,23+0&girlscard1=0,2,5+0,2&girlscard2=2,4,5,6+2'
  },
  {
    'date': '2026-01-29',
    'author': '某人',
    'name': '铳镰凶弹被ban和我铳尘什么关系',
    'desc': '你觉得我是铳镰吗（？ 虽然没了黑波，但是回来了凶弹',
    'decklink': 'https://sdrice.name/random/?ver=S10-2&lang=cn&isShow=1&girls=2+0,12+1&girlscard1=0,1,2,4,5+0,2&girlscard2=0,1+1'
  },
  {
    'date': '2026-02-12',
    'author': 'Calamitias',
    'name': '想吃桃子的绿毛组合（不同于栗皇构筑）',
    'desc': '自闭流打法，目标是在前两次洗牌中尽可能地嫖够5点血伤，然后用果子斩杀。大体上看，至少可以在两次洗牌中打出2个弓流、1个甲乙箭，以及2次洗牌伤害，刚好可以在无视装的情况下完成。你也可以选择使用正常的打装实现入血，但我认为这样可能会面临被rangelock的可能（弓流瞄准不依赖距）。但相对的，由于凤仙花的破绽，此打法容易被打断，一个优化思路是不带遥瞩带掌，用掌取代凤仙花来给果实输血，顺便可以把甲乙箭弓流换成脱粒打掷，走beatdown（当然，启动的代价会变高）流程上，1t聚气，2t甲乙箭（因此先手优势），3t弓流+任一希的赋予（有2/1可以先付2/1），完成第一轮展开。后续，随便卖卖自己的血攒气，至少5气时即可启动，如果需要遥瞩补伤害记得留2气，有弓流就顺手交了。如果展开顺利，以上流程可以在前两次洗牌内完成，可以与斩杀流程同步执行：提前2回合，点上果实，打脱粒buff重云，凤仙花，都点满2生长；下一回合，打出华，刚好能在最后一回合凑够5个种结晶，交出空之翼退5距，对面最多3装，随后桃子登场完成收割。以及，xp绿毛。多来点。',
    'decklink': 'https://sdrice.name/random/?ver=S10-2&lang=cn&isShow=1&girls=18+0,24+0&girlscard1=0,2,4,5+2&girlscard2=0,3,6+0,1'
  },
  {
    'date': '2026-02-14',
    'author': 'Calamitias',
    'name': '新尘友之新友：信息差这一块',
    'desc': '美梦成真构筑，本质偷鸡战术，必须后手（对面要是有经验，请换成8t变身），1t盖一集中一做两次聚气，先打TS再打QC，开深层连接和新黑盒（ob不要先开）。2t回收黑盒（这里要是对面有经验，直接装附的话就完蛋了，所以是个只能用一次的战术）。后面用一次常规的3回合变身，然后再用一次回收加速，可以7t完成三次变身，随后8t可以准备动手了（注，4t时先做哪种变身取决于你先抽到回收还是先抽到TS，如果运气太差都没抽到，那...好像新型都容易这样极端倒霉。）。斩杀时先ASURA的3/2，然后BS，激光枪，OB，电磁炮，一套连招打对面至少9血，只需要3气，结束',
    'decklink': 'https://sdrice.name/random/?ver=S10-2&lang=cn&isShow=1&girls=9+2,10+1&girlscard1=0,1,4+3&girlscard2=0,3,4,6+0,1'
  },
  {
    'date': '2026-02-17',
    'author': 'longlan',
    'name': '铳伞火力最大化',
    'desc': '火力最大化构筑，将闭伞轴和铳轴合并。这套打法在对手没有打消时可以考虑，防止预演被打消导致伞loop不成立。小技巧：将伞飞旋调度在手里或者牌库倒数第二张（前提保证2t铳一套）1t前进1开伞，2t铳一套打完大概在7到8距左右4装，回合结束闭伞将装回满应对下一轮对手攻击。使用时记得规划好集中力的使用，因为通常牌都是输出，后退大多数都是集中力。羁绊不够不能印卡的可以复返换狂想提高容错。最后想了解铳伞的铳轴闭伞轴开伞轴的可以b站搜索勇者大人不中二看专栏',
    'decklink': 'https://sdrice.name/random/?ver=S10-2&lang=cn&isShow=1&girls=2+0,5+0&girlscard1=0,1,2,4,5+0&girlscard2=1,4+0,3'
  }
]