export default [
  {
    'date': '2024-02-02',
    'author': '调和',
    'name': '刀拒气焰万丈！',
    'desc': '偷鸡卡组。八相开遗响壁，然后刀刀命吃；4-5命开气焰万丈，下轮转到自己可以洗牌进决死，律动八面斩连打，打不死也扒层皮。对面使用王牌攻击需求高浦可以换果果（可能偷到超克6/6）。',
    'decklink': 'sdrice.name/random/?ver=S9&lang=cn&isShow=1&girls=0+0,1+2&girlscard1=1,6+1&girlscard2=0,2,3,5,6+0,2'
  },
  {
    'date': '2024-02-29',
    'author': 'CheeseFox',
    'name': '伞算',
    'desc': '用合伞的对装的高伤害不停地削血，市价也会提高。傘飛轉也可以保持高盾状态',
    'decklink': 'https://sdrice.name/random/?ver=S9&lang=cn&isShow=1&girls=5+0,22+0&girlscard1=0,1,2,4+0,3&girlscard2=1,3,4+3'
  },
  {
    'date': '2024-04-30',
    'author': 'yume',
    'name': '算遗旗pick 算遗',
    'desc': '开局找神授，变武器或者铃铛(一般个人理解是变武器，因为投机的缘故，对面一直不反证的话有时候可能会浪费ap)第二回合，金融可以直接拿去伪证铃铛，被翻了也不亏(一轮牌库能买命)。中期就靠一轮两次武器，武器恫吓-2，武器杀谎给对面择(11+32 -2 22)(这里伪证有一点学问)后期可以开方打两血，或者吸装+巫女剑+杀谎两种斩杀(王牌也可带打手表或4气对应，硬烫)。樱铃成功的话资源比较多，不怕高装压',
    'decklink': 'sdrice.name/random/?ver=S9&lang=cn&isShow=1&girls=21+1,22+0&girlscard1=0,5+3&girlscard2=1,3,4,5,6+0,3'
  },
  {
    'date': '2024-04-30',
    'author': 'yume',
    'name': '算遗旗pick 旗遗',
    'desc': '这个轴核心是神授变一定要变31(可以不贪铃铛，骗一次也行)。前期就靠小刀慢慢打，杀谎换樱吹雪赚ap而且没距离限制，核心就是找个3牌库回合，开觉悟(一般只开这一次)，伪证刃本靠四季或者唆使打两遍配合突击和此旗打四刀32。此旗甚至可以续觉悟下轮再来一波小爆发，翅膀就是拿来再起四季打突击用的，前期盖掉或者当伪证打掉。',
    'decklink': 'sdrice.name/random/?ver=S9&lang=cn&isShow=1&girls=13+0,21+1&girlscard1=0,3,5+1,2&girlscard2=0,2,3,5+0'
  },
  {
    'date': '2024-05-02',
    'author': 'yume',
    'name': '算遗旗pick 算旗',
    'desc': '算遗旗pick。如果你遇到遗物被ban了，那恭喜你，其实我也不知道算旗怎么玩儿。这里主要根据对手的特点选择构筑，因为旗子单卡质量不高，因此可以采用只携带两张旗子的牌加四季，然后带上算盘最核心的六张牌加心算(或护符比如对弓)的主算玩法，依靠旗子强力的开花和回牌库效果反复投资。也可以考虑使用主旗玩法，携带樱吹雪指挥进行资源压制，此旗配合突击，狂盘破弃配奥华进行连续压制。由于明算的强聚气效果，在遇到对手比较慢且无法压气的情况下，甚至可以考虑不带四季转而携带义旗和此旗加开方法出其不意()。',
    'decklink': 'sdrice.name/random/?ver=S9&lang=cn&isShow=1&girls=13+0,22+0&girlscard1=0,1,5+1,2&girlscard2=1,3,4,5+3'
  }
]