//头像 https://main-bakafire.ssl-lolipop.jp//furuyoni\na/rule.html
// cardDemo Json
/*
  {
    id: [String],
    
    name: [String],
    namejp: [String],
    namekr: [String],
    nameen: [String],

    text: [String],
    textjp: [String],
    textkr: [String], 
    texten: [String],

    baseType: [String],     //normal, special

    types: [Array],         //attack, fullpower, action, enhance, reaction

    range: [String],        //format: x-x
    rangeOpened: [String],  //format: x-x

    damage: [String],       //format: x/x
    damageOpened: [String], //format: x/x

    changeIndex: [Number],
    
    capacity: [Number],
    capacityGrowup: [Number],

    cost: [String],
  }
*/
const Sakura = [{
  name: 'YURINA 摇波',
  namejp: 'ユリナ',
  namekr: '유리나',
  nameen: 'YURINA',
  desc: '决死～若自命中的樱花结晶的数目小于等于3，则你的一部分牌会获得强化。',
  descjp: '決死～あなたのライフが3以下ならば、いくつかのカードが強化される。',
  // girlInfo: '身高：158cm\n喜欢的东西：打赢别人，睡觉和团子。\n<b>--物語--</b>\n「わたしと一緒に勝利を目指しましょう！」\nユリナはもとは人間、天音揺波でした。２０年前の一大事にて誕生したメガミの１柱で、中でも立役者と呼ぶべき英雄です。\n現在の彼女は今代における武神であり、戦いと勝利を象徴しています。桜花決闘という文化を深く愛し、それを広げ、盛り立てることに何よりも情熱を注いでいます。無論、決闘の実力は最高峰であり、衰える気配を見せません。\nその一方で、決闘以外では不器用さが目立ちます。色々とすっぽ抜けており、周囲の嘆息もやむを得ないといったところです。',
  // girlInfojp: '身長：158cm\n好きなもの：勝つこと、寝ること、お団子\n<b>--物語--</b>\n「わたしと一緒に勝利を目指しましょう！」\nユリナはもとは人間、天音揺波でした。２０年前の一大事にて誕生したメガミの１柱で、中でも立役者と呼ぶべき英雄です。\n現在の彼女は今代における武神であり、戦いと勝利を象徴しています。桜花決闘という文化を深く愛し、それを広げ、盛り立てることに何よりも情熱を注いでいます。無論、決闘の実力は最高峰であり、衰える気配を見せません。\nその一方で、決闘以外では不器用さが目立ちます。色々とすっぽ抜けており、周囲の嘆息もやむを得ないといったところです。',
  list: [{
    name: '刀',
    namejp: '刀',
    namekr: '도',
    nameen: 'KATANA',
    isSelect: false,
    pic: 'twiicon_sa_01.jpg',
    picq: 'sd_yurina.png',
    normal: [{
      id: '01-yurina-o-n-1',
      name: '斩',
      namejp: '斬',
      namekr: '참',
      baseType: 'normal',
      types: ['attack'],
      range: '3-4',
      damage: '3/1',
      text: '',
      textjp: ''
    },
    {
      id: '01-yurina-o-n-2',
      name: '一闪',
      namejp: '一閃',
      namekr: '일섬',
      baseType: 'normal',
      types: ['attack'],
      range: '3',
      damage: '2/2',
      text: '【常时】决死～若自命中的樱花结晶的数目小于等于3，则此《攻击》获得+1/+0。',
      textjp: '【常時】決死-あなたのライフが3以下ならば、この《攻撃》は+1/+0となる。',
      textkr: '【상시】결사-당신의 라이프가 3 이하라면, 이 《공격》은 +1/+0이 된다.'
    },
    {
      id: '01-yurina-o-n-3',
      name: '柄击',
      namejp: '柄打ち',
      namekr: '자루치기',
      baseType: 'normal',
      types: ['attack'],
      range: '1-2',
      damage: '2/1',
      text: '【攻击后】决死～若自命中的樱花结晶的数目小于等于3，则本回合内你的下一次《攻击》获得+1/+0。',
      textjp: '【攻撃後】決死-あなたのライフが3以下ならば、このターンにあなたが次に行う《攻撃》は+1/+0となる。',
      textkr: '【공격후】결사-당신의 라이프가 3 이하라면, 이 턴에 당신이 다음에 행하는 《공격》은 +1/+0이 된다.'
    },
    {
      id: '01-yurina-o-n-4',
      name: '居合斩',
      namejp: '居合',
      namekr: '거합',
      baseType: 'normal',
      types: ['attack', 'fullpower'],
      range: '2-4',
      damage: '4/3',
      text: '【常时】若当前距离小于等于2，则此《攻击》获得-1/-1。',
      textjp: '【常時】現在の間合が2以下ならば、この《攻撃》は-1/-1となる。',
      textkr: '【상시】현재 간격이 2 이하라면, 이 공격은 -1/-1이 된다.'
    },
    {
      id: '01-yurina-o-n-5',
      name: '气魄',
      namejp: '気迫',
      namekr: '기백',
      baseType: 'normal',
      types: ['action'],
      text: '你获得1点集中力。\n本回合内你的其他女神的下一次非王牌的《攻击》获得不可被对应（通常牌）和距离扩大（近1）。',
      textjp: 'あなたは集中力を1得る。\nこのターンにあなたが次に行う他のメガミによる切札でない《攻撃》は対応不可（通常札）と距離拡大（近1）を得る。',
      textkr: '당신은 집중력을 1얻는다.\n이 턴에 당신이 다음에 하는 다른 여신의 비장패가 아닌 《공격》은 대응불가(통상패)와 거리 확대(근1)을 얻는다.'
    },
    {
      id: '01-yurina-o-n-6',
      name: '气合斩',
      namejp: '圧気',
      namekr: '압기',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '2',
      text: '破绽\n【破弃时】进行一次“攻击距离1-4 伤害3/-”的攻击。',
      textjp: '隙\n【破棄時】攻撃『適正距離1-4、3/-』を行う。',
      textkr: '빈틈\n【파기시】공격『적정거리1-4、3/-』을 행한다.'
    },
    {
      id: '01-yurina-o-n-7',
      name: '气焰万丈',
      namejp: '気炎万丈',
      namekr: '기염만장',
      baseType: 'normal',
      types: ['enhance', 'fullpower'],
      capacity: '4',
      text: '【展开中】决死～若自命中的樱花结晶的数目小于等于3，则你的其他女神的《攻击》获得+1/+1和超克。',
      textjp: '【展開中】決死-あなたのライフが3以下ならば、あなたの他のメガミによる《攻撃》は+1/+1となるとともに超克を得る。',
      textkr: '【전개중】결사-당신의 라이프가 3 이하라면, 당신의 다른 여신에 의한 《공격》은 +1/+1이 되며 초극을 얻는다.'
    }],
    special: [{
      id: '01-yurina-o-s-1',
      name: '月影落',
      namejp: '月影落',
      namekr: '월영이 떨어지니',
      baseType: 'special',
      types: ['attack'],
      range: '3-4',
      damage: '4/4',
      cost: '7',
      text: '',
      textjp: ''
    },
    {
      id: '01-yurina-o-s-2',
      name: '浦波岚',
      namejp: '浦波嵐',
      namekr: '파도치는 폭풍우',
      baseType: 'special',
      types: ['attack', 'reaction'],
      range: '0-10',
      damage: '2/-',
      cost: '3',
      text: '终端\n【攻击后】被对应的《攻击》获得-2/+0。',
      textjp: '終端\n【攻撃後】対応した《攻撃》は-2/+0となる。',
      textkr: '종단\n【공격후】대응한 《공격》은 -2/+0이 된다.'
    },
    {
      id: '01-yurina-o-s-3',
      name: '浮舟宿',
      namejp: '浮舟宿',
      namekr: '쪽배에서 쉬노니',
      baseType: 'special',
      types: ['action'],
      cost: '2',
      text: '虚（5）→自装 \n----\n【即再起】决死～自命中的樱花结晶的数目降至3及以下。',
      textjp: 'ダスト→自オーラ：5 \n----\n【即再起】決死-あなたのライフが3以下になる。',
      textkr: '더스트→자신 오라：5 \n----\n【즉재기】결사-당신의 라이프가 3 이하가 된다.'
    },
    {
      id: '01-yurina-o-s-4',
      name: '天音摇波的底力',
      namejp: '天音揺波の底力',
      namekr: '아마네 유리나의 저력',
      baseType: 'special',
      types: ['attack', 'fullpower'],
      range: '1-4',
      damage: '5/5',
      cost: '5',
      text: '【常时】决死～仅当自命中的樱花结晶的数目小于等于3时可以使用此牌。',
      textjp: '【常時】決死-あなたのライフが3以下でないと、このカードは使用できない。',
      textkr: '【상시】결사-당신의 라이프가 3 이하가 아니면, 이 카드는 사용 할 수 없다.'
    }]
  },
  {
    name: '古刀',
    namejp: '古刀',
    namekr: '고도',
    nameen: 'KOTŌ',
    isSelect: false,
    pic: 'twiicon_sa_15.jpg',
    picq: 'sd_yurina_a1.png',
    changenormal: [{
      changeIndex: '1',
      id: '01-yurina-a1-n-1',
      name: '乱打',
      namejp: '乱打',
      namekr: '난타',
      baseType: 'normal',
      types: ['attack'],
      range: '2',
      damage: '2/1',
      text: '【常时】决死～若自命中的樱花结晶的数目小于等于3，则此《攻击》获得+0/+2和不可被对应。',
      textjp: '【常時】決死-あなたのライフが3以下ならば、この《攻撃》は+0/+2となり、対応不可を得る。',
      textkr: '【상시】결사-당신의 라이프가 3 이하라면, 이 《공격》은 +0/+2가 되고, 대응불가를 얻는다.'
    },
    {
      changeIndex: '6',
      id: '01-yurina-a1-n-6',
      name: '暴砂雷',
      namejp: '癇癪玉',
      namekr: '콩알탄',
      baseType: 'normal',
      types: ['enhance', 'reaction'],
      capacity: '1',
      text: '【破弃时】进行一次“攻击距离0-4 伤害1/- 不可被对应 【攻击后】对手畏缩”的攻击。',
      textjp: '【破棄時】攻撃『適正距離0-4、1/-、対応不可、【攻撃後】相手を畏縮させる』を行う。',
      textkr: '【파기시】공격『적정거리0-4、1/-、대응불가、【공격후】상대를 위축시킨다』를 행한다.'
    }],
    changespecial: [{
      changeIndex: '2',
      id: '01-yurina-a1-s-2',
      name: '不完全浦波岚',
      namejp: '不完全浦波嵐',
      namekr: '물결치는 폭풍우',
      baseType: 'special',
      types: ['attack', 'reaction'],
      range: '0-10',
      damage: '3/-',
      cost: '5',
      text: '终端\n【攻击后】被对应的《攻击》获得-3/+0。',
      textjp: '終端\n【攻撃後】対応した《攻撃》は-3/+0となる。',
      textkr: '종단\n【공격후】대응한 《공격》은 -3/+0이 된다.'
    }]
  },
  {
    name: '心',
    namejp: '心',
    isSelect: false,
    pic: 'twiicon_sa_44.jpg',
    picq: 'sd_yurina_a2.png',
    changenormal: [
      {
        changeIndex: '3',
        id: '01-yurina-a2-n-3',
        baseType: 'normal',
        types: ['attack'],
        range: '2-5',
        damage: '3/0',
        namejp: '問答',
        name: '问与答',
        textjp: '【攻撃後】相手がライフへのダメージを選んだらば、相手の山札の上から3枚を伏せ札にして、あなたは基本動作を1回行い、相手は同じ基本動作を可能ならば行う。',
        text: '【攻击后】若对手选择由命承受此次伤害，则盖伏对手牌库顶的3张牌，执行1次基本动作，然后若对手能够执行该基本动作，则对手也如此做。'
      },
      {
        changeIndex: '7',
        id: '01-yurina-a2-n-7',
        baseType: 'normal',
        types: ['enhance'],
        capacity: '3',
        namejp: '阿吽',
        name: '始与终',
        textjp: '【展開中】各ターンで《攻撃》のダメージまたは基本動作で初めて相手のオーラが変化した時、その《攻撃》や基本動作の解決後にあなたは以下のいずれかを行ってもよい。\n・基本動作《纏い》を行う。その後、基本動作《宿し》を行ってもよい。\n・攻撃『適正距離3-5、2/1』を行う。',
        text: '【展开中】每回合内，每当敌装中的樱花结晶数目首次因《攻击》伤害或基本动作的效果而变化时，该《攻击》或基本动作结算完毕后，你可以选择一项。\n1.执行一次基本动作《装附》。你可以执行一次基本动作《聚气》。\n2.进行一次“攻击距离3-5 伤害2/1”的攻击。'
      }
    ],
    changespecial: [
      {
        changeIndex: '1',
        id: '01-yurina-a2-s-1',
        baseType: 'special',
        namejp: '神座渡',
        name: '神座渡',
        cost: 'X',
        types: ['attack', 'fullpower'],
        range: '0-5',
        damage: 'X/2',
        textjp: '対応不可\n【常時】Xはこのカードのコストを支払う際のあなたのフレアに等しい。\n【攻撃後】基本動作《纏い》か《宿し》を合計Ｘ回まで行う。あなたの使用済の切り札をX枚まで選び、それらを未使用に戻す。このターンの間、手札の上限がX増加する。',
        text: '不可被对应\n【常时】X等于支付此牌费用时自气中的樱花结晶的数目。（修正王牌费用的效果于此效果之后结算）\n【攻击后】以任意顺序执行至多X次基本动作《装附》或基本动作《聚气》。选择至多X张你的使用后状态的王牌，将其变为未使用状态。本回合内，你的手牌上限增大X。'
      }
    ]
  }
  ]
},
{
  name: 'SAINE 细音',
  namejp: 'サイネ',
  namekr: '사이네',
  nameen: 'SAINE',
  desc: '八相～若自装中的樱花结晶的数目小于等于1，则你的一部分牌会获得强化。',
  descjp: '八相～あなたのオーラが1以下ならば、いくつかのカードが強化される。',
  // girlInfo: '身高：163cm\n喜欢的东西：修行、音楽、かき氷\n<b>--物語--</b>\n「武の道を歩むというならば、共に参りましょう」\nサイネはもとは人間、氷雨細音であり、天音揺波の好敵手にして盲目の達人でした。彼女もまた２０年前の一大事で誕生したメガミの１柱で、英雄の一人です。\n今の彼女はユリナと並ぶ武神であり、武道と技を象徴しています。あらゆる雑音を取り払い、ただ技を極めることこそが彼女の生き様です。決闘も彼女にとっては技を高めるための手段でしかありません。\n神経質で自分の拘りを曲げられない不器用な気質です。その一方で流されやすく、他のメガミたちの奔放さに振り回されがちです。',
  // girlInfojp: '身長：163cm\n好きなもの：修行、音楽、かき氷\n<b>--物語--</b>\n「武の道を歩むというならば、共に参りましょう」\nサイネはもとは人間、氷雨細音であり、天音揺波の好敵手にして盲目の達人でした。彼女もまた２０年前の一大事で誕生したメガミの１柱で、英雄の一人です。\n今の彼女はユリナと並ぶ武神であり、武道と技を象徴しています。あらゆる雑音を取り払い、ただ技を極めることこそが彼女の生き様です。決闘も彼女にとっては技を高めるための手段でしかありません。\n神経質で自分の拘りを曲げられない不器用な気質です。その一方で流されやすく、他のメガミたちの奔放さに振り回されがちです。',
  list: [{
    name: '薙刀',
    namejp: '薙刀',
    namekr: '나기나타',
    nameen: 'NAGINATA',
    isSelect: false,
    pic: 'twiicon_sa_07.jpg',
    picq: 'sd_saine.png',
    normal: [{
      id: '02-saine-o-n-1',
      name: '八面斩',
      namejp: '八方振り',
      namekr: '팔방 휘두르기',
      baseType: 'normal',
      types: ['attack'],
      range: '4-5',
      damage: '2/1',
      text: '【攻击后】八相～若自装中的樱花结晶的数目小于等于1，则进行一次“攻击距离4-5 伤害2/1”的攻击。',
      textjp: '【攻撃後】八相-あなたのオーラが1以下ならば、攻撃『適正距離4-5、2/1』を行う。'
    },
    {
      id: '02-saine-o-n-2',
      name: '薙刀斩',
      namejp: '薙斬り',
      namekr: '후려베기',
      baseType: 'normal',
      types: ['attack', 'reaction'],
      range: '4-5',
      damage: '3/1',
      text: '',
      textjp: ''
    },
    {
      id: '02-saine-o-n-3',
      name: '石突',
      namejp: '石突き',
      namekr: '석돌 치기',
      baseType: 'normal',
      types: ['attack', 'reaction'],
      range: '2-3',
      damage: '2/1',
      text: '【攻击后】八相～若自装中的樱花结晶的数目小于等于1，则虚（1）→距',
      textjp: '【攻撃後】八相-あなたのオーラが1以下ならば、ダスト→間合：1'
    },
    {
      id: '02-saine-o-n-4',
      name: '识破',
      namejp: '見切り',
      namekr: '간파',
      baseType: 'normal',
      types: ['action'],
      text: '【常时】八相～若自装中的樱花结晶的数目小于等于1，则此牌可以如《对应》牌一样对应《攻击》使用。\n距（1） ⇔ 虚',
      textjp: '【常時】八相-あなたのオーラが1以下ならば、このカードを《対応》を持つかのように相手の《攻撃》に割り込んで使用できる。\n間合⇔ダスト：1'
    },
    {
      id: '02-saine-o-n-5',
      name: '圈域',
      namejp: '圏域',
      namekr: '권역',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '2',
      text: '【展开中】若此牌上的樱花结晶将被移除，则不将其移至虚，而改为移至距。\n【展开中】达人距离增大1。',
      textjp: '【展開中】この付与札の上の桜花結晶がダストへと送られるならば、それは代わりに間合へと移動する。\n【展開中】達人の間合は1大きくなる。',
      textkr: '【전개중】이 부여패 위에 있는 벚꽃 결정이 더스트로 움직일 때, 그 대신에 간격으로 이동한다.\n【전개중】달인의 간격이 1늘어난다.'
    },
    {
      id: '02-saine-o-n-6',
      name: '冲音晶',
      namejp: '衝音晶',
      namekr: '축음정',
      baseType: 'normal',
      types: ['enhance', 'reaction'],
      capacity: '1',
      text: '【展开时】被对应的《攻击》获得-1/+0。\n【破弃时】进行一次“攻击距离0-10 伤害1/- 不可被对应”的攻击。虚（1）→距',
      textjp: '【展開時】対応した《攻撃》は-1/+0となる。\n【破棄時】攻撃『適正距離0-10、1/-、対応不可』を行い、ダスト→間合：1',
      textkr: '【전개시】대응한 《공격》은 -1/+0이 된다.\n【파기시】공격『적정거리 0-10、1/-、대응불가』를 행하고, 더스트→간격：1'
    },
    {
      id: '02-saine-o-n-7',
      name: '无音壁',
      namejp: '無音壁',
      namekr: '무음벽',
      baseType: 'normal',
      types: ['enhance', 'fullpower'],
      capacity: '5',
      text: '【展开中】当你结算伤害时，此牌上的樱花结晶视为在自装中。（此牌上的樱花结晶不会因此占据自装的空位）',
      textjp: '【展開中】あなたへのダメージを解決するに際し、このカードの上に置かれた桜花結晶をあなたのオーラにあるかのように扱う。',
      textkr: '【전개중】당신으로의 대미지를 해결 할 때, 이 카드 위에 놓인 벚꽃 결정을 당신의 오라에 있는 것처럼 취급한다.'
    }],
    special: [{
      id: '02-saine-o-s-1',
      name: '律动弧戟',
      namejp: '律動弧戟',
      namekr: '율동호극',
      baseType: 'special',
      types: ['action'],
      cost: '6',
      text: '进行一次“攻击距离3-4 伤害1/1”的攻击。\n进行一次“攻击距离4-5 伤害1/1”的攻击。\n进行一次“攻击距离3-5 伤害2/2”的攻击。',
      textjp: '攻撃『適正距離3-4、1/1』を行う。\n攻撃『適正距離4-5、1/1』を行う。\n攻撃『適正距離3-5、2/2』を行う。',
      textkr: '공격『적정거리3-4、1/1』을 행한다.\n공격『적정거리4-5、1/1』을 행한다.\n공격『적정거리3-5、2/2』을 행한다.'
    },
    {
      id: '02-saine-o-s-2',
      name: '响鸣共振',
      namejp: '響鳴共振',
      namekr: '항명공진',
      baseType: 'special',
      types: ['action'],
      cost: '8',
      text: '【常时】此牌的费用减小X，X等于敌装中的樱花结晶的数目。 \n敌装（2）→距',
      textjp: '【常時】このカードの消費は相手のオーラの数だけ少なくなる。\n相オーラ→間合：2',
      textkr: '【상시】이 카드의 소비는 상대 오라의 수 만큼 적어진다.\n상대 오라→간격：2'
    },
    {
      id: '02-saine-o-s-3',
      name: '音无碎冰',
      namejp: '音無砕氷',
      namekr: '무음쇄빙',
      baseType: 'special',
      types: ['attack', 'reaction'],
      range: '0-10',
      damage: '1/1',
      cost: '2',
      text: '【攻击后】被对应的《攻击》获得-1/-1。\n----\n【再起】八相～自装中的樱花结晶的数目小于等于1。',
      textjp: '【攻撃後】対応した《攻撃》は-1/-1となる。\n----\n【再起】八相-あなたのオーラが1以下である。',
      textkr: '【공격후】대응한 《공격》은 -1/-1이 된다.\n----\n【재기】팔상-당신의 오라가 1이다.'
    },
    {
      id: '02-saine-o-s-4',
      name: '冰雨细音的终焉',
      namejp: '氷雨細音の果ての果て',
      namekr: '히사메 사이네의 종말의 끝',
      baseType: 'special',
      types: ['attack', 'reaction'],
      range: '1-5',
      damage: '5/5',
      cost: '5',
      text: '【常时】仅当你对应王牌时可以使用此牌。',
      textjp: '【常時】このカードは切札に対する対応でしか使用できない。',
      textkr: '【상시】이 카드는 비장패에 대한 대응으로만 사용한다.'
    }]
  },
  {
    name: '琵琶',
    namejp: '琵琶',
    namekr: '비파',
    nameen: 'BIWA',
    isSelect: false,
    pic: 'twiicon_sa_17.jpg',
    picq: 'sd_saine_a1.png',
    changenormal: [{
      changeIndex: '3',
      id: '02-saine-a1-n-3',
      name: '冰之音',
      namejp: '氷の音',
      namekr: '얼음의 소리',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '敌装（1）→虚\n若此牌作为对应使用，则敌装（1）→虚',
      textjp: '相オーラ→ダスト：1\nこのカードを対応で使用したならば、さらに\n相オーラ→ダスト：1',
      textkr: '상대 오라→더스트：1\n이 카드를 대응으로 사용했다면, 추가로\n상대 오라→더스트：1'
    },
    {
      changeIndex: '6',
      id: '02-saine-a1-n-6',
      name: '伴奏',
      namejp: '伴奏',
      namekr: '반주',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '4',
      text: '【展开中】若你有至少1张其他女神的王牌处于使用后状态，则每回合内，每当对手进行第一次《攻击》时，该《攻击》获得-1/+0。\n【展开中】若你有至少1张细音的王牌处于使用后状态，则每回合你使用的第一张王牌费用减小1（王牌的费用不会为负值）。',
      textjp: '【展開中】あなたの他のメガミの切札が1枚以上使用済ならば、各ターンの最初の相手の《攻撃》は-1/+0となる。\n【展開中】あなたのサイネの切札が1枚以上使用済ならば、各ターンにあなたが最初に使用する切札の消費は1少なくなる(0未満にはならない)。',
      textkr: '【전개중】당신의 다른 여신의 비장패가 1장 이상 사용완료라면, 매 턴 첫 상대의 《공격》은 -1/+0이 된다.\n【전개중】당신의 사이네의 비장패가 1장 이상 사용완료라면, 당신이 매 턴 처음 사용하는 비장패의 소비는 1 적게 된다(0미만으로는 되지 않는다).'
    }],
    changespecial: [{
      changeIndex: '2',
      id: '02-saine-a1-s-2',
      name: '二重奏：弹奏冰瞑',
      namejp: '二重奏：弾奏氷瞑',
      namekr: '이중주:탄주빙명',
      baseType: 'special',
      types: ['action'],
      cost: '2',
      text: '终端\n对手畏缩。你抓1张牌，或获得1点集中力。\n【使用后】你的其他女神的《攻击》获得+0/+1和不可被闪避。\n----\n【即再起】自命受到除重铸牌库以外的大于等于1点的伤害。',
      textjp: '終端\n相手を畏縮させる。あなたはカードを1枚引くか、集中力を1得る。\n【使用済】あなたの他のメガミによる《攻撃》は+0/+1となり、不可避を得る。\n----\n【即再起】あなたが再構成以外でライフに1以上のダメージを受ける。'
    }]
  },
  {
    name: '拒',
    namejp: '拒',
    namekr: '거절',
    nameen: 'REFUSE',
    isSelect: false,
    pic: 'twiicon_sa_26.jpg',
    picq: 'sd_saine_a2.png',
    changenormal: [{
      changeIndex: '2',
      id: '02-saine-a2-n-2',
      name: '里斩',
      namejp: '裏斬り',
      namekr: '배신',
      baseType: 'normal',
      types: ['attack'],
      range: '4-5',
      damage: '1/3',
      text: '不可被对应（通常牌）',
      textjp: '対応不可（通常札）',
      textkr: '대응불가(통상패)'
    },
    {
      changeIndex: '7',
      id: '02-saine-a2-n-7',
      name: '遗响壁',
      namejp: '遺響壁',
      namekr: '유향벽',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '2',
      text: '【展开中】当你结算伤害时，此牌上的樱花结晶视为在自装中。（此牌上的樱花结晶不会因此占据自装的空位）\n【破弃时】八相～若当前为你的回合，且自装中的樱花结晶的数目小于等于1，则进行一次“攻击距离0-5 伤害0/0 【攻击后】对敌装造成2点伤害，本回合内你进行的下一次《攻击》获得+0/+1。”的攻击。',
      textjp: '【展開中】あなたへのダメージを解決するに際し、このカードの上に\n置かれた桜花結晶をあなたのオーラにあるかのように扱う。\n【破棄時】八相-あなたのオーラが1以下かつ現在のターンがあなたのターンならば、攻撃『適正距離0-5、0/0、【攻撃後】相手のオーラに2ダメージを与え、このターンにあなたが次に行う<攻撃>は+0/+1となる』を行う。'
    }],
    changespecial: [{
      changeIndex: '3',
      id: '02-saine-a2-s-3',
      name: '绝唱绝华',
      namejp: '絶唱絶华',
      namekr: '절창절화',
      baseType: 'special',
      types: ['attack', 'reaction'],
      cost: '1',
      range: '0-10',
      damage: '2/-',
      text: '终端\n【攻击后】被对应的《攻击》结算完毕后，若你选择用装承受该《攻击》的伤害，且自装中的樱花结晶的数目等于0，则结束当前阶段。',
      textjp: '終端\n【攻撃後】対応した《攻撃》の解決後に、その《攻撃》でオーラへのダメージが選ばれ、かつあなたのオーラが0ならば現在のフェイズを終了する。'
    }]
  }]
},
{
  name: 'HIMIKA 绯弥香',
  namejp: 'ヒミカ',
  namekr: '히미카',
  nameen: 'HIMIKA',
  desc: '连火～若此牌为本回合内你使用的第3张或之后的牌，则你的一部分牌会获得强化。',
  descjp: '連火～あなたが1ターン中に３枚以上のカードを使用するならば、いくつかのカードが強化される。',
  // girlInfo: '身高：173cm\n喜欢的东西：人間、良い景色、新しいもの\n<b>--物語--</b>\n「バーン！ バーン！ そんでバーン！ ……な、簡単だろ？」\nヒミカは比較的旧いメガミであり、強い自然の力を持っています。万象の根幹に近しい力である炎を象徴するのですから、それも当然のことでしょう。彼女の炎は扱う者の感情とも直結しており、ある意味では感情を象徴しているとも言えます。しかし残念ながらバカです。\n人間好きで気さくなため、人間との友好関係の広さは随一と言えます。新しいものや楽しいものを好み、特にここ数十年は海の向こうに強い関心を持っています。彼女の銃も３０年ほど昔、海の向こうより伝わったもの元にして、ハガネと共に作り上げたものです。',
  // girlInfojp: '身長：173cm\n好きなもの：人間、良い景色、新しいもの\n<b>--物語--</b>\n「バーン！ バーン！ そんでバーン！ ……な、簡単だろ？」\nヒミカは比較的旧いメガミであり、強い自然の力を持っています。万象の根幹に近しい力である炎を象徴するのですから、それも当然のことでしょう。彼女の炎は扱う者の感情とも直結しており、ある意味では感情を象徴しているとも言えます。しかし残念ながらバカです。\n人間好きで気さくなため、人間との友好関係の広さは随一と言えます。新しいものや楽しいものを好み、特にここ数十年は海の向こうに強い関心を持っています。彼女の銃も３０年ほど昔、海の向こうより伝わったもの元にして、ハガネと共に作り上げたものです。',
  list: [{
    name: '铳',
    namejp: '銃',
    namekr: '총',
    nameen: 'ARQUEBUS',
    isSelect: false,
    pic: 'twiicon_sa_02.jpg',
    picq: 'sd_himika.png',
    normal: [{
      id: '03-himika-o-n-1',
      name: '射击',
      namejp: 'シュート',
      namekr: '슛',
      baseType: 'normal',
      types: ['attack'],
      range: '4-10',
      damage: '2/1',
      text: '',
      textjp: ''
    },
    {
      id: '03-himika-o-n-2',
      name: '速射',
      namejp: 'ラピッドファイア',
      namekr: '래피드 파이어',
      baseType: 'normal',
      types: ['attack'],
      range: '6-8',
      damage: '2/1',
      text: '【常时】连火～若此牌为本回合内你使用的第3张或之后的牌，则此《攻击》获得+1/+1。',
      textjp: '【常時】連火-このカードがこのターンに使用した3枚目以降のカードならば、この《攻撃》は+1/+1となる。',
      textkr: '【상시】연화-이 카드가 이 턴에 사용한 3장째 이후의 카드라면, 이 《공격》은 +1/+1이 된다.'
    },
    {
      id: '03-himika-o-n-3',
      name: '麦林加农炮',
      namejp: 'マグナムカノン',
      namekr: '매그넘 캐논',
      baseType: 'normal',
      types: ['attack'],
      range: '5-8',
      damage: '3/2',
      text: '【攻击后】自命（1）→虚',
      textjp: '【攻撃後】自ライフ→ダスト：1',
      textkr: '【공격후】자신 라이프→더스트：1'
    },
    {
      id: '03-himika-o-n-4',
      name: '完全爆破',
      namejp: 'フルバースト',
      namekr: '풀 버스트',
      baseType: 'normal',
      types: ['attack', 'fullpower'],
      range: '5-9',
      damage: '3/1',
      text: '【常时】此《攻击》对敌装和敌命均造成伤害。',
      textjp: '【常時】この《攻撃》がダメージを与えるならば、相手は片方を選ぶのではなく両方のダメージを受ける。',
      textkr: '【상시】이 《공격》이 대미지를 준다면, 상대는 한쪽을 고르는 것이 아닌 양방 모두의 대미지를 받는다.'
    },
    {
      id: '03-himika-o-n-5',
      name: '后跳',
      namejp: 'バックステップ',
      namekr: '백스탭',
      baseType: 'normal',
      types: ['action'],
      text: '抓一张牌。 \n虚（1）→距',
      textjp: 'カードを1枚引く。 \nダスト→間合：1',
      textkr: '카드를 1장 뽑는다. \n더스트→간격：1'
    },
    {
      id: '03-himika-o-n-6',
      name: '回燃',
      namejp: 'バックドラフト',
      namekr: '백 드래프트',
      baseType: 'normal',
      types: ['action'],
      text: '对手畏缩。\n连火～若此牌为本回合内你使用的第3张或之后的牌，则本回合内你的其他女神的下一次对装伤害不为“-”的《攻击》获得+1/+1。',
      textjp: '相手を畏縮させる。\n連火-このカードがこのターンに使用した3枚目以降のカードならば、このターンにあなたが次に行う他のメガミによるオーラへのダメージが「-」でない《攻撃》を+1/+1する。',
      textkr: '상대를 위축시킨다。\n 연화-이 카드가 이 턴에 사용한 3장째 이후의 카드라면, 이 턴 당신이 다음에 행하는 다른 여신에 의한 오라 데미지가 「-」이 아닌 《공격》을 +1/+1 한다.'
    },
    {
      id: '03-himika-o-n-7',
      name: '迷烟',
      namejp: 'スモーク',
      namekr: '스모크',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '3',
      text: '【展开中】距中的樱花结晶不能被卡牌上的箭头效果移出距。',
      textjp: '【展開中】カードの矢印(→)により間合にある桜花結晶は移動しない。',
      textkr: '【전개중】간격에 있는 벚꽃 결정은 카드의 화살표(→)에 의해서는 이동하지 않는다.'
    }],
    special: [{
      id: '03-himika-o-s-1',
      name: '真红凶弹',
      namejp: 'レッドバレット',
      namekr: '레드 블릿',
      baseType: 'special',
      types: ['attack'],
      range: '5-10',
      damage: '3/1',
      cost: '0',
      text: '',
      textjp: ''
    },
    {
      id: '03-himika-o-s-2',
      name: '绯红零时',
      namejp: 'クリムゾンゼロ',
      namekr: '크림즌 제로',
      baseType: 'special',
      types: ['attack'],
      range: '0-2',
      damage: '2/2',
      cost: '5',
      text: '【常时】此《攻击》对敌装和敌命均造成伤害。\n【常时】若当前距离等于0，则此《攻击》获得不可被对应。',
      textjp: '【常時】この《攻撃》がダメージを与えるならば、相手は片方を選ぶのではなく両方のダメージを受ける。\n【常時】現在の間合が0ならば、この《攻撃》は対応不可を得る。',
      textkr: '【상시】이 《공격》이 대미지를 주었다면, 상대는 한쪽을 고르는 것이 아닌 양쪽의 대미지를 받는다.\n【상시】현재 간격이 0이라면, 이 《공격》은 대응불가를 얻는다.'
    },
    {
      id: '03-himika-o-s-3',
      name: '猩红狂想',
      namejp: 'スカーレットイマジン',
      namekr: '스칼렛 이매진',
      baseType: 'special',
      types: ['action'],
      cost: '3',
      text: '抓2张牌，然后盖伏1张牌。',
      textjp: 'カードを2枚引く。その後、あなたは手札を1枚伏せ札にする。',
      textkr: '카드를 2장 뽑는다. 그 후, 당신은 손패를 1장 덮임패로 한다.'
    },
    {
      id: '03-himika-o-s-4',
      name: '真红领域',
      namejp: 'ヴァーミリオンフィールド',
      namekr: '버밀리언 필드',
      baseType: 'special',
      types: ['action'],
      cost: '2',
      text: '连火～若此牌为本回合内你使用的第3张或之后的牌，则虚（2）→距\n----\n【再起】你的手牌张数等于0。',
      textjp: '連火-このカードがこのターンに使用した3枚目以降のカードならば、ダスト→間合：2\n----\n【再起】あなたの手札が0枚である。',
      textkr: '연화-이 카드가 이 턴에 사용한 3장째 이후의 카드라면, 더스트→간격：2\n----\n【재기】당신의 손패가 0장이다.'
    }]
  },
  {
    name: '炎',
    namejp: '炎',
    namekr: '화염',
    nameen: 'FLAME',
    isSelect: false,
    pic: 'twiicon_sa_16.jpg',
    picq: 'sd_himika_a1.png',
    changenormal: [{
      changeIndex: '2',
      id: '03-himika-a1-n-2',
      name: '火炎流',
      namejp: '火炎流',
      namekr: '화염류',
      baseType: 'normal',
      types: ['attack'],
      range: '1-3',
      damage: '2/1',
      text: '【常时】连火～若此牌为本回合内你使用的第3张或之后的牌，则此《攻击》获得+0/+1。',
      textjp: '【常時】連火-このカードがこのターンに使用した3枚目以降のカードならば、この《攻撃》は+0/+1となる。',
      textkr: '【상시】연화-이 카드가 이 턴에 사용한 3장째 이후의 카드라면, 이 《공격》은 +0/+1이 된다.'
    },
    {
      changeIndex: '5',
      id: '03-himika-a1-n-5',
      name: '杀意',
      namejp: '殺意',
      namekr: '살의',
      baseType: 'normal',
      types: ['action'],
      text: '若你的手牌张数等于0，则敌装（2）→虚。',
      textjp: 'あなたの手札が0枚ならば、相オーラ→ダスト：2',
      textkr: '당신의 손패가 0장이라면, 상대 오라→더스트：2'
    }],
    changespecial: [{
      changeIndex: '2',
      id: '03-himika-a1-s-2',
      name: '炎天·红绯弥香',
      namejp: '炎天・紅緋弥香',
      namekr: '염천・쿠레나이 히미카',
      baseType: 'special',
      types: ['attack', 'fullpower'],
      range: '0-7',
      damage: 'X/X',
      cost: '5',
      text: '不可被对应\n【常时】X等于8减去当前距离。\n【攻击后】你输掉本局游戏。',
      textjp: '対応不可 \n【常時】Xは8から現在の間合を引いた値に等しい。 \n【攻撃後】あなたは敗北する。',
      textkr: '"대응불가 \n【상시】X는 8에서 현재 간격을 뺀 수치와 같다.\n【공격후】당신은 패배한다."'
    }]
  }]
},
{
  name: 'TOKOYO 常世',
  namejp: 'トコヨ',
  namekr: '토코요',
  nameen: 'TOKOYO',
  desc: '境地～若你的集中力等于2，则你的一部分牌会获得强化。',
  descjp: '境地～あなたの集中力が2ならば、いくつかのカードが強化される。',
  // girlInfo: '身高：141cm\n喜欢的东西：芸術全般、批評、恋愛小説（甘ったるいやつ）\n<b>--物語--</b>\n「あんたの舞い、一応期待しといてあげる」\nトコヨは生粋の芸術家であり、批評家でもあります。伝統や古典を重んじる頑固で厳格な気質を持ちます。彼女は時おり人の世へと顕現し、お忍びの芸術家として創作や批評へと打ち込むこともあります（この体格なので、分かる人には分かってしまうのですが）。\n決闘については、本分を芸術に置いているためさほど乗り気ではありません。しかし負けず嫌いな気質ゆえか、力を貸すのはやぶさかではないようです。\n最近は恋愛小説、特に甘ったるいものが気になっているようで、隠れて読んでいる所が目撃されています。',
  // girlInfojp: '身長：141cm\n好きなもの：芸術全般、批評、恋愛小説（甘ったるいやつ）\n<b>--物語--</b>\n「あんたの舞い、一応期待しといてあげる」\nトコヨは生粋の芸術家であり、批評家でもあります。伝統や古典を重んじる頑固で厳格な気質を持ちます。彼女は時おり人の世へと顕現し、お忍びの芸術家として創作や批評へと打ち込むこともあります（この体格なので、分かる人には分かってしまうのですが）。\n決闘については、本分を芸術に置いているためさほど乗り気ではありません。しかし負けず嫌いな気質ゆえか、力を貸すのはやぶさかではないようです。\n最近は恋愛小説、特に甘ったるいものが気になっているようで、隠れて読んでいる所が目撃されています。',
  list: [{
    name: '扇',
    namejp: '扇',
    namekr: '부채',
    nameen: 'FAN',
    isSelect: false,
    pic: 'twiicon_sa_03.jpg',
    picq: 'sd_tokoyo.png',
    normal: [{
      id: '04-tokoyo-o-n-1',
      name: '梳流',
      namejp: '梳流し',
      namekr: '빗어 내리기',
      baseType: 'normal',
      types: ['attack'],
      range: '4',
      damage: '-/1',
      text: '【攻击后】境地～若你的集中力等于2，则将此牌置于你的牌库顶。',
      textjp: '【攻撃後】境地-あなたの集中力が2ならば、このカードを山札の上に戻す。',
      textkr: '【공격후】경지-당신의 집중력이 2라면, 이 카드를 패산 위로 되돌린다.'
    },
    {
      id: '04-tokoyo-o-n-2',
      name: '雅击',
      namejp: '雅打ち',
      namekr: '우아한 타격',
      baseType: 'normal',
      types: ['attack', 'reaction'],
      range: '2-4',
      damage: '2/1',
      text: '【攻击后】境地～若你的集中力等于2，则打消被对应的非王牌的《攻击》。',
      textjp: '【攻撃後】境地-あなたの集中力が2ならば、対応した切札でない《攻撃》を打ち消す。',
      textkr: '【공격후】경지-당신의 집중력이 2라면, 대응한 비장패가 아닌 《공격》을 무효화한다.'
    },
    {
      id: '04-tokoyo-o-n-3',
      name: '脱兔',
      namejp: '跳ね兎',
      namekr: '뛰어오르는 토끼',
      baseType: 'normal',
      types: ['action'],
      text: '若当前距离小于等于3，则虚（2）→距',
      textjp: '現在の間合が3以下ならば、ダスト→間合：2',
      textkr: '현재 간격이 3 이하라면, 더스트→간격：2'
    },
    {
      id: '04-tokoyo-o-n-4',
      name: '诗舞',
      namejp: '詩舞',
      namekr: '시의 춤',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '获得1点集中力，选择1项：\n1.自气（1）→自装\n2.自装（1）→距',
      textjp: '集中力を1得て、以下から1つを選ぶ。\n・自フレア→自オーラ：1\n・自オーラ→間合：1',
      textkr: '집중력을 1 얻고, 이하에서 하나를 고른다.\n ・자신 플레어→자신 오라：1\n ・자신 오라→간격：1'
    },
    {
      id: '04-tokoyo-o-n-5',
      name: '扇回旋',
      namejp: '要返し',
      namekr: '부채 뒤집기',
      baseType: 'normal',
      types: ['action', 'fullpower'],
      text: '从你的弃牌和/或盖牌中选择至多2张牌，将它们以任意顺序置于你的牌库底。 \n虚（2）→自装',
      textjp: '捨て札か伏せ札からカードを2枚まで選ぶ。それらのカードを好きな順で山札の底に置く。 \nダスト→自オーラ：2',
      textkr: '버림패나 덮임패에서 카드를 2장까지 고른다. 이 카드들을 원하는 순으로 패산의 밑에 둔다. \n 더스트→자신 오라：2'
    },
    {
      id: '04-tokoyo-o-n-6',
      name: '风舞台',
      namejp: '風舞台',
      namekr: '바람의 무대',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '2',
      text: '【展开时】距（2）→自装 \n【破弃时】自装（2）→距',
      textjp: '【展開時】間合→自オーラ：2 \n【破棄時】自オーラ→間合：2',
      textkr: '【전개시】간격→자신 오라：2 \n 【파기시】자신 오라→간격：2'
    },
    {
      id: '04-tokoyo-o-n-7',
      name: '晴舞台',
      namejp: '晴舞台',
      namekr: '맑음의 무대',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '2',
      text: '终端\n【展开时】你的集中力变为2。\n【破弃时】进行一次“攻击距离3-6 伤害-/1”的攻击。',
      textjp: '終端\n【展開時】あなたの集中力は2になる。\n【破棄時】攻撃『適正距離3-6、-/1』を行う。'
    }],
    special: [{
      id: '04-tokoyo-o-s-1',
      name: '久远之花',
      namejp: '久遠ノ花',
      namekr: '영원한 꽃',
      baseType: 'special',
      types: ['attack', 'reaction'],
      range: '0-10',
      damage: '-/1',
      cost: '5',
      text: '【攻击后】打消被对应的《攻击》。',
      textjp: '【攻撃後】対応した《攻撃》を打ち消す。',
      textkr: '【공격후】대응한 《공격》을 무효화한다.'
    },
    {
      id: '04-tokoyo-o-s-2',
      name: '千岁之鸟',
      namejp: '千歳ノ鳥',
      namekr: '천년의 새',
      baseType: 'special',
      types: ['attack'],
      range: '3-4',
      damage: '2/2',
      cost: '2',
      text: '【攻击后】重铸牌库（你不会因此受到伤害）。',
      textjp: '【攻撃後】山札を再構成する。 \n(その際にダメージは受けない)',
      textkr: '【공격후】패산을 재구성한다.\n (이 때에는 대미지를 받지 않는다.)'
    },
    {
      id: '04-tokoyo-o-s-3',
      name: '无穷之风',
      namejp: '無窮ノ風',
      namekr: '무궁한 바람',
      baseType: 'special',
      types: ['attack'],
      range: '3-8',
      damage: '1/1',
      cost: '1',
      text: '不可被对应\n【攻击后】对手从手牌中弃置1张非《攻击》的牌。若不能如此做，对手须展示其手牌。\n----\n【再起】境地～你的集中力等于2。',
      textjp: '対応不可 \n【攻撃後】相手は手札から《攻撃》でないカード1枚を捨て札にする。それが行えない場合、相手は手札を公開する。 \n----\n【再起】境地-あなたの集中力が2である。',
      textkr: '대응불가 \n 【공격후】상대는 손패에서 《공격》이 아닌 카드 1장을 버림패로 한다. 불가능하다면, 상대는 손패를 공개한다.\n ----\n 【재기】경지-당신의 집중력이 2이다.'
    },
    {
      id: '04-tokoyo-o-s-4',
      name: '常世之月',
      namejp: '常世ノ月',
      namekr: '토코요의 달',
      baseType: 'special',
      types: ['action'],
      cost: '2',
      text: '你的集中力变为2，对手的集中力变为0，对手畏缩。',
      textjp: 'あなたの集中力は2になり、相手の集中力は0になり、相手を畏縮させる。',
      textkr: '당신의 집중력이 2가 되고, 상대의 집중력이 0이 되고, 상대를 위축시킨다。'
    }]
  },
  {
    name: '笛',
    namejp: '笛',
    namekr: '피리',
    nameen: 'FLUTE',
    isSelect: false,
    pic: 'twiicon_sa_18.jpg',
    picq: 'sd_tokoyo_a1.png',
    changenormal: [{
      changeIndex: '1',
      id: '04-tokoyo-a1-n-1',
      name: '奏流',
      namejp: '奏流し',
      namekr: '연주 내리기',
      baseType: 'normal',
      types: ['attack'],
      range: '5',
      damage: '-/1',
      text: '【常时】若你有至少1张常世的王牌处于使用后状态，则此《攻击》获得不可被对应。\n【攻击后】境地～若你的集中力等于2，且你有至少1张其他女神的王牌处于使用后状态，则将此牌置于你的牌库顶。',
      textjp: '【常時】あなたのトコヨの切札が1枚以上使用済ならば、この《攻撃》は対応不可を得る。 \n【攻撃後】境地-あなたの集中力が2かつ、あなたの他のメガミの切札が1枚以上使用済ならば、このカードを山札の上に置く。',
      textkr: '【상시】당신의 토코요의 비장패가 1장 이상 사용완료라면, 이 《공격》은 대응불가를 얻는다.\n 【공격후】경지-당신의 집중력이 2이고, 당신의 다른 여신의 비장패가 1장 이상 사용완료라면, 이 카드를 패산 위에 둔다.'
    },
    {
      changeIndex: '5',
      id: '04-tokoyo-a1-n-5',
      name: '阳之音',
      namejp: '陽の音',
      namekr: '햇볕의 소리',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '2',
      text: '【展开中】每当你使用具《对应》副类别的牌时，该牌结算完毕后虚（1）→自装\n【展开中】对手的回合内不能移除此牌上的樱花结晶。',
      textjp: '【展開中】あなたが《対応》カードを使用した時、その解決後にダスト→自オーラ：1 \n【展開中】相手のターンにこのカードの上の桜花結晶は移動しない。',
      textkr: '【전개중】당신이 《대응》카드를 사용했을 때, 그 해결 후 더스트→자신 오라：1 \n【전개중】상대 턴에 이 카드 위 벚꽃 결정은 이동하지 않는다.'
    }],
    changespecial: [{
      changeIndex: '2',
      id: '04-tokoyo-a1-s-2',
      name: '二重奏：吹弹阳明',
      namejp: '二重奏：吹弾陽明',
      namekr: '이중주:취탄양명',
      baseType: 'special',
      types: ['action'],
      cost: '1',
      text: '【使用后】你的准备阶段开始时，你可以选择一项：\n1.从你的盖牌中选择1张牌，将其置于你的牌库底；\n2.从你的弃牌中选择1张《行动》牌，将其置于你的牌库底。\n----\n【即再起】自命受到除重铸牌库以外的大于等于1点的伤害。',
      textjp: '【使用済】あなたの開始フェイズの開始時に以下のどちらかを行ってもよい。\n・あなたの伏せ札からカード1枚を選び、山札の底に置く。 \n・あなたの捨て札から《行動》カード1枚を選び、山札の底に置く。 \n----\n【即再起】あなたが再構成以外でライフに1以上のダメージを受ける。',
      textkr: '【사용완료】당신의 개시 페이즈 시작시에 이하에서 하나를 행해도 좋다.\n・당신의 덮임패에서 카드를 1장 골라, 패산 밑에 둔다.\n・당신의 버림패에서 《행동》카드를 1장 골라, 패산 밑에 둔다.\n----\n【즉재기】당신이 재구성 이외로 라이프에 1 이상의 대미지를 받는다.'
    }]
  }, {
    name: '恐怖',
    namejp: '恐怖',
    isSelect: false,
    pic: 'twiicon_sa_35.jpg',
    picq: 'sd_tokoyo_a2.png',
    changenormal: [{
      changeIndex: '2',
      id: '04-tokoyo-a2-n-2',
      name: '畏掠',
      namejp: '畏掠め',
      baseType: 'normal',
      types: ['attack', 'reaction'],
      range: '2-3',
      damage: '2/1',
      text: '【常时】若对手的集中力等于0，则由你选择对手如何承受此攻击的伤害。\n【攻击后】境地～若你的集中力等于2，则被对应的非王牌的《攻击》获得-X/-Y。X等于此《攻击》造成的对装的伤害，Y等于此攻击造成的对命的伤害。',
      textjp: '【常時】相手の集中力が0ならば、この《攻撃》のダメージはあなたが選ぶ。\n【攻撃後】境地―あなたの集中力が2ならば、対応した切札でない《攻撃》は-X/-Yとなる。Xはこの《攻撃》が与えたオーラへのダメージ、Yはライフへのダメージに等しい。'
    }],
    changespecial: [{
      changeIndex: '2',
      id: '04-tokoyo-a2-s-2',
      name: '悠久之雪',
      namejp: '悠久ノ雪',
      baseType: 'special',
      types: ['attack'],
      cost: '1',
      range: '3-5',
      damage: '1/1',
      text: '【攻击后】若对手选择由装承受此次伤害，则\n敌气（1）→自装\n----\n【再起】对手的集中力等于1。',
      textjp: '【攻撃後】相手がオ一ラへのダメ一ジを選んだならば、\n相フレア→自オーラ：1\n----\n【再起】相手の集中力が1である。'
    }, {
      changeIndex: '3',
      id: '04-tokoyo-a2-s-3',
      name: '徒寄之八重樱',
      namejp: '徒寄ノ八重桜',
      baseType: 'special',
      types: ['action'],
      cost: '4',
      text: '进行5次基本动作《装附》。\n【使用后】当你的牌上的箭头效果将樱花结晶移至自装时，自装上限视为8。\n【使用后】你的准备阶段开始时，若自装中的樱花结晶的数目大于等于6，则进行一次“攻击距离0-8 伤害-/1”的攻击。',
      textjp: 'あなたは基本動作《纏い》を5回行う。\n【使用済】あなたのカ一ドの矢印効果があなたのオ一ラへと桜花結晶を動かすならば、その間だけオ一うの上限を8として扱う。\n【使用済】あなたの開始フェイズの開始時にあなたのオ一ラが6以上ならば、攻撃『適正距離0-8、-/1』を行う。'
    }]
  }]
},
{
  name: 'OBORO 胧',
  namejp: 'オボロ',
  namekr: '오보로',
  nameen: 'OBORO',
  desc: '设置～每当你将要重铸牌库时，若你的盖牌区中有具设置关键字的牌，则你可以使用其中的1张。',
  descjp: '設置～設置を持つカードが伏せ札にある際に山札の再構成を行う場合、再構成の直前にその中の1枚を伏せ札から使用してもよい。',
  // girlInfo: '身高：145cm\n喜欢的东西：実験、フィールドワーク、水泳、寫眞撮影\n<b>--物語--</b>\n「共に忍の道を行くお主を   拙者は歓迎するぞ」\nオボロは自然を知り、自然と共に在り続ける求道者で、同時に優れた生物学者でもあります。常に人の世に顕現している変わり者で、深い森の中で研究を続けています。\nストイックに己を磨き、探求を続けるその姿からいつしか周囲に人が集い、彼女を模倣する形でこの世界の「忍」が生まれることとなりました。時が流れるに従い彼女の側も忍たちの影響を受けるようになり、今では双方向に影響し合う忍の里という共同体を作り出しています。\n共同体の長ゆえか、メガミにしては面倒見が良く常識人です。たまに暴走することもありますが。',
  // girlInfojp: '身長：145cm\n好きなもの：実験、フィールドワーク、水泳、寫眞撮影\n<b>--物語--</b>\n「共に忍の道を行くお主を   拙者は歓迎するぞ」\nオボロは自然を知り、自然と共に在り続ける求道者で、同時に優れた生物学者でもあります。常に人の世に顕現している変わり者で、深い森の中で研究を続けています。\nストイックに己を磨き、探求を続けるその姿からいつしか周囲に人が集い、彼女を模倣する形でこの世界の「忍」が生まれることとなりました。時が流れるに従い彼女の側も忍たちの影響を受けるようになり、今では双方向に影響し合う忍の里という共同体を作り出しています。\n共同体の長ゆえか、メガミにしては面倒見が良く常識人です。たまに暴走することもありますが。',
  list: [{
    name: '忍',
    namejp: '忍',
    namekr: '인술',
    nameen: 'NINJUTSU',
    isSelect: false,
    pic: 'twiicon_sa_04.jpg',
    picq: 'sd_oboro.png',
    normal: [{
      id: '05-oboro-o-n-1',
      name: '钢丝',
      namejp: '鋼糸',
      namekr: '철사',
      baseType: 'normal',
      types: ['attack'],
      range: '3-4',
      damage: '2/2',
      text: '设置',
      textjp: '設置',
      textkr: '설치'
    },
    {
      id: '05-oboro-o-n-2',
      name: '影菱',
      namejp: '影菱',
      namekr: '그림자 마름',
      baseType: 'normal',
      types: ['attack'],
      range: '2',
      damage: '2/1',
      text: '设置 不可被对应 \n【攻击后】若你从盖牌区使用此牌，则检视对手的手牌，从中选择1张并盖伏。',
      textjp: '設置　対応不可\n【攻撃後】このカードを伏せ札から使用したならば、相手の手札を見てその中から1枚を選び、それを伏せ札にする。',
      textkr: '설치 대응불가\n 【공격후】이 카드를 덮임패에서 사용했다면, 상대의 손패를 보고 그 중 1장을 골라, 그것을 덮임패로 한다.'
    },
    {
      id: '05-oboro-o-n-3',
      name: '斩击乱舞',
      namejp: '斬撃乱舞',
      namekr: '참격난무',
      baseType: 'normal',
      types: ['attack', 'fullpower'],
      range: '2-4',
      damage: '3/2',
      text: '【常时】若本回合内敌装受到过伤害，则此《攻击》获得+1/+1。',
      textjp: '【常時】相手がこのターン中にオーラへのダメージを受けているならば、この《攻撃》は+1/+1となる。',
      textkr: '【상시】상대가 이 턴 안에 오라로의 대미지를 받았다면, 이 《공격》은 +1/+1이 된다.'
    },
    {
      id: '05-oboro-o-n-4',
      name: '忍步',
      namejp: '忍歩',
      namekr: '닌자걸음',
      baseType: 'normal',
      types: ['action'],
      text: '设置\n虚 (1)→ 距\n若你从盖牌区中使用此牌，则你可以从盖牌区中额外使用1张具设置关键字的牌。',
      textjp: '設置 \nダスト→間合：1 \nこのカードを伏せ札から使用したならば、伏せ札から設置を持つカードを1枚使用してもよい。',
      textkr: '설치 \n더스트→간격：1 \n이 카드를 덮임패에서 사용했다면, 덮임패에서 설치를 갖는 카드를 1장 사용해도 좋다.'
    },
    {
      id: '05-oboro-o-n-5',
      name: '诱导',
      namejp: '誘導',
      namekr: '유도',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '设置 \n选择1项：\n1.距（1）→敌装\n2.敌装（1）→敌气',
      textjp: '設置\n以下から１つを選ぶ。\n・間合→相オーラ：1\n・相オーラ→相フレア：1',
      textkr: '설치\n 이하에서 하나를 고른다.\n ・간격→상대 오라：1\n ・상대 오라→상대 플레어：1'
    },
    {
      id: '05-oboro-o-n-6',
      name: '分身术',
      namejp: '分身の術',
      namekr: '분신술',
      baseType: 'normal',
      types: ['action', 'fullpower'],
      text: '从盖牌区中选择1张不具《全力》副类别的牌使用。若该牌因此进入弃牌区，则从弃牌区中再使用1次。若所选择的牌是《攻击》牌，则此《攻击》获得不可被对应（2次都获得不可被对应）。',
      textjp: '伏せ札から《全力》でないカードを1枚選び、そのカードを使用する。その後、そのカードが捨て札にあるならば捨て札からもう1回使用する。《攻撃》カードが使用されたならばそれらの《攻撃》は対応不可を得る（2回ともに対応不可を得る）。',
      textkr: '덮임패에서 《전력》이 아닌 카드를 1장 골라, 그 카드를 사용한다. 그 후, 그 카드가 버림패에 있다면 버림패에서 한번 더 사용한다. 《공격》카드가 사용됐다면 그 《공격》들은 대응불가를 얻는다（2번 모두 대응불가를 얻는다）.'
    },
    {
      id: '05-oboro-o-n-7',
      name: '生物活性',
      namejp: '生体活性',
      namekr: '생체활성',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '4',
      text: '破绽 设置 \n【破弃时】将你的1张处于使用后状态的王牌变为未使用状态。',
      textjp: '隙　設置 \n【破棄時】あなたの使用済の切札を1枚選び、それを未使用に戻す。',
      textkr: '빈틈 설치 \n 【파기시】당신의 사용완료 비장패를 1장 골라, 그것을 미사용으로 되돌린다.'
    }],
    special: [{
      id: '05-oboro-o-s-1',
      name: '熊介',
      namejp: '熊介',
      namekr: '쿠마스케',
      baseType: 'special',
      types: ['attack', 'fullpower'],
      range: '3-4',
      damage: '2/2',
      cost: '4',
      text: '【攻击后】进行X次“攻击距离3-4 伤害2/2”的攻击，X等于你盖牌区中的牌张数。',
      textjp: '【攻撃後】攻撃『適正距離3-4、2/2』をX回行う。Xはあなたの伏せ札の枚数に等しい。',
      textkr: '【공격후】공격『적정거리3-4、2/2』을 X번 행한다. X는 당신의 덮임패 장수와 같다.'
    },
    {
      id: '05-oboro-o-s-2',
      name: '鸢影',
      namejp: '鳶影',
      namekr: '토비카게',
      baseType: 'special',
      types: ['action', 'reaction'],
      cost: '4',
      text: '你可以从盖牌中选择1张不具《全力》副类别的牌并使用之。若此牌对应了一个《攻击》，则视为所选择的牌也对应了该《攻击》。',
      textjp: '伏せ札から《全力》でないカードを1枚選び、そのカードを使用してもよい。この際、このカードが対応している《攻撃》があるならば、使用されたカードはそれに対応しているものと扱う。',
      textkr: '덮임패에서 《전력》이 아닌 카드를 1장 골라, 그 카드를 사용해도 좋다. 이 때, 이 카드가 대응하는 《공격》이 있다면, 사용된 카드는 그것에 대응하고 있는것으로 취급한다.'
    },
    {
      id: '05-oboro-o-s-3',
      name: '虚鱼',
      namejp: '虚魚',
      namekr: '우로우오',
      baseType: 'special',
      types: ['action'],
      cost: '4',
      text: '【使用后】每当你将要重铸1次牌库时，你可以以任意顺序使用任意张具设置关键字的牌。',
      textjp: '【使用済】あなたは1回の再構成に対して、設置を持つカードを任意の枚数、任意の順で使用できる。',
      textkr: '【사용완료】당신은 한 번의 재구성에 대해, 설치를 갖는 카드를 임의의 장수, 임의의 순서로 사용 가능하다.'
    },
    {
      id: '05-oboro-o-s-4',
      name: '壬蔓',
      namejp: '壬蔓',
      namekr: '미카즈라',
      baseType: 'special',
      types: ['attack'],
      range: '3-7',
      damage: '1/1',
      cost: '0',
      text: '【攻击后】虚（1）→自气 \n----\n【再起】自气中的樱花结晶的数目等于0。',
      textjp: '【攻撃後】ダスト→自フレア：1 \n----\n【再起】あなたのフレアが0である。',
      textkr: '더스트→자신 플레어：1 \n ----\n 【재기】당신의 플레어가 0이다.'
    }]
  },
  {
    name: '战略',
    namejp: '戦略',
    namekr: '전략',
    nameen: 'STRATEGY',
    isSelect: false,
    pic: 'twiicon_sa_19.jpg',
    picq: 'sd_oboro_a1.png',
    changenormal: [{
      changeIndex: '2',
      id: '05-oboro-a1-n-2',
      name: '手里剑',
      namejp: '手裏剣',
      namekr: '수리검',
      baseType: 'normal',
      types: ['attack'],
      range: '3-5',
      damage: '2/1',
      text: '【常时】你的结束阶段开始时，若双方盖牌区中的牌张数之和大于等于5，则你可以将此牌从弃牌区置入手牌。。',
      textjp: '【常時】あなたの終了フェイズに両者の伏せ札が合計5枚以上あるならば、このカードを捨て札から手札に戻してもよい。',
      textkr: '【상시】당신의 종료 페이즈에 양플레이어의 덮임패 합계가 5장 이상이라면, 이 카드를 덮임패에서 손패로 되돌려도 좋다.'
    },
    {
      changeIndex: '3',
      id: '05-oboro-a1-n-3',
      name: '突袭',
      namejp: '不意打ち',
      namekr: '기습',
      baseType: 'normal',
      types: ['attack', 'fullpower'],
      range: '1-3',
      damage: '4/3',
      text: '不可被对应（通常牌）\n【常时】此《攻击》获得-X/-X，X等于对手盖牌区中的牌张数。',
      textjp: '対応不可（通常札） \n【常時】この《攻撃》は-X/-Xとなる。Xは相手の伏せ札の枚数に等しい。',
      textkr: '대응불가（통상패） \n【상시】이 《공격》은 -X/-X 가 된다. X는 상대 덮임패의 장수와 같다.'
    }],
    changespecial: [{
      changeIndex: '4',
      id: '05-oboro-a1-s-4',
      name: '神代枝',
      namejp: '神代枝',
      namekr: '신이 깃든 가지',
      baseType: 'special',
      types: ['action', 'fullpower'],
      cost: '0',
      text: '游戏外（1）→自装\n游戏外（1）→自气\n将『最后的结晶』从追加牌区以未使用状态加入王牌，将此牌移出游戏。',
      textjp: 'ゲーム外→自オーラ：1 \nゲーム外→自フレア：1 \nこのカードを取り除き、切札「最後の結晶」を追加札から未使用で得る。',
      textkr: '게임 밖→자신 오라：1 \n게임 밖→자신 플레어：1 \n이 카드를 제외하고, 비장패 「최후의 결정」을 추가패에서 미사용으로 얻는다.'
    }],
    changeExtra: [{
      id: '05-oboro-a1-s-4-ex1',
      name: '最后的结晶',
      namejp: '最後の結晶',
      namekr: '최후의 결정',
      baseType: 'special',
      extraFrom: '05-oboro-a1-s-4',
      types: ['action'],
      cost: '3',
      text: '【常时】此牌不能以正常方法使用。仅当你将第一次输掉本局游戏时，可以防止此次失败，将自命中的所有樱花结晶移至虚，并立即使用此牌（仍需支付费用）。\n盖伏1张手牌，虚（1）→自命',
      textjp: '【常時】このカードはこの効果でのみ使用できる。あなたが初めて敗北するならば、代わりにあなたのライフ全てをダストに送り、このカードを使用してもよい(消費は支払う)。 \n手札を一枚伏せ札にし、ダスト→自ライフ：1',
      textkr: '상시】이 카드는 이 효과로만 사용할 수 있다. 당신이 최초로 패배했다면, 대신에 당신의 모든 라이프를 더스트로 옮기고 이 카드를 사용해도 좋다(코스트는 지불한다).\n손패를 1장 덮임패로 하고,\n더스트→자신 라이프：1'
    }]
  }]
},
{
  name: 'YUKIHI 雪灯',
  namejp: 'ユキヒ',
  namekr: '유키히',
  nameen: 'YUKIHI',
  desc: '变貌～伞面具有开伞和闭伞两种状态，你的一部分牌的效果会根据伞面状态发生变化。游戏开始时伞面的状态为闭伞。每当你的结束阶段开始时，你可以进行伞的开合操作，改变伞面的状态。（用伞面状态卡表示）',
  descjp: '変貌～傘が閉じている状態と開いている状態があり、いくつかのカードは状態に応じて効果が変わる。ゲーム開始時は閉じた状態である。あなたの終了フェイズに1回、傘の開閉を行い、状態を変えられる（傘カードで表す）。',
  // girlInfo: '身高：156cm\n喜欢的东西：会話、可愛いもの、名所探訪\n<b>--物語--</b>\n「わたしにはふたつの心があるの。ふふっ」\nユキヒは縁や人間関係を象徴するメガミですが、不思議な秘密を持っています。彼女はふたつの心を持っており、傘の開閉と簪の着脱でそれらが切り替わるのです。いわゆる多重人格と捉えても間違いではありません。\n傘が閉じた「表」の姿は面倒見が良く、占いを通して縁を視るミステリアスなお姉さんです。優しく友好的ですが、僅かに距離を置いて人々に接する節があります。\n傘が開いた「裏」の姿は渦巻く情念を纏っています。自らに縁が結ばれた者を求め続けていますが、少しばかり過激すぎるため、彼女と接するには危険が伴うでしょう。',
  // girlInfojp: '身長：156cm\n好きなもの：会話、可愛いもの、名所探訪\n<b>--物語--</b>\n「わたしにはふたつの心があるの。ふふっ」\nユキヒは縁や人間関係を象徴するメガミですが、不思議な秘密を持っています。彼女はふたつの心を持っており、傘の開閉と簪の着脱でそれらが切り替わるのです。いわゆる多重人格と捉えても間違いではありません。\n傘が閉じた「表」の姿は面倒見が良く、占いを通して縁を視るミステリアスなお姉さんです。優しく友好的ですが、僅かに距離を置いて人々に接する節があります。\n傘が開いた「裏」の姿は渦巻く情念を纏っています。自らに縁が結ばれた者を求め続けていますが、少しばかり過激すぎるため、彼女と接するには危険が伴うでしょう。',
  list: [{
    name: '伞/簪',
    namejp: '傘/簪',
    namekr: '우산/비녀',
    nameen: 'UMBRELLA/HAIRPIN',
    isSelect: false,
    pic: 'twiicon_sa_05',
    picq: 'sd_yukihi.png',
    normal: [{
      id: '06-yukihi-o-n-1',
      name: '藏针/含针',
      namejp: 'しこみばり / ふくみばり',
      namekr: '숨겨둔 바늘/움켜쥔 바늘',
      baseType: 'normal',
      types: ['attack'],
      range: '4-6',
      rangeOpened: '0-2',
      damage: '3/1',
      damageOpened: '1/2',
      text: '',
      textjp: ''
    },
    {
      id: '06-yukihi-o-n-2',
      name: '预演/猫骗',
      namejp: 'しこみび / ねこだまし',
      namekr: '불꽃장치/손바닥치기',
      baseType: 'normal',
      types: ['attack'],
      range: '5-6',
      rangeOpened: '0-2',
      damage: '1/1',
      damageOpened: '1/1',
      text: '闭伞：【攻击后】将此牌置入你的手牌，进行一次伞的开合操作。 \n开伞：（无）',
      textjp: '閉；【攻撃後】このカードを手札に戻し、傘の開閉を行う。\n開；无',
      textkr: '【공격후】이 카드를 손패로 되돌리고, 우산의 개폐를 행한다.'
    },
    {
      id: '06-yukihi-o-n-3',
      name: '拒/引',
      namejp: 'ふりはらい / たぐりよせ',
      namekr: '휘둘러치기/끌어당기기',
      baseType: 'normal',
      types: ['attack'],
      range: '2-5',
      rangeOpened: '0-2',
      damage: '1/1',
      damageOpened: '1/1',
      text: '闭伞：【攻击后】距（1）⇔ 虚 \n开伞：【攻击后】距（2）→虚',
      textjp: '閉；【攻撃後】ダスト⇔間合：1\n開；【攻撃後】間合→ダスト：2',
      textkr: '【공격후】간격→더스트：2'
    },
    {
      id: '06-yukihi-o-n-4',
      name: '挥舞/突刺',
      namejp: 'ふりまわし / つきさし',
      namekr: '휘두르기/찔러넣기',
      baseType: 'normal',
      types: ['attack', 'fullpower'],
      range: '4-6',
      rangeOpened: '0-2',
      damage: '5/-',
      damageOpened: '-/2',
      text: '',
      textjp: ''
    },
    {
      id: '06-yukihi-o-n-5',
      name: '伞飞转',
      namejp: 'かさまわし',
      namekr: '우산 돌리기',
      baseType: 'normal',
      types: ['action'],
      text: '（使用此牌没有任何效果）\n【常时】每当你进行伞的开合操作时，你可以从手牌中展示此牌。若如此做，则虚（1）→自装',
      textjp: '(このカードは使用しても効果はない) \n【常時】あなたが傘の開閉を行った時、このカードを手札から公開してもよい。そうした場合、 \nダスト→自オーラ：1',
      textkr: '(이 카드는 사용해도 효과가 없다) \n 【상시】당신이 우산의 개폐를 행했을 때, 이 카드를 손패에서 공개해도 좋다. 그럴 경우,\n 더스트→자신 오라：1'
    },
    {
      id: '06-yukihi-o-n-6',
      name: '闪回/潜进',
      namejp: 'ひきあし / もぐりこみ',
      namekr: '뒷걸음질/파고들기',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '闭伞：虚（1）→距 \n开伞：距（1）→虚',
      textjp: '閉；ダスト→間合：1\n開；間合→ダスト：1',
      textkr: '간격→더스트：1'
    },
    {
      id: '06-yukihi-o-n-7',
      name: '结缘',
      namejp: 'えんむすび',
      namekr: '인연 맺기',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '2',
      text: '【展开时】距（1）→虚 \n【破弃时】虚（1）→距 \n【常时】若伞面处于开伞状态，则此牌效果中所有的箭头反向。',
      textjp: '【展開時】間合→ダスト：1 \n【破棄時】ダスト→間合：1 \n【常時】あなたの傘が開いているならば、このカードの矢印(→)は逆になる。',
      textkr: '【전개시】간격→더스트：1 \n 【파기시】더스트→간격：1 \n 【상시】당신의 우산이 펴져있다면、이 카드의 화살표(→)는 반대가 된다.'
    }],
    special: [{
      id: '06-yukihi-o-s-1',
      name: '纷扬如雪',
      namejp: 'はらりゆき',
      namekr: '부드러운 눈꽃',
      baseType: 'special',
      types: ['attack'],
      range: '3-5',
      rangeOpened: '0-1',
      damage: '3/1',
      damageOpened: '0/0',
      cost: '2',
      text: '【即再起】进行伞的开合操作。',
      textjp: '【即再起】あなたが傘の開閉を行う。',
      textkr: '【즉재기】당신이 우산의 개폐를 행한다.'
    },
    {
      id: '06-yukihi-o-s-2',
      name: '明灭如灯',
      namejp: 'ゆらりび',
      namekr: '일렁이는 불꽃',
      baseType: 'special',
      types: ['attack'],
      range: '4-6',
      rangeOpened: '0',
      damage: '0/0',
      damageOpened: '4/5',
      cost: '5',
      text: '',
      textjp: ''
    },
    {
      id: '06-yukihi-o-s-3',
      name: '无常其心',
      namejp: 'どろりうら',
      namekr: '물컹이는 마음',
      baseType: 'special',
      types: ['enhance', 'fullpower'],
      capacity: '7',
      cost: '3',
      text: '【展开中】你的雪灯的《攻击》牌攻击距离改为开伞时与闭伞时攻击距离的叠加。',
      textjp: '【展開中】あなたのユキヒの《攻撃》は傘を開いた状態と傘を閉じた状態両方の適正距離を持つ。',
      textkr: '【전개중】당신의 유키히의《공격》은 우산을 연 상태와 우산을 닫은 상태 양방의 적정거리를 가진다.'
    },
    {
      id: '06-yukihi-o-s-4',
      name: '复返其身',
      namejp: 'くるりみ',
      namekr: '변모하는 얼굴',
      baseType: 'special',
      types: ['action', 'reaction'],
      cost: '1',
      text: '进行一次伞的开合操作。\n虚（1）→自装',
      textjp: '傘の開閉を行う。 \nダスト→自オーラ：1',
      textkr: '우산의 개폐를 행한다. \n 더스트→자신 오라：1'
    }]
  },
  {
    name: '社交',
    namejp: '社交',
    namekr: '사교',
    nameen: 'SOCIETY',
    isSelect: false,
    pic: 'null.png',
    picq: 'sd_yukihi_a1.png',
    changenormal: [{
      changeIndex: '2',
      id: '06-yukihi-a1-n-2',
      name: '声援/恫吓',
      namejp: 'ちからぞえ / おどしつけ',
      namekr: '조력/위협',
      baseType: 'normal',
      types: ['attack'],
      range: '3-5',
      rangeOpened: '1-2',
      damage: '2/1',
      damageOpened: '1/2',
      text: '闭伞：【常时】若你展开中的《付与》牌上樱花结晶的数目之和大于等于4，则此攻击获得+0/+1。\n开伞：【常时】若你展开中的《付与》牌上樱花结晶的数目之和大于等于4，则此攻击获得+1/+0。',
      textjp: '閉；【常時】あなたの付与札に合計4つ以上の桜花結晶があるならば、この《攻撃》は+0/+1となる。\n開；【常時】あなたの付与札に合計4つ以上の桜花結晶があるならば、この《攻撃》は+1/+0となる。',
      textkr: '【상시】당신의 부여패에 합계 4개 이상의 벚꽃 결정이 있다면, 이 《공격》은 +1/+0된다.'
    },
    {
      changeIndex: '4',
      id: '06-yukihi-a1-n-4',
      name: '纬丝/经纱',
      namejp: 'よこいと / たていと',
      namekr: '씨실/날실',
      baseType: 'normal',
      types: ['attack'],
      range: '2-8',
      rangeOpened: '0-4',
      damage: '1/1',
      damageOpened: '0/0',
      text: '闭伞：【攻击后】本回合内你的下一次其他女神的攻击获得距离扩大（近1、远1）。将此牌置于你的牌库底。\n开伞：【攻击后】若本回合内你没有使用过其他牌，则你可以从弃牌区中使用1张其他女神的不具《全力》副类别的牌。',
      textjp: '閉；【攻撃後】このターンにあなたが次に行う他のメガミによる《攻撃》は距離拡大（遠1）と距離拡大（近1）を得る。このカードを山札の底に置く。\n開；【攻撃後】このターン中にあなたが他のカードを使用していないならば、あなたの捨て札にある他のメガミの《全力》でないカード1枚を使用する。',
      textkr: '【공격후】이 턴 동안 당신이 다른 카드를 사용하지 않았다면, 당신의 버림패에 있는 다른 여신의 《전력》이 아닌 카드를 1장 사용한다.'
    }],
    changespecial: [{
      changeIndex: '2',
      id: '06-yukihi-a1-s-2',
      name: '翩然如织',
      namejp: 'ひらりおり',
      namekr: '살랑이는 옷깃',
      baseType: 'special',
      types: ['enhance'],
      capacity: '1',
      cost: '4',
      text: '闭伞：【展开中】你的回合内，每当你第一次使用的其他女神的通常牌时，该牌结算完毕后你可以获得1点集中力，并将虚中的3个樱花结晶移至此牌上。\n开伞：【展开中】你的准备阶段开始时，进行一次“攻击距离0-5 伤害2/2”的攻击。',
      textjp: '閉；【展開中】あなたが他のメガミの通常札をあなたの各ターンに初めて使用した時、その解決後にあなたは集中力を1得て、ダストからこのカードの上に桜花結晶を3つ置いてもよい。\n開；【展開中】あなたの開始フェイズの開始時に攻撃『適正距離0-5、2/2』を行う。',
      textkr: '【전개중】당신이 다른 여신의 통상패를 당신의 각 턴에 처음 사용할 때, 그것을 해결하고 당신은 집중력을 1얻고 더스트에서 이 카드 위에 벚꽃 결정을 3개 올려도 좋다.'
    }]
  }]
},
{
  name: 'SHINRA 森罗',
  namejp: 'シンラ',
  namekr: '신라',
  nameen: 'SHINRA',
  desc: '计略～你可以秘密地准备两种计略之一。当你实行当前计略时，根据你准备的计略执行对应的效果，再秘密地准备下一个计略。（最初的计略必须是「神算」）',
  descjp: '計略～2種類の計略どちらかを秘密裏に準備しておく。計略の実行時には準備されていた効果を解決し、次の計略を再び秘密裏に準備する。（最初の計略は必ず「神算」である）',
  // girlInfo: '身高：167cm\n喜欢的东西：論破、謀、スイーツ\n<b>--物語--</b>\n「謀は三手先を読むもの。その程度はできますよね？」\nシンラは社会学と弁論を象徴する知恵者であり、いくつかの秘密結社を通してこの世界を裏から操る謀略者でもあります。メガミとしては珍しいことに組織を愛し、大きな野望のためにそれを活用するのです。彼女は自らの価値観ゆえに今の桜降る代には不満を持っているようで、世界を変えるための謀を水面下で進めているようです。\n性格は極めて悪質であり、弁舌にて相手をやり込める事を何よりも好みます。特に、ある程度に頭が回る者を論破するのは彼女にとって最高の愉悦のようです。腹黒さにおいて、彼女の右に出るものはいないでしょう。',
  // girlInfojp: '身長：167cm\n好きなもの：論破、謀、スイーツ\n<b>--物語--</b>\n「謀は三手先を読むもの。その程度はできますよね？」\nシンラは社会学と弁論を象徴する知恵者であり、いくつかの秘密結社を通してこの世界を裏から操る謀略者でもあります。メガミとしては珍しいことに組織を愛し、大きな野望のためにそれを活用するのです。彼女は自らの価値観ゆえに今の桜降る代には不満を持っているようで、世界を変えるための謀を水面下で進めているようです。\n性格は極めて悪質であり、弁舌にて相手をやり込める事を何よりも好みます。特に、ある程度に頭が回る者を論破するのは彼女にとって最高の愉悦のようです。腹黒さにおいて、彼女の右に出るものはいないでしょう。',
  list: [{
    name: '书',
    namejp: '書',
    namekr: '책',
    nameen: 'SCROLL',
    isSelect: false,
    pic: 'twiicon_sa_06.jpg',
    picq: 'sd_shinra.png',
    normal: [{
      id: '07-shinra-o-n-1',
      name: '立论',
      namejp: '立論',
      namekr: '입론',
      baseType: 'normal',
      types: ['attack'],
      range: '2-7',
      damage: '2/-',
      text: '【常时】若对手牌库的牌张数大于等于2，则此《攻击》不造成伤害，而改为盖伏对手牌库顶的2张牌。',
      textjp: '【常時】相手の山札に2枚以上のカードがあるならば、この《攻撃》はダメージを与える代わりに山札の上から2枚を伏せ札にする。',
      textkr: '【상시】상대의 패산에 2장 이상 카드가 있다면, 이 《공격》은 대미지를 주는 대신 패산의 위에서 2장을 덮임패로 한다.'
    },
    {
      id: '07-shinra-o-n-2',
      name: '反论',
      namejp: '反論',
      namekr: '반론',
      baseType: 'normal',
      types: ['attack', 'reaction'],
      range: '2-7',
      damage: '1/-',
      text: '【攻击后】若被对应的《攻击》非王牌且对装伤害大于等于3，则打消该《攻击》的伤害。（不影响效果伤害）\n【攻击后】对手抓1张牌。',
      textjp: '【攻撃後】対応した切札でなく、オーラへのダメージが3以上である《攻撃》のダメージを打ち消す。 \n【攻撃後】相手はカードを1枚引く。',
      textkr: '【공격후】대응한 카드가 비장패가 아니면서, 오라로의 대미지가 3 이상인 《공격》의 대미지를 무효화한다.\n 【공격후】상대는 카드를 1장 뽑는다.'
    },
    {
      id: '07-shinra-o-n-3',
      name: '诡辩',
      namejp: '詭弁',
      namekr: '궤변',
      baseType: 'normal',
      types: ['attack', 'fullpower'],
      range: '3-8',
      damage: '-/1',
      text: '【攻击后】实行当前计略，准备下个计略。 \n神算：盖伏对手牌库顶的3张牌。 \n鬼谋：你可以从对手的弃牌中选择1张牌并使用。',
      textjp: '【攻撃後】計略を実行し、次の計略を準備する。 \n[神算] 相手の山札の上から3枚を伏せ札にする。 \n[鬼謀] 相手の捨て札にあるカードを1枚選び、それを使用してもよい。',
      textkururu: [{
        ctn: '【攻击后】实行当前计略，准备下个计略。'
      }, {
        if: '<i class="i-bean i-bean--plan-blue"></i>',
        ctn: '神算：盖伏对手牌库顶的3张牌。'
      }, {
        if: '<i class="i-bean i-bean--plan-red"></i>',
        ctn: '鬼谋：你可以从对手的弃牌中选择1张牌并使用。'
      }],
      textkururujp: [{
        ctn: '【攻撃後】計略を実行し、次の計略を準備する。'
      }, {
        if: '<i class="i-bean i-bean--plan-blue"></i>',
        ctn: '[神算] 相手の山札の上から3枚を伏せ札にする。'
      }, {
        if: '<i class="i-bean i-bean--plan-red"></i>',
        ctn: '[鬼謀] 相手の捨て札にあるカードを1枚選び、それを使用してもよい。'
      }]
    },
    {
      id: '07-shinra-o-n-4',
      name: '引用',
      namejp: '引用',
      namekr: '인용',
      baseType: 'normal',
      types: ['action'],
      text: '检视对手的手牌，你可以从中选择1张《攻击》牌。若如此做，则选择一项：\n1.使用所选择的牌；\n2.盖伏所选择的牌。\n若所选择的牌具有《全力》副类别，则结束当前阶段。',
      textjp: '相手の手札を見て、《攻撃》カードを1枚選んでもよい。そうした場合、そのカードを使用するか伏せ札にする。その後、そのカードが《全力》を持つならば現在のフェイズを終了する。',
      textkr: '상대의 손패를 보고, 《공격》카드를 1장 골라도 좋다. 그럴 경우, 그 카드를 사용하거나 덮임패로 한다. 그 후, 그 카드가 《전력》을 갖는다면 현재 페이즈를 종료한다.'
    },
    {
      id: '07-shinra-o-n-5',
      name: '煽动',
      namejp: '煽動',
      namekr: '선동',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '实行当前计略，准备下个计略。\n神算：虚（1）→距\n鬼谋：距（1）→敌装',
      textjp: '計略を実行し、次の計略を準備する。 \n[神算] ダスト→間合：1 \n[鬼謀] 間合→相オーラ：1',
      textkururu: [{
        ctn: '实行当前计略，准备下个计略。'
      }, {
        if: '<i class="i-bean i-bean--plan-blue"></i>',
        ctn: '神算：虚（1）→距'
      }, {
        if: '<i class="i-bean i-bean--plan-red"></i>',
        ctn: '鬼谋：距（1）→敌装'
      }],
      textkururujp: [{
        ctn: '計略を実行し、次の計略を準備する。'
      }, {
        if: '<i class="i-bean i-bean--plan-blue"></i>',
        ctn: '[神算] ダスト→間合：1'
      }, {
        if: '<i class="i-bean i-bean--plan-red"></i>',
        ctn: '[鬼謀] 間合→相オーラ：1'
      }]
    },
    {
      id: '07-shinra-o-n-6',
      name: '壮语',
      namejp: '壮語',
      namekr: '장담',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '2',
      text: '【破弃时】实行当前计略，准备下个计略。\n神算：你获得1点集中力，将此牌置于你的牌库顶。\n鬼谋：若对手的手牌张数小于等于1，则对手畏缩，对手抓3张牌，然后从手牌中弃置2张牌。',
      textjp: '【破棄時】計略を実行し、次の計略を準備する。 \n[神算] あなたは集中力を1得て、このカードを山札の一番上に置く。 \n[鬼謀] 相手の手札が1枚以下ならば、相手を畏縮させ、相手はカードを3枚引き、相手は手札を2枚捨て札にする。',
      textkururu: [{
        ctn: '【破弃时】实行当前计略，准备下个计略。'
      }, {
        if: '<i class="i-bean i-bean--plan-blue"></i>',
        ctn: '神算：你获得1点集中力，将此牌置于你的牌库顶。'
      }, {
        if: '<i class="i-bean i-bean--plan-red"></i>',
        ctn: '鬼谋：若对手的手牌张数小于等于1，则对手畏缩，对手抓3张牌，然后从手牌中弃置2张牌。'
      }],
      textkururujp: [{
        ctn: '【破棄時】計略を実行し、次の計略を準備する。'
      }, {
        if: '<i class="i-bean i-bean--plan-blue"></i>',
        ctn: '[神算] あなたは集中力を1得て、このカードを山札の一番上に置く。'
      }, {
        if: '<i class="i-bean i-bean--plan-red"></i>',
        ctn: '[鬼謀] 相手の手札が1枚以下ならば、相手を畏縮させ、相手はカードを3枚引き、相手は手札を2枚捨て札にする。'
      }]
    },
    {
      id: '07-shinra-o-n-7',
      name: '论破',
      namejp: '論破',
      namekr: '논파',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '4',
      text: '【展开时】从对手的弃牌中选择1张牌，封印于此牌下。  \n【破弃时】将此牌所封印的所有牌置入对手的弃牌区。',
      textjp: '【展開時】相手の捨て札にあるカード1枚を選び、このカードの下に封印する。 \n【破棄時】このカードに封印されたカードを相手の捨て札に戻す。',
      textkr: '【전개시】상대의 버림패에 있는 카드를 1장 골라, 이 카드 밑에 봉인한다.\n 【파기시】이 카드에 봉인 된 카드를 상대의 버림패로 되돌린다.'
    }],
    special: [{
      id: '07-shinra-o-s-1',
      name: '完全论破',
      namejp: '完全論破',
      namekr: '완전논파',
      baseType: 'special',
      types: ['action'],
      cost: '2',
      text: '从对手的弃牌中选择1张牌，封印于此牌下（本局游戏不再归还）。',
      textjp: '相手の捨て札にあるカード1枚を選び、このカードの下に封印する。 \n(ゲーム中に戻ることはない)',
      textkr: '상대의 버림패에 있는 카드 1장을 골라, 이 카드 밑에 봉인한다.\n (게임 중에 되돌아오는 일은 없다.)'
    },
    {
      id: '07-shinra-o-s-2',
      name: '诸式理解',
      namejp: '皆式理解',
      namekr: '개식이해',
      baseType: 'special',
      types: ['action'],
      cost: '2',
      text: '实行当前计略，准备下个计略。\n神算：从你的弃牌与处于使用后状态的王牌中选择1张《付与》牌使用，而不需支付其费用。若所选择的牌具有《全力》副类别，则结束当前阶段。\n鬼谋：从对手的非王牌的展开中的《付与》牌中选择1张，将其上所有樱花结晶移至虚。',
      textjp: '計略を実行し、次の計略を準備する。 \n[神算] あなたの捨て札または使用済の切札から、消費を支払わずに《付与》カード1枚を使用する。そのカードが《全力》ならば現在のフェイズを終了する。 \n[鬼謀] 切札でない相手の付与札を1枚選ぶ。その上の桜花結晶全てをダストに送る。',
      textkururu: [{
        ctn: '实行当前计略，准备下个计略。'
      }, {
        if: '<i class="i-bean i-bean--plan-blue"></i>',
        ctn: '神算：从你的弃牌与处于使用后状态的王牌中选择1张《付与》牌使用，而不需支付其费用。若所选择的牌具有《全力》副类别，则结束当前阶段。'
      }, {
        if: '<i class="i-bean i-bean--plan-red"></i>',
        ctn: '鬼谋：从对手的非王牌的展开中的《付与》牌中选择1张，将其上所有樱花结晶移至虚。'
      }],
      textkururujp: [{
        ctn: '計略を実行し、次の計略を準備する。'
      }, {
        if: '<i class="i-bean i-bean--plan-blue"></i>',
        ctn: '[神算] あなたの捨て札または使用済の切札から、消費を支払わずに《付与》カード1枚を使用する。そのカードが《全力》ならば現在のフェイズを終了する。'
      }, {
        if: '<i class="i-bean i-bean--plan-red"></i>',
        ctn: '[鬼謀] 切札でない相手の付与札を1枚選ぶ。その上の桜花結晶全てをダストに送る。'
      }]
    },
    {
      id: '07-shinra-o-s-3',
      name: '天地反驳',
      namejp: '天地反駁',
      namekr: '천지반박',
      baseType: 'special',
      types: ['enhance', 'fullpower'],
      capacity: '5',
      cost: '2',
      text: '【展开中】交换你的《攻击》对装和命的伤害（交换优先于修正结算）。',
      textjp: '【展開中】あなたの《攻撃》のオーラへのダメージとライフへのダメージを入れ替える。 \n（ダメージの入れ替えは、ダメージの増減より先に適用される）',
      textkr: '【전개중】당신의 《공격》의 오라로의 대미지와 라이프로의 대미지를 바꾼다.\n （대미지의 증감보다 먼저 적용된다.）'
    },
    {
      id: '07-shinra-o-s-4',
      name: '森罗判证',
      namejp: '森羅判証',
      namekr: '신라만상',
      baseType: 'special',
      types: ['enhance'],
      capacity: '6',
      cost: '6',
      text: '【展开时】虚（2）→自命\n【展开中】每当你的其他《付与》牌破弃时，对敌命造成1点伤害。\n【破弃时】你输掉本局游戏。',
      textjp: '【展開時】ダスト→自ライフ：2 \n【展開中】あなたの他の付与札が破棄された時、相手のライフに1ダメージを与える。 \n【破棄時】あなたは敗北する。',
      textkr: '【전개시】더스트→자신 라이프：2 \n 【전개중】당신의 다른 부여패가 파기되었을 때, 상대의 라이프에 1 대미지를 준다.\n 【파기시】당신은 패배한다.'
    }]
  },
  {
    name: '经',
    namejp: '経',
    namekr: '경전',
    nameen: 'CLASSICS',
    isSelect: false,
    pic: 'twiicon_sa_24.jpg',
    picq: 'sd_shinra_a1.png',
    changenormal: [{
      changeIndex: '2',
      id: '07-shinra-a1-n-2',
      name: '真言',
      namejp: '真言',
      namekr: '진언',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '若此牌作为对应使用，则实行当前计略，准备下个计略。\n神算：若对手牌库的牌张数大于等于3，则对敌命造成1点伤害。\n鬼谋：若对手牌库的牌张数小于等于3，则对敌装造成2点伤害。',
      textjp: 'このカードを対応で使用したならば、計略を実行し、次の計略を準備する。 \n[神算] 相手の山札が3枚以上ならば、相手のライフに1ダメージを与える。 \n[鬼謀] 相手の山札が3枚以下ならば、相手のオーラに2ダメージを与える。',
      textkururu: [{
        ctn: '若此牌作为对应使用，则实行当前计略，准备下个计略。'
      }, {
        if: '<i class="i-bean i-bean--plan-blue"></i>',
        ctn: '神算：若对手牌库的牌张数大于等于3，则对敌命造成1点伤害。'
      }, {
        if: '<i class="i-bean i-bean--plan-red"></i>',
        ctn: '鬼谋：若对手牌库的牌张数小于等于3，则对敌装造成2点伤害。'
      }],
      textkururujp: [{
        ctn: 'このカードを対応で使用したならば、計略を実行し、次の計略を準備する。'
      }, {
        if: '<i class="i-bean i-bean--plan-blue"></i>',
        ctn: '[神算] 相手の山札が3枚以上ならば、相手のライフに1ダメージを与える。'
      }, {
        if: '<i class="i-bean i-bean--plan-red"></i>',
        ctn: '[鬼謀] 相手の山札が3枚以下ならば、相手のオーラに2ダメージを与える。'
      }]
    },
    {
      changeIndex: '7',
      id: '07-shinra-a1-n-7',
      name: '使徒',
      namejp: '使徒',
      namekr: '사도',
      baseType: 'normal',
      types: ['enhance', 'fullpower'],
      capacity: '2',
      text: '【展开时/破弃时】实行当前计略，准备下个计略。\n神算：进行一次“攻击距离1,3,5 伤害2/2 不可被闪避”的攻击。\n鬼谋：进行一次“攻击距离0,2,4 伤害2/2 不可被闪避”的攻击。',
      textjp: '【展開時/破棄時】計略を実行し、次の計略を準備する。\n[神算] 攻撃『適正距離1,3,5、2/2、不可避』を行う。\n[鬼謀] 攻撃『適正距離0,2,4、2/2、不可避』を行う。',
      textkururu: [{
        ctn: '【展开时/破弃时】实行当前计略，准备下个计略。'
      }, {
        if: '<i class="i-bean i-bean--plan-blue"></i>',
        ctn: '神算：进行一次“攻击距离1,3,5 伤害2/2 不可被闪避”的攻击。'
      }, {
        if: '<i class="i-bean i-bean--plan-red"></i>',
        ctn: '鬼谋：进行一次“攻击距离0,2,4 伤害2/2 不可被闪避”的攻击。'
      }],
      textkururujp: [{
        ctn: '【展開時/破棄時】計略を実行し、次の計略を準備する。'
      }, {
        if: '<i class="i-bean i-bean--plan-blue"></i>',
        ctn: '[神算] 攻撃『適正距離1,3,5、2/2、不可避』を行う。'
      }, {
        if: '<i class="i-bean i-bean--plan-red"></i>',
        ctn: '[鬼謀] 攻撃『適正距離0,2,4、2/2、不可避』を行う。'
      }]
    }],
    changespecial: [{
      changeIndex: '3',
      id: '07-shinra-a1-s-3',
      name: '全知圣典',
      namejp: '全知経典',
      namekr: '전지경전',
      baseType: 'special',
      types: ['attack', 'fullpower'],
      range: '0-5',
      damage: '2/2',
      cost: '4',
      text: '不可被对应\n【攻击后】将任意张手牌和盖牌置入弃牌区。然后从弃牌中选择任意数量的计略，以任意顺序实行。所选择的计略全部结算完毕后，准备下个计略。\n（如果此前准备的计略是神算那么实行的计略全部都是神算）',
      textjp: '対応不可\n【攻撃後】あなたは手札と伏せ札を好きな枚数だけ捨て札にする。その後、捨て札にあるカードから任意の数の計略を、任意の順で実行する。それら全てを解决し終えたら、次の計略を準備する。（神算を選んでいたら全て神算で実行する）',
      textkr: '대응불가\n\n【공격후】당신은 손패나 덮임패에서 원하는 만큼 버림패에 옮길 수 있다. 그 후에 버림패에서 임의의 수의 계략을 원하는 순서대로 실행하고, 다음 계략을 준비한다.\n(신산을 준비했다면 모든 계략은 신산으로 처리된다)'
    }]
  }]
},
{
  name: 'HAGANE 破钟',
  namejp: 'ハガネ',
  namekr: '하가네',
  nameen: 'HAGANE',
  desc: '远心～仅当同时满足以下2个条件时，可以使用具远心关键字的牌：<br>1.当前距离比回合开始时的距离远2及以上；<br>2.本回合内你没有进行过《攻击》。',
  descjp: '遠心～以下の2つを共に満たしている場合のみ、遠心を持つカードは使用できる。<br>1.現在の間合がターン開始時の間合から2以上離れている。<br>2.このターン中にあなたが《攻撃》を行ってない。',
  // girlInfo: '身高：142cm\n喜欢的东西：体を動かすこと、登山、鍛冶\n<b>--物語--</b>\n「それじゃすごいの、いっくよー！」\nハガネは大地を象徴するメガミです。その領分には金属も含まれており、鉄槌を通して金属に権能を込め、鍛え上げることも可能です。彼女は名工であり、メガミの象徴武器の中には彼女の手で作られたものもいくつかあります。\n天真爛漫とした子供らしい気質を持ち、自由で活発、多くの物事に興味を示します。さらに極度の右脳派で、勘の鋭さも相当のもの。それゆえに興味に向けていつでも全力で突き進みます。そんな彼女を心配して、何柱かのメガミは保護者のような振る舞いを見せているようです。',
  // girlInfojp: '身長：142cm\n好きなもの：体を動かすこと、登山、鍛冶\n<b>--物語--</b>\n「それじゃすごいの、いっくよー！」\nハガネは大地を象徴するメガミです。その領分には金属も含まれており、鉄槌を通して金属に権能を込め、鍛え上げることも可能です。彼女は名工であり、メガミの象徴武器の中には彼女の手で作られたものもいくつかあります。\n天真爛漫とした子供らしい気質を持ち、自由で活発、多くの物事に興味を示します。さらに極度の右脳派で、勘の鋭さも相当のもの。それゆえに興味に向けていつでも全力で突き進みます。そんな彼女を心配して、何柱かのメガミは保護者のような振る舞いを見せているようです。',
  list: [{
    name: '锤',
    namejp: '鎚',
    namekr: '철퇴',
    nameen: 'HAMMER',
    isSelect: false,
    pic: 'twiicon_sa_08.jpg',
    picq: 'sd_hagane.png',
    normal: [{
      id: '08-hagane-o-n-1',
      name: '远心击',
      namejp: '遠心撃',
      namekr: '원심격',
      baseType: 'normal',
      types: ['attack'],
      range: '2-6',
      damage: '5/3',
      text: '远心 \n【攻击后】若现在是你的回合，则盖伏你和对手的所有手牌，你的集中力变为0，结束当前阶段。',
      textjp: '遠心 \n【攻撃後】現在のターンがあなたのターンならば、あなたと相手の手札を全て伏せ札にし、あなたの集中力は0になり、現在のフェイズを終了する。',
      textkr: '원심 \n 【공격후】현재 턴이 당신의 턴이라면, 당신과 상대의 손패를 모두 덮임패로 하고, 당신의 집중력은 0이 되고, 현재 페이즈를 종료한다.'
    },
    {
      id: '08-hagane-o-n-2',
      name: '砂风尘',
      namejp: '砂風塵',
      namekr: '사풍진',
      baseType: 'normal',
      types: ['attack'],
      range: '0-6',
      damage: '1/-',
      text: '【攻击后】若当前距离与本回合开始时距离之差的绝对值大于等于2，则对手从手牌中随机弃1张牌。',
      textjp: '【攻撃後】現在の間合がターン開始時の間合から2以上変化しているならば、相手の手札を1枚無作為に選び、それを捨て札にする。',
      textkr: '【공격후】현재 간격이 턴 개시시의 간격에서 2 이상 변화했다면, 상대의 손패를 1장 무작위로 골라, 그것을 버림패로 한다.'
    },
    {
      id: '08-hagane-o-n-3',
      name: '大地碎击',
      namejp: '大地砕き',
      namekr: '대지 부수기',
      baseType: 'normal',
      types: ['attack', 'fullpower'],
      range: '0-3',
      damage: '2/-',
      text: '不可被对应 \n【攻击后】对手集中力变为0，对手畏缩。',
      textjp: '対応不可 \n【攻撃後】相手の集中力は0になり、相手を畏縮させる。',
      textkr: '대응불가 \n 【공격후】상대의 집중력은 0이 되고, 상대를 위축시킨다。'
    },
    {
      id: '08-hagane-o-n-4',
      name: '超反动',
      namejp: '超反動',
      baseType: 'normal',
      types: ['action'],
      text: '根据当前距离结算以下效果：\n大于等于5……距（1）→自气\n小于等于4……敌气（1）→距',
      textjp: '現在の間合が5以上ならば、間合→自フレア：1\n現在の間合が4以下ならば、相フレア→間合：1'
    },
    {
      id: '08-hagane-o-n-5',
      name: '圆舞链',
      namejp: '円舞錬',
      namekr: '원무련',
      baseType: 'normal',
      types: ['action'],
      text: '远心 \n若敌气中的樱花结晶的数目大于等于3，则敌气（2）→自装',
      textjp: '遠心 \n相手のフレアが3以上ならば、相フレア→自オーラ：2',
      textkr: '원심 \n상대의 플레어가 3 이상이라면、상대 플레어→자신 오라：2'
    },
    {
      id: '08-hagane-o-n-6',
      name: '大鸣钟',
      namejp: '鐘鳴らし',
      namekr: '종 울리기',
      baseType: 'normal',
      types: ['action'],
      text: '远心 \n选择1项：\n1.本回合内，你的下一次《攻击》获得不可被对应；\n2.本回合内，若你的下一次《攻击》对装伤害大于等于3，则该《攻击》获得+0/+1，否则获得+2/+0。',
      textjp: '遠心 \n以下から１つを選ぶ。\n・このターンにあなたが次に行う《攻撃》は対応不可を得る。\n・このターンにあなたが次に行う《攻撃》はオーラへのダメージが3以上ならば+0/+1、そうでないならば+2/+0となる。',
      textkr: '원심 \n 이하에서 하나를 고른다.\n ・이 턴에 당신이 다음에 행하는 《공격》은 대응불가를 얻는다.\n ・이 턴에 당신이 다음에 행하는 《공격》은 오라로의 대미지가 3 이상이라면 +0/+1, 그렇지 않다면 +2/+0이 된다.'
    },
    {
      id: '08-hagane-o-n-7',
      name: '引力场',
      namejp: '引力場',
      namekr: '인력장',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '2',
      text: '全力化：【常时】因此牌上的箭头效果移动的樱花结晶的数目增大1。\n【展开时】距（1）→自装\n【展开中】达人距离减小1。',
      textjp: '全力化:【常時】このカードの持つ矢印で動く桜花結晶は1つ多くなる。\n【展開時】間合→自オーラ：1\n【展開中】達人の間合は1小さくなる。'
    }],
    special: [{
      id: '08-hagane-o-s-1',
      name: '大天空·破限',
      namejp: '大天空クラッシュ',
      namekr: '대천공 크래시',
      baseType: 'special',
      types: ['attack'],
      range: '0-10',
      damage: 'X/Y',
      cost: '4',
      text: '超克 \n【常时】X为当前距离与本回合开始时距离之差的绝对值，Y为X的一半（向上取整）。',
      textjp: '超克 \n【常時】Xは現在の間合がターン開始時の間合からどれだけ変化しているかに等しい。YはXの半分(切り上げ)に等しい。',
      textkr: '초극 \n 【상시】X는 현재 간격이 턴 시작시의 간격에서 변화한 값과 같다. Y는 X의 절반(올림)과 같다.'
    },
    {
      id: '08-hagane-o-s-2',
      name: '大破钟·断限',
      namejp: '大破鐘メガロベル',
      namekr: '대파종 메갈로벨',
      baseType: 'special',
      types: ['action'],
      cost: '2',
      text: '若你的其他王牌均处于使用后状态，则虚（2）→自命',
      textjp: 'あなたの他の切札が全て使用済ならば、ダスト→自ライフ：2',
      textkr: '당신의 다른 비장패가 모두 사용완료라면, 더스트→자신 라이프：2'
    },
    {
      id: '08-hagane-o-s-3',
      name: '大重力·无限',
      namejp: '大重力アトラクト',
      namekr: '대중력 어트랙트',
      baseType: 'special',
      types: ['action'],
      cost: '5',
      text: '距（3）→自气\n----\n【再起】本回合内你使用了具远心关键字的牌，且没有使用此牌。',
      textjp: '間合→自フレア：3 \n----\n【再起】このターンにあなたが遠心を持つカードを使用しており、このカードを使用していない。',
      textkr: '간격→자신 플레어：3 \n ----\n 【재기】이 턴에 당신이 원심을 갖는 카드를 사용하고, 이 카드를 사용하지 않았다.'
    },
    {
      id: '08-hagane-o-s-4',
      name: '大山脉·转限',
      namejp: '大山脈リスペクト',
      namekr: '대산맥 리스펙트',
      baseType: 'special',
      types: ['action'],
      cost: '4',
      text: '远心 \n从你的弃牌中选择至多2张不具《全力》副类别的牌，以任意顺序使用它们。',
      textjp: '遠心 \nあなたの捨て札にある異なる《全力》でないカードを2枚まで選び、任意の順番で使用する。',
      textkr: '원심 \n 당신의 버림패에 있는 다른 《전력》이 아닌 카드를 2장까지 골라, 임의의 순서로 사용한다.'
    }]
  },
  {
    name: '铁砧',
    namejp: '金床',
    isSelect: false,
    pic: 'twiicon_sa_36.jpg',
    picq: 'sd_hagane_a1.png',
    changenormal: [{
      changeIndex: '1',
      id: '08-hagane-a1-n-1',
      name: '炉火',
      namejp: '爐火',
      baseType: 'normal',
      types: ['action'],
      text: '若当前距离大于等于3，则\n距（1）→自气\n距（1）→敌气',
      textjp: '現在の間合が3以上ならば、\n間合→自フレア：1\n間合→相フレア：1\n'
    }, {
      changeIndex: '2',
      id: '08-hagane-a1-n-2',
      name: '旋回起',
      namejp: '旋回起',
      baseType: 'normal',
      types: ['action'],
      text: '若当前距离与本回合开始时距离之差的绝对值大于等于2，则你抓1张牌并获得1点集中力。',
      textjp: '現在の間合がターン開始時の間合から2以上変化しているならば、カードを1枚引き、あなたは集中力を1得る。'
    }],
    changespecial: [{
      changeIndex: '1',
      id: '08-hagane-a1-s-1',
      name: '大炼成·原限',
      namejp: '大錬成マテリアル',
      baseType: 'special',
      types: ['action'],
      cost: '1',
      text: '终端\n若此牌为你的牌，则结算以下效果。\n若铁砧中有牌，则将1个樱花结晶从虚移至铁砧上。若铁砧中没有牌，则你可以从手牌中选择1张其他女神的《攻击》牌置于铁砧中。\n将1张『炼成攻击』从追加区移至你的牌库底。\n----\n【再起】本回合内你使用了『炼成攻击』。',
      textjp: '終端\nこのカードがあなたのカードならば、以下の効果を解決する。\n金床にカードがあるならばダストから金床に桜花結晶を1つ置く。金床にカードがないならば、手札から他のメガミの《攻撃》カ一ドを1枚選び金床に置いてもよい。\nあなたの追加札から「錬成攻撃」を山札の底に1枚置く。\n----\n【再起】このターンにあなたが「錬成攻撃」を使用している。'
    }],
    changeExtra: [{
      id: '08-hagane-a1-s-1-ex1',
      name: '炼成攻击',
      namejp: '錬成攻撃',
      baseType: 'normal',
      extraFrom: '08-hagane-a1-s-1',
      types: ['variable'],
      text: '【常时】此牌为铁砧上的牌之复制，但其名称、使用者与此效果保持不变。若此牌在手牌中，则此牌不可被对手的效果选择为目标。若此牌不在手牌与盖牌区中，则无法因重铸牌库以外的效果移动至牌库或手牌。此牌不可被封印。根据铁砧上的樱花结晶的数目，此牌获得以下效果。\n大于等于0……+1/+0和距离扩大（远1）\n大于等于1……+1/+1和距离扩大（远1）\n大于等于2……+1/+1、距离扩大（远1）和不可被打消。',
      textjp: '【常時】このカードは名前、使用者とこの効果を除き金床にあるカードの複製になる。このカードが手札にあるなら相手の効果で選べず、手札か伏せ札にないなら再構成以外で山札に戻らない。このカードは封印されない。金床にある桜花結晶の個数に応じて以下の効果を得る。\n0以上……+1/+0となり、距離拡大（遠1）を得る。\n1以上……+1/+1となり、距離拡大（遠1）を得る。\n2以上……+1/+1となり、距離拡大（遠1）を得る、打ち消されない。'
    }]
  }]
},
{
  name: 'CHIKAGE 千影',
  namejp: 'チカゲ',
  namekr: '치카게',
  nameen: 'CHIKAGE',
  desc: '毒袋～毒袋中有5张牌（「麻痹毒」、「迟缓毒」、「幻觉毒」和2张「灭灯毒」）。',
  descjp: '毒袋～毒袋に5枚のカード（「麻痺毒」「幻覚毒」「遅緩毒」「滅灯毒」2枚）を持つ。',
  // girlInfo: '身高：153cm\n喜欢的东西：暗くて狭いところ、身の安全、お茶\n<b>--物語--</b>\n「千影は死にたくない。それだけ、ですよ……」\nユリナやサイネと同じく、チカゲももとは人間、闇昏千影でした。彼女も２０年前の一大事で誕生したメガミの一柱であり、現在の彼女は毒を中心とした薬効を権能とし、生存と致死を象徴しています。\n人としては忍の里の生まれで、かつては忍として生きていました。しかしある任務で死の危険に瀕し、死を極度に恐れるようになります。それゆえに死を象徴するメガミ・ホロビの力を求め、彼女と歪な絆を結ぶに至ります。その絆は２０年前にも大きな影響を与え、それゆえに彼女はメガミへと至り、その権能が形作られたのです。',
  // girlInfojp: '身長：153cm\n好きなもの：暗くて狭いところ、身の安全、お茶\n<b>--物語--</b>\n「千影は死にたくない。それだけ、ですよ……」\nユリナやサイネと同じく、チカゲももとは人間、闇昏千影でした。彼女も２０年前の一大事で誕生したメガミの一柱であり、現在の彼女は毒を中心とした薬効を権能とし、生存と致死を象徴しています。\n人としては忍の里の生まれで、かつては忍として生きていました。しかしある任務で死の危険に瀕し、死を極度に恐れるようになります。それゆえに死を象徴するメガミ・ホロビの力を求め、彼女と歪な絆を結ぶに至ります。その絆は２０年前にも大きな影響を与え、それゆえに彼女はメガミへと至り、その権能が形作られたのです。',
  list: [{
    name: '毒',
    namejp: '毒',
    namekr: '독',
    nameen: 'POISON',
    isSelect: false,
    pic: 'twiicon_sa_09.jpg',
    picq: 'sd_chikage.png',
    normal: [{
      id: '09-chikage-o-n-1',
      name: '飞苦无',
      namejp: '飛苦無',
      namekr: '쿠나이 던지기',
      baseType: 'normal',
      types: ['attack'],
      range: '4-5',
      damage: '2/2',
      text: '',
      textjp: ''
    },
    {
      id: '09-chikage-o-n-2',
      name: '毒针',
      namejp: '毒針',
      namekr: '독침',
      baseType: 'normal',
      types: ['attack'],
      range: '4',
      damage: '1/1',
      text: '【攻击后】从毒袋中选择『麻痹毒』『幻觉毒』『迟缓毒』中的1张，将其置于对手的牌库顶。',
      textjp: '【攻撃後】毒袋から「麻痺毒」「幻覚毒」「弛緩毒」のいずれか1枚を選び、そのカードを相手の山札の一番上に置く。',
      textkr: '【공격후】독주머니에서「마비독」「환각독」「이완독」중 한 장을 고르고, 그 카드를 상대의 패산 맨 위에 둔다.'
    },
    {
      id: '09-chikage-o-n-3',
      name: '遁术',
      namejp: '遁術',
      namekr: '둔갑술',
      baseType: 'normal',
      types: ['attack', 'reaction'],
      range: '1-3',
      damage: '1/-',
      text: '【攻击后】自装（1）→距，虚（1）→距\n【攻击后】本回合内对手不能执行基本动作《前进》。',
      textjp: '【攻撃後】自オーラ→間合：1、ダスト→間合：1\n【攻撃後】このターン中、相手は基本動作《前進》を行えない。',
      textkr: '【공격후】자신 오라→간격：1　더스트→간격：1 \n【공격후】이 턴 동안, 상대는 기본 동작 《전진》을 할 수 없다.'
    },
    {
      id: '09-chikage-o-n-4',
      name: '割喉',
      namejp: '首切り',
      namekr: '목 베기',
      baseType: 'normal',
      types: ['attack', 'fullpower'],
      range: '0-3',
      damage: '2/3',
      text: '【攻击后】若对手的手牌张数大于等于2，则对手从手牌中弃1张牌。',
      textjp: '【攻撃後】相手の手札が2枚以上あるならば、相手は手札を1枚捨て札にする。',
      textkr: '【공격후】상대의 손패가 2장 이상이라면, 상대는 손패를 1장 버림패로 한다.'
    },
    {
      id: '09-chikage-o-n-5',
      name: '毒雾',
      namejp: '毒霧',
      namekr: '독안개',
      baseType: 'normal',
      types: ['action'],
      text: '从毒袋中选择『麻痹毒』『幻觉毒』『迟缓毒』中的1张，将其置入对手的手牌。',
      textjp: '毒袋から「麻痺毒」「幻覚毒」「弛緩毒」のいずれか1枚を選び、そのカードを相手の手札に加える。',
      textkr: '독주머니에서「마비독」「환각독」「이완독」중 한 장을 골라, 그 카드를 상대의 손패에 추가한다.'
    },
    {
      id: '09-chikage-o-n-6',
      name: '蹑足',
      namejp: '抜き足',
      namekr: '까치발 걸음',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '4',
      text: '破绽\n【展开中】当前距离减小2（距离不会为负）。',
      textjp: '隙 \n【展開中】現在の間合は2減少する。 \n(間合は0未満にならない)',
      textkr: '빈틈 \n 【전개중】현재 간격은 2 감소한다.\n (간격은 0 미만이 되지 않는다.)'
    },
    {
      id: '09-chikage-o-n-7',
      name: '泥泞',
      namejp: '泥濘',
      namekr: '진흙탕',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '2',
      text: '【展开中】对手不能执行基本动作《后退》和《离脱》。',
      textjp: '【展開中】相手は基本動作《後退》と《離脱》を行えない。',
      textkr: '【전개중】상대는 기본 동작 《후퇴》와 《이탈》을 행할 수 없다.'
    }],
    special: [{
      id: '09-chikage-o-s-1',
      name: '魂毒渐灭灯',
      namejp: '滅灯の魂毒',
      namekr: '멸등의 영혼독',
      baseType: 'special',
      types: ['action'],
      cost: '3',
      text: '从毒袋中选择1张『灭灯毒』，将其置于对手的牌库顶。',
      textjp: '毒袋から「滅灯毒」を1枚を選び、そのカードを相手の山札の一番上に置く。',
      textkr: '독주머니에서「멸등독」을 한 장 골라, 그 카드를 상대 패산 가장 위에 둔다.'
    },
    {
      id: '09-chikage-o-s-2',
      name: '缠毒揭叛旗',
      namejp: '叛旗の纏毒',
      namekr: '반기의 얽힘독',
      baseType: 'special',
      types: ['enhance', 'reaction'],
      capacity: '5',
      cost: '2',
      text: '【展开中】打消对手进行的伤害中含有“-”的所有《攻击》。',
      textjp: '【展開中】相手によるオーラへのダメージかライフへのダメージのどちらかが「-」である《攻撃》は打ち消される。',
      textkr: '【전개중】상대에 의한 오라로의 대미지, 혹은 라이프로의 대미지 중 어느 한 쪽이 「-」인 《공격》은 무효화된다.'
    },
    {
      id: '09-chikage-o-s-3',
      name: '霞毒空流转',
      namejp: '流転の霞毒',
      namekr: '윤회의 안개독',
      baseType: 'special',
      types: ['attack'],
      range: '3-7',
      damage: '1/2',
      cost: '1',
      text: '【再起】对手的手牌张数大于等于2。',
      textjp: '【再起】相手の手札が2枚以上ある。',
      textkr: '【재기】상대의 손패가 2장 이상이다.'
    },
    {
      id: '09-chikage-o-s-4',
      name: '暗昏千影的信条',
      namejp: '闇昏千影の生きる道',
      namekr: '야미쿠라 치카게의 살아가는 방식',
      baseType: 'special',
      types: ['enhance', 'fullpower'],
      capacity: '4',
      cost: '5',
      text: '【展开中】当自命受到大于等于1点的伤害时，将此牌上的所有樱花结晶移至虚，并将其变为未使用状态（不结算破弃时效果）。\n【破弃时】若你的其它王牌均处于使用后状态，则你赢得本局游戏。',
      textjp: '【展開中】あなたが1以上のライフへのダメージを受けた時、このカードの上の桜花結晶は全てダストに送られ、このカードは未使用に戻る。 \n(破棄時効果は失敗する) \n【破棄時】あなたの他の切札が全て使用済ならば、あなたは勝利する。',
      textkr: '【전개중】당신이 1이상 라이프로의 대미지를 받았을 때, 이 카드 위의 벚꽃 결정은 모두 더스트로 보내지고, 이 카드는 미사용으로 되돌려진다.\n (파기시 효과는 실패한다) \n 【파기시】당신의 다른 비장패가 모두 사용완료라면, 당신은 승리한다.'
    }],
    poison: [{
      id: '09-chikage-o-p-1',
      name: '麻痹毒',
      namejp: '麻痺毒',
      namekr: '마비독',
      baseType: 'poison',
      types: ['action'],
      text: '【常时】若本回合内你执行过基本动作，则你不能使用此牌。\n将此牌置入对手的毒袋。结束当前阶段。',
      textjp: '毒（このカードは伏せ札にできない） \n【常時】このターン中にあなたが基本動作を行ったならば、このカードは使用できない。 \nこのカードを相手の毒袋に戻す。その後、このフェイズを終了する。',
      textkr: '독（이 카드는 덮임패가 될 수 없다） \n 【상시】이 턴에 당신이 기본 동작을 행했다면, 이 카드를 사용 할 수 없다.\n 이 카드를 상대의 독주머니에 되돌린다. 그 후, 이 페이즈를 종료한다.'
    },
    {
      id: '09-chikage-o-p-2',
      name: '幻觉毒',
      namejp: '幻覚毒',
      namekr: '환각독',
      baseType: 'poison',
      types: ['action'],
      text: '将此牌置入对手的毒袋。自气（2）→虚',
      textjp: '毒（このカードは伏せ札にできない） \nこのカードを相手の毒袋に戻す。 \n自フレア→ダスト：2',
      textkr: '독（이 카드는 덮임패가 될 수 없다） \n 이 카드를 상대의 독주머니에 되돌린다. \n 자신 플레어→더스트：2'
    },
    {
      id: '09-chikage-o-p-3',
      name: '迟缓毒',
      namejp: '弛緩毒',
      namekr: '이완독',
      baseType: 'poison',
      types: ['enhance'],
      capacity: '3',
      text: '【展开中】你不能使用《攻击》牌。 \n【破弃时】将此牌置入对手的毒袋。',
      textjp: '毒（このカードは伏せ札にできない） \n【展開中】あなたは《攻撃》カードを使用できない。 \n【破棄時】このカードを相手の毒袋に戻す。',
      textkr: '독（이 카드는 덮임패가 될 수 없다） \n 【전개중】당신은《공격》카드를 사용 할 수 없다.\n 【파기시】이 카드를 상대의 독주머니에 되돌린다.'
    },
    {
      id: '09-chikage-o-p-4',
      name: '灭灯毒',
      namejp: '滅灯毒',
      namekr: '멸등독',
      baseType: 'poison',
      types: ['action'],
      text: '自装（3）→虚',
      textjp: '毒（このカードは伏せ札にできない） \n自オーラ→ダスト：3',
      textkr: '독（이 카드는 덮임패가 될 수 없다） \n 자신 오라→더스트：3'
    },
    {
      id: '09-chikage-o-p-4',
      name: '灭灯毒',
      namejp: '滅灯毒',
      namekr: '멸등독',
      baseType: 'poison',
      types: ['action'],
      text: '自装（3）→虚',
      textjp: '毒（このカードは伏せ札にできない） \n自オーラ→ダスト：3',
      textkr: '독（이 카드는 덮임패가 될 수 없다） \n 자신 오라→더스트：3'
    }]
  },
  {
    name: '绊',
    namejp: '絆',
    namekr: '인연',
    nameen: 'KIZUNA',
    isSelect: false,
    pic: 'twiicon_sa_20.jpg',
    picq: 'sd_chikage_a1.png',
    changenormal: [{
      changeIndex: '5',
      id: '09-chikage-a1-n-5',
      name: '机关油纸伞',
      namejp: '仕掛け番傘',
      namekr: '속임수 우산',
      baseType: 'normal',
      types: ['attack'],
      range: '4',
      damage: '2/1',
      text: '不可被闪避\n【常时】若对手的手牌张数大于等于2，则此《攻击》获得距离扩大（近2、远2）。',
      textjp: '不可避 \n【常時】相手の手札が2枚以上あるならば、この《攻撃》は距離拡大(近2)と距離拡大(遠2)を得る。 \n(他に何もなければ、適正距離は2-6になる)',
      textkr: '불가피 \n【상시】상대의 패가 2장 이상 있다면, 이 《공격》은 거리확대(근2)와 거리확대(원2)를 얻는다.\n(기타 아무것도 없다면, 적정거리는 2-6이 된다)'
    },
    {
      changeIndex: '6',
      id: '09-chikage-a1-n-6',
      name: '奋迅',
      namejp: '奮迅',
      namekr: '궐기',
      baseType: 'normal',
      types: ['action'],
      text: '若对手的手牌张数大于等于2，则你获得1点集中力。\n距（1）⇔虚',
      textjp: '相手の手札が2枚以上あるならば、あなたは集中力を1得る。 \n間合⇔ダスト：1',
      textkr: '상대의 손패가 2장 이상 있다면, 당신은 집중력을 1 얻는다.\n간격⇔더스트：1'
    }],
    changespecial: [{
      changeIndex: '4',
      id: '09-chikage-a1-s-4',
      name: '绊毒淀残渣',
      namejp: '残滓の絆毒',
      namekr: '잔재의 인연독',
      baseType: 'special',
      types: ['attack'],
      range: '0-1',
      damage: '4/X',
      cost: '4',
      text: '不可被对应（通常牌）\n【常时】X等于对手的手牌张数的2倍。',
      textjp: '対応不可（通常札）\n【常時】Xは相手の手札にあるカードの枚数の2倍に等しい。',
      textkr: '대응불가(통상패)\n【상시】X는 상대의 손패에 있는 카드 장수의 2배와 같다.'
    }]
  }]
},
{
  name: 'KURURU 枢',
  namejp: 'クルル',
  namekr: '쿠루루',
  nameen: 'KURURU',
  desc: '机巧～仅当完成机巧时结算相应的齿轮框内的效果。完成机巧需要你的与齿轮框上所示类别相符的牌正面朝上。<br><i class="i-bean i-bean--red"></i>=攻击&nbsp;<i class="i-bean i-bean--blue"></i>=行动&nbsp;<i class="i-bean i-bean--green"></i>=付与&nbsp;<i class="i-bean i-bean--purple"></i>=对应&nbsp;<i class="i-bean i-bean--yellow"></i>=全力',
  descjp: '機巧～機巧が完成していないと歯車枠の効果は解決されない。機巧の完成には歯車枠に示された種類のあなたのカードが表向きである必要がある。<br><i class="i-bean i-bean--red"></i>＝攻撃&nbsp;<i class="i-bean i-bean--blue"></i>＝行動&nbsp;<i class="i-bean i-bean--green"></i>＝付与&nbsp;<i class="i-bean i-bean--purple"></i>＝対応&nbsp;<i class="i-bean i-bean--yellow"></i>＝全力',
  // girlInfo: '身高：169cm\n喜欢的东西：ひらめき、お風呂、コーヒー（砂糖特盛）\n<b>--物語--</b>\n「くるるーん☆　ひらめきましたっ！」\nクルルは着想を象徴するメガミです。着想は主に発明家としてのひらめきのことを指し、それゆえに彼女はカラクリを操る発明家なのです。それも、かなりマッドな部類の。\n彼女の精神性は極めて独特です。彼女は他人はおろか、自分にすら興味がありません。彼女が主とするのはその着想のみであり、それを実現できるかどうかが全てなのです。発明家としては最高の資質ですが、多くの危険をはらんでいるのは言うまでもないでしょう。\n事実、２０年前の一大事では彼女の大発明は世界を危険な方向へと動かしました。他方で、彼女や彼女に影響を受けた人々が、世界を便利な方向へと進めているのも確かです。',
  // girlInfojp: '身長：169cm\n好きなもの：ひらめき、お風呂、コーヒー（砂糖特盛）\n<b>--物語--</b>\n「くるるーん☆　ひらめきましたっ！」\nクルルは着想を象徴するメガミです。着想は主に発明家としてのひらめきのことを指し、それゆえに彼女はカラクリを操る発明家なのです。それも、かなりマッドな部類の。\n彼女の精神性は極めて独特です。彼女は他人はおろか、自分にすら興味がありません。彼女が主とするのはその着想のみであり、それを実現できるかどうかが全てなのです。発明家としては最高の資質ですが、多くの危険をはらんでいるのは言うまでもないでしょう。\n事実、２０年前の一大事では彼女の大発明は世界を危険な方向へと動かしました。他方で、彼女や彼女に影響を受けた人々が、世界を便利な方向へと進めているのも確かです。',
  list: [{
    name: '络缲',
    namejp: '絡繰',
    namekr: '꼭두각시',
    nameen: 'KARAKURI',
    isSelect: false,
    pic: 'twiicon_sa_10.jpg',
    picq: 'sd_kururu.png',
    normal: [{
      id: '10-kururu-o-n-1',
      name: '电气疗法',
      namejp: 'えれきてる',
      namekr: '엘레키텔',
      baseType: 'normal',
      types: ['action'],
      text: '机巧：蓝蓝蓝紫紫～\n对敌命造成1点伤害。',
      textjp: '<行行行対対> 相手のライフに1ダメージを与える。 ',
      textkr: '<행행행대대>상대의 라이프에 1 대미지를 준다.',
      textkururu: [{
        if: '<i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--purple"></i><i class="i-bean i-bean--purple"></i>',
        ctn: '对敌命造成1点伤害。'
      }],
      textkururujp: [{
        if: '<i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--purple"></i><i class="i-bean i-bean--purple"></i>',
        ctn: '相手のライフに1ダメージを与える。'
      }]
    },
    {
      id: '10-kururu-o-n-2',
      name: '加束效应',
      namejp: 'あくせらー',
      namekr: '액셀러',
      baseType: 'normal',
      types: ['action'],
      text: '机巧：蓝蓝绿～\n你可以从手牌中选择1张具《全力》副类别的牌并使用。\n（当前阶段不会因此而结束）',
      textjp: '<行行付> あなたの手札から《全力》カードを1枚選び、そのカードを使用してもよい。 \n(フェイズは終了しない) ',
      textkr: '<행행부> 당신의 손패에서 《전력》카드를 1장 고르고, 그 카드를 사용해도 좋다.\n (페이즈는 종료되지 않는다.)',
      textkururu: [{
        if: '<i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--green"></i>',
        ctn: '你可以从手牌中选择1张具《全力》副类别的牌并使用。\n（当前阶段不会因此而结束）'
      }],
      textkururujp: [{
        if: '<i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--green"></i>',
        ctn: 'あなたの手札から《全力》カードを1枚選び、そのカードを使用してもよい。\n(フェイズは終了しない)'
      }]
    },
    {
      id: '10-kururu-o-n-3',
      name: '枢噜噜～',
      namejp: 'くるるーん',
      namekr: '쿠루루~웅',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '【常时】仅当进行对应时可以使用此牌。\n选择至多2项，以任意顺序结算（不能选择同一项2次）：\n1.抓1张牌；\n2.从盖牌区选择1张牌置于你的牌库底；\n3.对手从手牌中弃1张牌。',
      textjp: '【常時】このカードは対応でしか使用できない。 \n以下から2つまでを選び、任意の順に行う。 \n(同じものを2回選ぶことはできない)\n・カードを1枚引く。\n・伏せ札1枚を山札の底に置く。\n・相手は手札を1枚捨て札にする。',
      textkr: '【상시】이 카드는 대응으로만 사용한다.\n 이하에서 2개까지 고르고, 임의의 순서로 행한다. \n (같은 것을 2번 고를 수 없다.)\n ・카드를 1장 뽑는다.\n ・덮임패 1장을 패산 밑에 둔다.\n ・상대는 손패를 1장 버림패로 한다.'
    },
    {
      id: '10-kururu-o-n-4',
      name: '大龙卷轰',
      namejp: 'とるねーど',
      namekr: '토네이도',
      baseType: 'normal',
      types: ['action', 'fullpower'],
      text: '机巧：红红～\n对敌装造成5点伤害。\n机巧：绿绿～\n对敌命造成1点伤害。',
      textjp: '<攻攻> 相手のオーラに5ダメージを与える。 \n----\n<付付> 相手のライフに1ダメージを与える。',
      textkr: '<공공>상대의 오라에 5 대미지를 준다.\n ----\n <부부> 상대의 라이프에 1 대미지를 준다.',
      textkururu: [{
        if: '<i class="i-bean i-bean--red"></i><i class="i-bean i-bean--red"></i>',
        ctn: '对敌装造成5点伤害。'
      }, {
        if: '<i class="i-bean i-bean--green"></i><i class="i-bean i-bean--green"></i>',
        ctn: '对敌命造成1点伤害。'
      }],
      textkururujp: [{
        if: '<i class="i-bean i-bean--red"></i><i class="i-bean i-bean--red"></i>',
        ctn: '相手のオーラに5ダメージを与える。'
      }, {
        if: '<i class="i-bean i-bean--green"></i><i class="i-bean i-bean--green"></i>',
        ctn: '相手のライフに1ダメージを与える。'
      }]
    },
    {
      id: '10-kururu-o-n-5',
      name: '回嗖利用',
      namejp: 'りげいなー',
      namekr: '리게이너',
      baseType: 'normal',
      types: ['action', 'fullpower'],
      text: '机巧：绿紫～你可以从弃牌、盖牌或使用后的王牌中选择并使用1张其他女神的非《全力》牌，而无需支付其费用。此时你可以从该牌的攻击距离中含有的所有值、对装伤害、对命伤害或纳中选择一项，所选择的所有值增大或减小1。\n----\n【常时】你可以从盖牌区由主要阶段的规则效果使用此牌。',
      textjp: '<付対> 捨て札、伏せ札、切札のいずれかから未使用でも《全力》でもない他のメガミのカードを1枚選んでもよい。そのカードのコストを支払わずに使用する。その際、適正距離のすべての値、どちらかのダメージ、納のいずれかを1増減させてもよい。\n----\n【常時】このカードは伏せ札から手札にあるかのように通常の方法で使用できる。',
      textkururu: [{
        if: '<i class="i-bean i-bean--green"></i><i class="i-bean i-bean--purple"></i>',
        ctn: '你可以从弃牌、盖牌或使用后的王牌中选择并使用1张其他女神的非《全力》牌，而无需支付其费用。此时你可以从该牌的攻击距离中含有的所有值、对装伤害、对命伤害或纳中选择一项，所选择的所有值增大或减小1。'
      }, {
        ctn: '【常时】你可以从盖牌区由主要阶段的规则效果使用此牌。'
      }],
      textkururujp: [{
        if: '<i class="i-bean i-bean--green"></i><i class="i-bean i-bean--purple"></i>',
        ctn: '捨て札、伏せ札、切札のいずれかから未使用でも《全力》でもない他のメガミのカードを1枚選んでもよい。そのカードのコストを支払わずに使用する。その際、適正距離のすべての値、どちらかのダメージ、納のいずれかを1増減させてもよい。'
      }, {
        ctn: '【常時】このカードは伏せ札から手札にあるかのように通常の方法で使用できる。'
      }]
    },
    {
      id: '10-kururu-o-n-6',
      name: '模块化',
      namejp: 'もじゅるー',
      namekr: '모듈',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '3',
      text: '【展开中】每当你使用的《行动》牌结算完毕时，你可以执行一次基本动作。',
      textjp: '【展開中】あなたが《行動》カードを使用した時、その解決後に基本動作を1回行ってもよい。',
      textkr: '【전개중】당신이 《행동》카드를 사용했을 때, 그 해결 후에 기본 동작을 1회 행해도 좋다.'
    },
    {
      id: '10-kururu-o-n-7',
      name: '反射',
      namejp: 'りふれくた',
      namekr: '리플렉터',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '0',
      text: '机巧：红紫～\n【展开时】将4个樱花结晶从虚移至此牌上。\n【展开中】打消每回合对手进行的第二次《攻击》。',
      textjp: '<攻対> 【展開時】このカードの上に桜花結晶を4個ダストから置く。 \n----\n【展開中】各ターンにおける相手の2回目の《攻撃》は打ち消される。\n',
      textkr: '<공대> 【전개시】이 카드 위에 벚꽃 결정을 4개 더스트로부터 올린다.\n ----\n 【전개중】매 턴 상대의 2번째 《공격》은 무효화된다.',
      textkururu: [{
        if: '<i class="i-bean i-bean--red"></i><i class="i-bean i-bean--purple"></i>',
        ctn: '【展开时】将4个樱花结晶从虚移至此牌上。'
      }, {
        ctn: '【展开中】打消每回合对手进行的第二次《攻击》。'
      }],
      textkururujp: [{
        if: '<i class="i-bean i-bean--red"></i><i class="i-bean i-bean--purple"></i>',
        ctn: '【展開時】このカードの上に桜花結晶を4個ダストから置く。'
      }, {
        ctn: '展開中】各ターンにおける相手の2回目の《攻撃》は打ち消される。'
      }]
    }],
    special: [{
      id: '10-kururu-o-s-1',
      name: '魔能吸收',
      namejp: 'どれーんでびる',
      namekr: '드레인 데빌',
      baseType: 'special',
      types: ['action', 'reaction'],
      cost: '2',
      text: '敌装（1）→自装 \n【使用后】每当你的处于使用后状态的王牌变为未使用状态时，你可以使用此牌，而不需支付其费用。',
      textjp: '相オーラ→自オーラ：1 \n【使用済】あなたの使用済の切札が未使用に戻った時、このカードを消費を支払わずに使用してもよい。',
      textkr: '상대 오라→자신 오라：1 \n 【사용완료】당신의 사용완료 비장패가 미사용으로 되돌아갈때, 이 카드를 소비를 지불하지 않고 사용해도 좋다.'
    },
    {
      id: '10-kururu-o-s-2',
      name: '大魔像',
      namejp: 'びっぐごーれむ',
      namekr: '빅 골렘',
      baseType: 'special',
      types: ['action'],
      cost: '4',
      text: '机巧：黄黄紫～\n【使用后】你的结束阶段开始时，你可以对敌命造成1点伤害。若敌命因此受到了伤害，则重铸你的牌库（你不会因此受到伤害）。\n【使用后】每当你使用具《全力》副类别的牌时，该牌结算完毕后你可以执行1次基本动作。',
      textjp: '<対全全> 【使用済】あなたの終了フェイズに相手のライフに1ダメージを与えてもよい。そうした場合、山札を再構成する。 \n----\n【使用済】あなたが《全力》カードを使用した時、その解決後に基本動作を1回行ってもよい。\n',
      textkr: '<대전전> 【사용완료】당신의 종료 페이즈에 상대의 라이프에 1 대미지를 주어도 좋다. 그럴 경우, 패산을 재구성한다.\n ----\n 【사용완료】당신이 《전력》카드를 사용했을 때, 그 해결 후에 기본동작을 1번 해도 좋다.',
      textkururu: [{
        if: '<i class="i-bean i-bean--yellow"></i><i class="i-bean i-bean--yellow"></i><i class="i-bean i-bean--purple"></i>',
        ctn: '【使用后】你的结束阶段开始时，你可以对敌命造成1点伤害。若敌命因此受到了伤害，则重铸你的牌库（你不会因此受到伤害）。'
      }, {
        ctn: '【使用后】每当你使用具《全力》副类别的牌时，该牌结算完毕后你可以执行1次基本动作。'
      }],
      textkururujp: [{
        if: '<i class="i-bean i-bean--yellow"></i><i class="i-bean i-bean--yellow"></i><i class="i-bean i-bean--purple"></i>',
        ctn: '【使用済】あなたの終了フェイズに相手のライフに1ダメージを与えてもよい。そうした場合、山札を再構成する。'
      }, {
        ctn: '【使用済】あなたが《全力》カードを使用した時、その解決後に基本動作を1回行ってもよい。'
      }]
    },
    {
      id: '10-kururu-o-s-3',
      name: '复自黏贴',
      namejp: 'いんだすとりあ',
      namekr: '인더스트리아',
      baseType: 'special',
      types: ['action'],
      cost: '1',
      text: '若此牌为你的牌，且此牌没有封印牌，则你可以从你的手牌或弃牌中选择1张非《付与》的牌，封印于此牌下。\n将1张『复制品齿轮』从追加牌区置于你的牌库底（最多3张）。\n----\n【即再起】你重铸牌库后。',
      textjp: 'このカードがあなたのカードで、カードが封印されていないならば、手札または捨て札から《付与》でないカードを1枚選び、そのカードをこのカードの下に表向きで封印してもよい。 \nあなたの追加札から「でゅーぷりぎあ」を山札の底に1枚置く(最大で合計3枚)。 \n----\n【即再起】あなたが山札を再構成する(再構成の後に未使用に戻る)。',
      textkr: '이 카드에 카드가 봉인되어 있지 않다면, 당신의 손패 또는 버림패에서 《부여》가 아닌 카드 한 장을 골라, 그 카드를 이 카드 밑에 앞면으로 봉인해도 좋다.\n 당신의 추가패에서 「듀플리기어」를 패산의 밑에 1장 둔다(최대 합계 3장). \n ----\n 【즉재기】당신이 패산을 재구성한다(재구성 후에 미사용으로 되돌린다).'
    },
    {
      id: '10-kururu-o-s-4',
      name: '神涉装置：枢式',
      namejp: '神渉装置：枢式',
      namekr: '신섭장치:쿠루루 식',
      baseType: 'special',
      types: ['action'],
      cost: '3',
      text: '机巧：红红蓝蓝蓝绿绿～\n检视对手的王牌。你可以从中选择1张处于未使用状态的牌，将其变为使用后状态。\n你可以从对手的处于使用后状态的王牌中选择1张。使用所选择的牌，而不需支付其费用（可以选择《全力》牌）。结算完毕后将此牌移出游戏。',
      textjp: '<攻攻行行行付付> 相手の切札を見て、その中から1枚選び、それを使用済にしてもよい。\n----\n相手の使用済の切札1枚を選んでもよい。そのカードを消費を支払わずに使用する(《全力》カードでもよい)。その後、このカードを取り除く。',
      textkr: '<공공행행행부부> 상대의 비장패를 보고, 그 중 1장을 골라, 그것을 사용완료로 해도 좋다.\n ----\n 상대의 사용완료 비장패를 1장 골라도 좋다. 그 카드를 소비를 지불하지 않고 사용한다(《전력》카드여도 좋다). 그 후, 이 카드를 제외한다.',
      textkururu: [{
        if: '<i class="i-bean i-bean--red"></i><i class="i-bean i-bean--red"></i><i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--green"></i><i class="i-bean i-bean--green"></i>',
        ctn: '检视对手的王牌。你可以从中选择1张处于未使用状态的牌，将其变为使用后状态。'
      }, {
        ctn: '你可以从对手的处于使用后状态的王牌中选择1张。使用所选择的牌，而不需支付其费用（可以选择《全力》牌）。结算完毕后将此牌移出游戏。'
      }],
      textkururujp: [{
        if: '<i class="i-bean i-bean--red"></i><i class="i-bean i-bean--red"></i><i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--green"></i><i class="i-bean i-bean--green"></i>',
        ctn: '相手の切札を見て、その中から1枚選び、それを使用済にしてもよい。'
      }, {
        ctn: '相手の使用済の切札1枚を選んでもよい。そのカードを消費を支払わずに使用する(《全力》カードでもよい)。その後、このカードを取り除く。'
      }]
    }],
    extra: [{
      id: '10-kururu-o-s-3-ex1',
      name: '复制品齿轮',
      namejp: 'でゅーぷりぎあ',
      namekr: '듀플리기어',
      baseType: 'normal',
      extraFrom: '10-kururu-o-s-3',
      types: ['variable'],
      text: '（牌类别为不定的牌不能使用）\n【常时】此牌为被『复自黏贴』封印的牌之复制，但名称仍为『复制品齿轮』（『复自黏贴』没有封印牌时不触发复制，故不能使用此牌）。',
      textjp: '(カードタイプが不定のカードは使用できない) \n【常時】このカードはあなたの「いんだすとりあ」に封印されたカードの複製となる。但し、名前は変更されない。 \n(「いんだすとりあ」が未使用なら複製とならないので、使用できない)',
      textkr: '(카드 타입이 정해지지 않은 카드는 사용 할 수 없다) \n 【상시】이 카드는 당신의 「인더스트리아」에 봉인된 카드의 복제가 된다. 단, 이름은 변경되지 않는다.\n (「인더스트리아」가 미사용이라면 복제가 안되었기에, 사용 할 수 없다)'
    },
    {
      id: '10-kururu-o-s-3-ex1',
      name: '复制品齿轮',
      namejp: 'でゅーぷりぎあ',
      namekr: '듀플리기어',
      baseType: 'normal',
      extraFrom: '10-kururu-o-s-3',
      types: ['variable'],
      text: '（牌类别为不定的牌不能使用）\n【常时】此牌为被『复自黏贴』封印的牌之复制，但名称仍为『复制品齿轮』（『复自黏贴』没有封印牌时不触发复制，故不能使用此牌）。',
      textjp: '(カードタイプが不定のカードは使用できない) \n【常時】このカードはあなたの「いんだすとりあ」に封印されたカードの複製となる。但し、名前は変更されない。 \n(「いんだすとりあ」が未使用なら複製とならないので、使用できない)',
      textkr: '(카드 타입이 정해지지 않은 카드는 사용 할 수 없다) \n 【상시】이 카드는 당신의 「인더스트리아」에 봉인된 카드의 복제가 된다. 단, 이름은 변경되지 않는다.\n (「인더스트리아」가 미사용이라면 복제가 안되었기에, 사용 할 수 없다)'
    },
    {
      id: '10-kururu-o-s-3-ex1',
      name: '复制品齿轮',
      namejp: 'でゅーぷりぎあ',
      namekr: '듀플리기어',
      baseType: 'normal',
      extraFrom: '10-kururu-o-s-3',
      types: ['variable'],
      text: '（牌类别为不定的牌不能使用）\n【常时】此牌为被『复自黏贴』封印的牌之复制，但名称仍为『复制品齿轮』（『复自黏贴』没有封印牌时不触发复制，故不能使用此牌）。',
      textjp: '(カードタイプが不定のカードは使用できない) \n【常時】このカードはあなたの「いんだすとりあ」に封印されたカードの複製となる。但し、名前は変更されない。 \n(「いんだすとりあ」が未使用なら複製とならないので、使用できない)',
      textkr: '(카드 타입이 정해지지 않은 카드는 사용 할 수 없다) \n 【상시】이 카드는 당신의 「인더스트리아」에 봉인된 카드의 복제가 된다. 단, 이름은 변경되지 않는다.\n (「인더스트리아」가 미사용이라면 복제가 안되었기에, 사용 할 수 없다)'
    }]
  },
  {
    name: '机器',
    namejp: '機器',
    namekr: '장비',
    nameen: 'MACHANISM',
    isSelect: false,
    pic: 'twiicon_sa_25.jpg',
    picq: 'sd_kururu_a1.png',
    changenormal: [{
      changeIndex: '1',
      id: '10-kururu-a1-n-1',
      name: '分析',
      namejp: 'あならいず',
      namekr: '애널라이즈',
      baseType: 'normal',
      types: ['action'],
      text: '机巧：绿红紫～\n从你的盖牌中选择1张牌或者从对手的盖牌中随机选择1张牌，将其置入弃牌区。若该牌为《攻击》牌，则对敌命造成1点伤害。否则对手盖伏1张手牌。',
      textjp: '<付攻対>あなたの任意の伏せ札１枚または相手の無作為な伏せ札１枚を捨て札にする。そのカードが《攻撃》ならば相手のライフに１ダメージを与える。そうでなければ相手は手札を１枚伏せ札にする',
      textkr: '<공부대>당신의 임의의 덮임패 1장 또는 상대의 무작위 덮임패 1장을 버림패로 한다. 그 카드가 《공격》이라면 상대의 라이프에 1데미지를 준다. 그렇지 않다면 상대는 손패를 1장 덮임패로 한다.',
      textkururu: [{
        if: '<i class="i-bean i-bean--green"></i><i class="i-bean i-bean--red"></i><i class="i-bean i-bean--purple"></i>',
        ctn: '从你的盖牌中选择1张牌或者从对手的盖牌中随机选择1张牌，将其置入弃牌区。若该牌为《攻击》牌，则对敌命造成1点伤害。否则对手盖伏1张手牌。'
      }],
      textkururujp: [{
        if: '<i class="i-bean i-bean--green"></i><i class="i-bean i-bean--red"></i><i class="i-bean i-bean--purple"></i>',
        ctn: 'あなたの任意の伏せ札１枚または相手の無作為な伏せ札１枚を捨て札にする。そのカードが《攻撃》ならば相手のライフに１ダメージを与える。そうでなければ相手は手札を１枚伏せ札にする'
      }]
    },
    {
      changeIndex: '3',
      id: '10-kururu-a1-n-3',
      name: '探测',
      namejp: 'だうじんぐ',
      namekr: '다우징',
      baseType: 'normal',
      types: ['action'],
      text: '弃置对手的牌库顶牌。然后从对手的弃牌中选择1张牌。\n机巧：X红Y～\n使用所选择的牌。X为所选择的牌的主类别，Y为所选择的牌的副类别。',
      textjp: '相手の山札の上から１枚を捨て札にする。その後、相手の捨て札を１枚選ぶ。\n<X攻Y>選んだカードを使用する。Xは選んだカードのカードタイプに、Yはサブタイプに等しい',
      textkr: '상대의 패산 위에서 1장을 버림패로 한다. 그 후에 상대 버림패를 1장 고른다.\n----\n<X공Y>고른 카드를 사용한다. X는 고른 카드의 카드 타입에 해당되고 Y는 서브 타입에 해당된다.',
      textkururu: [{
        ctn: '弃置对手的牌库顶牌。然后从对手的弃牌中选择1张牌。'
      }, {
        if: '<i class="i-bean i-bean--x"></i><i class="i-bean i-bean--red"></i><i class="i-bean i-bean--y"></i>',
        ctn: '使用所选择的牌。X为所选择的牌的主类别，Y为所选择的牌的副类别。'
      }],
      textkururujp: [{
        ctn: '相手の山札の上から１枚を捨て札にする。その後、相手の捨て札を１枚選ぶ。'
      }, {
        if: '<i class="i-bean i-bean--x"></i><i class="i-bean i-bean--red"></i><i class="i-bean i-bean--y"></i>',
        ctn: '選んだカードを使用する。Xは選んだカードのカードタイプに、Yはサブタイプに等しい'
      }]
    }],
    changespecial: [{
      changeIndex: '3',
      id: '10-kururu-a1-s-3',
      name: '不懈探索',
      namejp: 'らすとりさーち',
      namekr: '라스트 서치',
      baseType: 'special',
      types: ['action'],
      cost: '1',
      text: '机巧：红～\n对手从其盖牌中选择1张牌。你宣言1个牌名，并弃置所选择的牌。若你宣言的牌名与该牌的牌名一致，则将1个樱花结晶从虚移至此牌上。然后若此牌上的樱花结晶的数目变为2，则将这些结晶移至虚，进行世纪的大发现（查看对手的所有王牌。然后选择你或者对手，将该玩家眼前构筑时未选用的5张王牌，从游戏外以未使用状态加入王牌。将『不懈探索』移出游戏并将『壮绝旅途』从追加牌区以未使用状态加入王牌。），此牌额外获得终端。\n----\n【即再起】你重铸牌库后。',
      textjp: '<攻>相手は伏せ札から１枚選ぶ。あなたはカード名を１つ宣言し、相手は選んだカードを捨て札にする。そのカード名が一致したらこのカードの上にダストから桜花結晶を１つ置く。2つになったらこのカードの上の桜花結晶をダストに送るとともに世紀の大発見を行い、このカードは終端を得る。\n【即再起】あなたが山札を再構成する（再構成の後に未使用に戻る）。',
      textkr: '<공>상대는 덮임패에서 1장을 고른다. 당신은 카드 이름을 1개 선언하고 상대는 고른 카드를 버림패로 한다. 그 카드 이름이 일치했다면 이 카드 위에 더스트에서 벚꽃 결정을 1개 올려둔다. 2개가 되었다면 이 카드 위의 벚꽃 결정을 더스트로 보내고 새기의 대발견을 하고 이 카드는 종단을 얻는다.\n----\n【즉재기】당신이 덱을 재구축한다(재구축 후에 미사용으로 돌아간다).',
      textkururu: [{
        if: '<i class="i-bean i-bean--red"></i>',
        ctn: '对手从其盖牌中选择1张牌。你宣言1个牌名，并弃置所选择的牌。若你宣言的牌名与该牌的牌名一致，则将1个樱花结晶从虚移至此牌上。然后若此牌上的樱花结晶的数目变为2，则将这些结晶移至虚，进行世纪的大发现（查看对手的所有王牌。然后选择你或者对手，将该玩家眼前构筑时未选用的5张王牌，从游戏外以未使用状态加入王牌。将『不懈探索』移出游戏并将『壮绝旅途』从追加牌区以未使用状态加入王牌。），此牌额外获得终端。'
      }, {
        ctn: '----\n【即再起】你重铸牌库后。'
      }],
      textkururujp: [{
        if: '<i class="i-bean i-bean--red"></i>',
        ctn: '相手は伏せ札から１枚選ぶ。あなたはカード名を１つ宣言し、相手は選んだカードを捨て札にする。そのカード名が一致したらこのカードの上にダストから桜花結晶を１つ置く。2つになったらこのカードの上の桜花結晶をダストに送るとともに世紀の大発見を行い、このカードは終端を得る。'
      }, {
        ctn: '【即再起】あなたが山札を再構成する（再構成の後に未使用に戻る）。'
      }]
    }],
    changeExtra: [{
      id: '10-kururu-a1-s-3-ex1',
      name: '壮绝旅途',
      namejp: 'ぐらんがりばー',
      namekr: '그랑갈리버',
      baseType: 'special',
      extraFrom: '10-kururu-a1-s-3',
      types: ['action'],
      cost: 'X',
      text: '【常时】X等于自气中樱花结晶的数目。\n【使用后】你的王牌的费用变为0。',
      textjp: '【常時】Xはあなたのフレアに等しい。\n【使用済】あなたの切札の消費は０となる。',
      textkr: '【상시】X는 당신의 플레어에 해당된다.\n【사용됨】당신의 비장패의 코스트는 0이 된다.'
    }]
  },
  {
    name: '友情',
    namejp: '友情',
    isSelect: false,
    pic: 'twiicon_sa_42.jpg',
    picq: 'sd_kururu_a2.png',
    changenormal: [{
      changeIndex: '1',
      id: '10-kururu-a2-n-1',
      name: '激光枪',
      namejp: 'ぶらすたー',
      baseType: 'normal',
      types: ['attack'],
      range: '2-6',
      damage: '0/0',
      text: '不可被对应（通常牌）\n机巧：绿～【攻击后】若此机巧全部由其他女神的牌组装，则进行一次“攻击距离0-6 伤害1/1”的攻击。\n机巧：蓝紫～【攻击后】若此机巧全部由其他女神的牌组装，则进行一次“攻击距离0-6 伤害1/1”的攻击。',
      textjp: '<付>【攻撃後】他のメガミのカードで組み立てたならば、攻撃『適正距離0-6、1/1』を行う。\n<行対>【攻撃後】他のメガミのカードで組み立てたならば、攻撃『適正距離0-6、1/1』を行う。',
      textkururu: [{
        ctn: '不可被对应（通常牌）'
      }, {
        if: '<i class="i-bean i-bean--green"></i>',
        ctn: '【攻击后】若此机巧全部由其他女神的牌组装，则进行一次“攻击距离0-6 伤害1/1”的攻击。'
      }, {
        if: '<i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--purple"></i>',
        ctn: '【攻击后】若此机巧全部由其他女神的牌组装，则进行一次“攻击距离0-6 伤害1/1”的攻击。'
      }],
      textkururujp: [{
        ctn: '対応不可(通常札)'
      }, {
        if: '<i class="i-bean i-bean--green"></i>',
        ctn: '【攻撃後】他のメガミのカードで組み立てたならば、攻撃『適正距離0-6、1/1』を行う。'
      }, {
        if: '<i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--purple"></i>',
        ctn: '【攻撃後】他のメガミのカードで組み立てたならば、攻撃『適正距離0-6、1/1』を行う。'
      }]
    }, {
      changeIndex: '2',
      id: '10-kururu-a2-n-2',
      name: '电磁炮',
      namejp: 'れーるがん',
      baseType: 'normal',
      types: ['attack'],
      range: '2-6',
      damage: '1/1',
      text: '机巧：红红～【常时】进行此《攻击》时，此《攻击》获得+2/+0。\n机巧：黄～终端\n【常时】进行此《攻击》时，此《攻击》获得+0/+1和不可被打消。',
      textjp: '<攻攻>【常時】この《攻撃》が行われた時、この《攻撃》は+2/+0となる。\n<全>終端\n【常時】この《攻撃》が行われた時、この《攻撃》は+0/+1となり、打ち消されない。',
      textkururu: [{
        if: '<i class="i-bean i-bean--red"></i><i class="i-bean i-bean--red"></i>',
        ctn: '【常时】进行此《攻击》时，此《攻击》获得+2/+0。'
      }, {
        if: '<i class="i-bean i-bean--yellow"></i>',
        ctn: '终端\n【常时】进行此《攻击》时，此《攻击》获得+0/+1和不可被打消。'
      }],
      textkururujp: [{
        if: '<i class="i-bean i-bean--red"></i><i class="i-bean i-bean--red"></i>',
        ctn: '【常時】この《攻撃》が行われた時、この《攻撃》は+2/+0となる。'
      }, {
        if: '<i class="i-bean i-bean--yellow"></i>',
        ctn: '終端\n【常時】この《攻撃》が行われた時、この《攻撃》は+0/+1となり、打ち消されない。'
      }]
    }],
    changespecial: [{
      changeIndex: '4',
      id: '10-kururu-a2-s-4',
      name: '深层连结',
      namejp: 'こねくとだいぶ',
      baseType: 'special',
      types: ['action'],
      cost: '1',
      text: '机巧：绿蓝紫～【使用时/使用后】当你使用此牌时和你的结束阶段开始时，若此机巧全部由其他女神的牌组装，则你可以从虚或自装中选择1个樱花结晶移至此牌上。\n【使用后】每当你结算齿轮框中的效果时，你可以将此牌上的1个樱花结晶移至虚。若如此做，该齿轮框中记述的所有数字变为原来的2倍。',
      textjp: '<付行対>【使用時/使用済】他のメガミのカードで組み立てたならば、使用時とあなたの終了フェイズにダストまたはあなたのオーラからこのカードの上に桜花結晶を1つ置いてもよい。\n【使用済】あなたがある機巧枠の効果を解決するに際し、このカードの上の桜花結晶を1つダストに送ってもよい。そうした場合、その機巧枠の中に書かれた数字全てを2倍にする。',
      textkururu: [{
        if: '<i class="i-bean i-bean--green"></i><i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--purple"></i>',
        ctn: '【使用时/使用后】当你使用此牌时和你的结束阶段开始时，若此机巧全部由其他女神的牌组装，则你可以从虚或自装中选择1个樱花结晶移至此牌上。'
      }, {
        ctn: '【使用后】每当你结算齿轮框中的效果时，你可以将此牌上的1个樱花结晶移至虚。若如此做，该齿轮框中记述的所有数字变为原来的2倍。'
      }],
      textkururujp: [{
        if: '<i class="i-bean i-bean--green"></i><i class="i-bean i-bean--blue"></i><i class="i-bean i-bean--purple"></i>',
        ctn: '【使用時/使用済】他のメガミのカードで組み立てたならば、使用時とあなたの終了フェイズにダストまたはあなたのオーラからこのカードの上に桜花結晶を1つ置いてもよい。'
      }, {
        ctn: '【使用済】あなたがある機巧枠の効果を解決するに際し、このカードの上の桜花結晶を1つダストに送ってもよい。そうした場合、その機巧枠の中に書かれた数字全てを2倍にする。'
      }]
    }]
  }]
},
{
  name: 'THALLYA 萨莉娅',
  namejp: 'サリヤ',
  namekr: '탈리야',
  nameen: 'THALLYA',
  desc: '造花～引擎中有5个造花结晶。',
  descjp: '造花～マシンに造花結晶を5つ持つ。',
  // girlInfo: '身高：176cm\n喜欢的东西：お世話、ツーリング、サーフィン\n<b>--物語--</b>\n「大丈夫！　お姉ちゃんに任せて」\n蒸気機関を搭載した鉄の獣ヴィーナを駆る騎士である彼女は、ユリナやサイネと同じく、もとは人間、サリヤ・ソルアリア・ラーナークでした。彼女も２０年前の一大事で誕生したメガミの一柱です。騎乗の技術などを象徴しているとされていますが、この地の人々は扱いを決めかねてもいます。\nというのも、彼女は海の向こうの出身であり、元々はミコトですらありませんでした。２０年前に自らが仕える貴族の研究者ジュリアを護衛するためこの地へと渡りますが、不幸にもこの地は動乱のさなかにありました。そして様々な事件の結果、メガミへと至ります。そう、彼女は完全なるイレギュラーなのです。',
  // girlInfojp: '身長：176cm\n好きなもの：お世話、ツーリング、サーフィン\n<b>--物語--</b>\n「大丈夫！　お姉ちゃんに任せて」\n蒸気機関を搭載した鉄の獣ヴィーナを駆る騎士である彼女は、ユリナやサイネと同じく、もとは人間、サリヤ・ソルアリア・ラーナークでした。彼女も２０年前の一大事で誕生したメガミの一柱です。騎乗の技術などを象徴しているとされていますが、この地の人々は扱いを決めかねてもいます。\nというのも、彼女は海の向こうの出身であり、元々はミコトですらありませんでした。２０年前に自らが仕える貴族の研究者ジュリアを護衛するためこの地へと渡りますが、不幸にもこの地は動乱のさなかにありました。そして様々な事件の結果、メガミへと至ります。そう、彼女は完全なるイレギュラーなのです。',
  list: [{
    name: '骑',
    namejp: '乗騎',
    namekr: '탈것',
    nameen: 'MOUNT',
    isSelect: false,
    pic: 'twiicon_sa_11.jpg',
    picq: 'sd_thallya.png',
    normal: [{
      id: '11-thallya-o-n-1',
      name: 'Burning Steam',
      namejp: 'Burning Steam',
      baseType: 'normal',
      types: ['attack'],
      range: '3-5',
      damage: '2/1',
      text: '【攻击后】骑动',
      textjp: '【攻撃後】騎動を行う。',
      textkr: '【공격후】기동을 행한다.'
    },
    {
      id: '11-thallya-o-n-2',
      name: 'Waving Edge',
      namejp: 'Waving Edge',
      baseType: 'normal',
      types: ['attack'],
      range: '1-3',
      damage: '3/1',
      text: '燃烧\n【攻击后】骑动',
      textjp: '燃焼 \n【攻撃後】騎動を行う。',
      textkr: '연소 \n 【공격후】기동을 행한다.'
    },
    {
      id: '11-thallya-o-n-3',
      name: 'Shield Charge',
      namejp: 'Shield Charge',
      baseType: 'normal',
      types: ['attack'],
      range: '1',
      damage: '3/2',
      text: '燃烧\n【常时】若此《攻击》对对手造成了伤害，则不将因结算伤害移动的樱花结晶移至气或虚，而改为移至距。',
      textjp: '燃焼 \n【常時】この《攻撃》のダメージにより移動する桜花結晶は、ダストやフレアでなく間合に動かす。',
      textkr: '연소 \n 【상시】이 《공격》의 대미지에 의해 이동하는 벚꽃 결정은, 더스트나 플레어가 아닌 간격으로 움직인다.'
    },
    {
      id: '11-thallya-o-n-4',
      name: 'Steam Cannon',
      namejp: 'Steam Cannon',
      baseType: 'normal',
      types: ['attack', 'fullpower'],
      range: '2-8',
      damage: '3/3',
      text: '燃烧',
      textjp: '燃焼',
      textkr: '연소'
    },
    {
      id: '11-thallya-o-n-5',
      name: 'Stunt',
      namejp: 'Stunt',
      baseType: 'normal',
      types: ['action'],
      text: '自装（2）→自气 \n对手畏缩。',
      textjp: '相手を畏縮させる。 \n自オーラ→自フレア：2',
      textkr: '상대를 위축시킨다。 \n 자신 오라→자신 플레어：2'
    },
    {
      id: '11-thallya-o-n-6',
      name: 'Roaring',
      namejp: 'Roaring',
      baseType: 'normal',
      types: ['action'],
      text: '你可以燃烧2个造花结晶。若如此做，则你获得1点集中力，对手失去1点集中力，对手畏缩。\n你可以支付2点集中力。若如此做，则回复3个造花结晶。',
      textjp: 'コストとして、あなたのマシンにある造花結晶を2つ燃焼済にしても良い。そうした場合、あなたは集中力を1得て、相手は集中力を1失い、相手を畏縮させる。 \nコストとして、集中力を2支払ってもよい。そうした場合、あなたの燃焼済の造花結晶を3つ回復する。',
      textkr: '코스트로,  당신의 머신에 있는 조화결정을 2개 연소완료로 해도 좋다. 그럴 경우, 당신은 집중력을 1 얻고, 상대는 집중력을 1 잃으며, 상대를 위축시킨다。 \n코스트로, 집중력을 2만큼 지불해도 좋다. 그럴 경우, 당신의 연소완료 조화결정을 3개 회복한다.'
    },
    {
      id: '11-thallya-o-n-7',
      name: 'Turbo Switch',
      namejp: 'Turbo Switch',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '燃烧\n骑动',
      textjp: '燃焼 \n騎動を行う。',
      textkr: '연소 \n 기동을 행한다.'
    }],
    special: [{
      id: '11-thallya-o-s-1',
      name: 'Alpha-Edge',
      namejp: 'Alpha-Edge',
      baseType: 'special',
      types: ['attack'],
      range: '1,3,5,7',
      damage: '1/1',
      cost: '1',
      text: '【即再起】骑动造成距离变化。',
      textjp: '【即再起】あなたが騎動により間合を変化させる。',
      textkr: '【즉재기】당신이 기동으로 간격을 변화시킨다.'
    },
    {
      id: '11-thallya-o-s-2',
      name: 'Omega-Burst',
      namejp: 'Omega-Burst',
      baseType: 'special',
      types: ['action', 'reaction'],
      cost: '4',
      text: '回复你所有的造花结晶。打消被对应的对装伤害为“-”或小于等于X的《攻击》，X等于因此牌效果回复的造花结晶的个数。',
      textjp: 'あなたの燃焼済の造花結晶を全て回復する。 \n対応した、オーラへのダメージが「-」またはX以下の《攻撃》を打ち消す。Xはこのカードにより回復した造花結晶の個数に等しい。',
      textkr: '당신의 연소완료 조화결정을 모두 회복한다.\n 대응한, 오라로의 대미지가 「-」 혹은 X 이하의 《공격》은 무효화된다. X는 이 카드로 회복한 조화결정의 갯수와 같다.'
    },
    {
      id: '11-thallya-o-s-3',
      name: 'Thallya\'s Masterpiece',
      namejp: 'Thallya\'s Masterpiece',
      baseType: 'special',
      types: ['action'],
      cost: '1',
      text: '【使用后】你的回合内，每当你由于除基本动作以外的效果进行骑动时，若此次骑动改变了距离，则你可以选择\n虚（1）⇔ 距',
      textjp: '【使用済】あなたのターンに、あなたが基本動作以外の方法で騎動を行い、間合を変化させるたびに\nダスト⇔間合：1 \nを行ってもよい。',
      textkr: '【사용완료】당신의 턴에, 당신이 기본동작 이외의 방법으로 기동을 행하고, 간격에 변화를 줄 때마다\n더스트⇔간격：1 \n를 행해도 좋다.'
    },
    {
      id: '11-thallya-o-s-4',
      name: 'Julia\'s BlackBox',
      namejp: 'Julia\'s BlackBox',
      baseType: 'special',
      types: ['action', 'fullpower'],
      cost: '2',
      text: '若你的引擎中没有处于未燃烧状态的造花结晶，则TRANSFORM你的引擎，然后回复2个处于燃尽状态的造花结晶，否则将此牌变为未使用状态。',
      textjp: 'あなたのマシンに造花結晶がないならば、あなたのマシンはTransFormし、あなたの燃焼済の造花結晶を2つ回復する。そうでない場合、このカードを未使用に戻す。',
      textkr: '당신의 머신에 조화결정이 없다면, 당신의 머신은 TransForm하고, 당신의 연소완료 조화결정을 2개 회복한다. 그렇지 않을 경우, 이 카드를 미사용으로 되돌린다.'
    }],
    transform: [{
      id: '11-thallya-o-tf-1',
      name: 'Form: YAKSHA',
      namejp: 'Form: YAKSHA',
      baseType: 'transform',
      types: ['transform'],
      text: '【变形时】对手下个准备阶段只抓1张牌，对手畏缩。\n【常时】若你的引擎中没有处于未燃烧状态的造花结晶，则你不能执行基本动作。\n【追加基本动作】Beta-Edge：进行一次“攻击距离2,4,6,8 伤害2/1 【攻击后】进行一次骑动。”的攻击。',
      textjp: '【変形時】相手は次の開始フェイズにカードを1枚しか引けない。相手を畏縮させる。\n----\n【常時】あなたのマシンに造花結晶がないならば、あなたは基本動作を行えない。\n----\n【追加基本行動：Beta-Edge】『適正距離2,4,6,8、2/1 【攻撃後】騎動を行う』の《攻撃》を行う。',
      textkr: '【변형시】상대는 다음 개시 페이즈에 카드를 1장밖에 뽑을 수 없다. 상대를 위축시킨다。\n ----\n 【상시】당신의 머신에 조화결정이 없다면, 당신은 기본동작을 행할 수 없다.\n ----\n 【추가기본행동：Beta-Edge】\n「적정거리2,4,6,8、2/1 【공격후】기동을 한다」의 《공격》을 행한다.'
    },
    {
      id: '11-thallya-o-tf-2',
      name: 'Form: NAGA',
      namejp: 'Form: NAGA',
      baseType: 'transform',
      types: ['transform'],
      text: '【变形时】若敌气中的樱花结晶的数目大于等于3，则保留其中2个樱花结晶，其余移至虚。\n【追加基本动作】Gamma-Ray：弃置对手的牌库顶牌。',
      textjp: '【変形時】相手のフレアが3以上ならば、フレアが2になるように桜花結晶をダストへ移動させる。\n----\n【追加基本行動：Gamma-Ray】\n相手の山札の一番上のカードを相手の捨て札に置く。',
      textkr: '【변형시】상대의 플레어가 3이상이라면、플레어가 2가 되도록 벚꽃 결정을 더스트로 이동시킨다.\n ----\n 【추가기본행동：Gamma-Ray】\n 상대 패산의 가장 위의 카드를 상대의 버림패로 둔다.'
    },
    {
      id: '11-thallya-o-tf-3',
      name: 'Form: GARUDA',
      namejp: 'Form: GARUDA',
      baseType: 'transform',
      types: ['transform'],
      text: '【变形时】抓2张牌。本回合内你的手牌数量没有上限。\n【追加基本动作】Delta-Wing：若当前距离小于等于7，则虚（1）→距',
      textjp: '【変形時】カードを2枚引き、このターンの間手札の上限が無くなる。\n----\n【追加基本行動：Delta-Wing】\n現在の間合が7以下ならば、ダスト→間合：1',
      textkr: '【변형시】카드를 2장 뽑고, 이 턴 동안 손패의 상한은 없어진다.\n ----\n 【추가기본행동：Delta-Wing】\n 현재 간격이 7 이하라면, 더스트→간격：1'
    }]
  },
  {
    name: '新型',
    namejp: '新型',
    namekr: '신형',
    nameen: 'NEW FORM',
    isSelect: false,
    pic: 'twiicon_sa_31.jpg',
    picq: 'sd_thallya_a1.png',
    changenormal: [{
      changeIndex: '5',
      id: '11-thallya-a1-n-5',
      name: 'Quick Change',
      namejp: 'Quick Change',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '3',
      text: '【展开时】回复1个处于燃尽状态的造花结晶。然后从追加牌区选择1张变形牌，封印于此牌下（不结算变形时效果）。\n【展开中】此牌所封印的牌的追加基本动作与常时效果生效。\n【破弃时】将此牌所封印的牌置入追加牌区。',
      textjp: '【展開時】あなたの燃焼済の造花結晶を1つ回復する。その後、追加札にあるTransFormカードを1枚選び、このカードの下に封印する（変形時効果は解決されない）。\n【展開中】このカードに封印されたカードの追加基本動作、常時を有効にする。\n【破棄時】このカードに封印されたカードを追加札に戻す。'
    }],
    changespecial: [{
      changeIndex: '1',
      id: '11-thallya-a1-s-1',
      name: 'BlackBox NEO',
      namejp: 'BlackBox NEO',
      baseType: 'special',
      types: ['action'],
      cost: '1',
      text: '终端\n回复1个处于燃尽状态的造花结晶。然后若你处于燃尽状态的造花结晶的数目等于0，则将1个樱花结晶从虚移至此牌上。若此牌上的樱花结晶的数目变为2，则将它们移至虚，然后TRANSFORM你的引擎。\n----\n【再起】你的引擎中造花结晶的数目小于等于3。或者本回合内你的引擎进行了TRANSFORM。',
      textjp: '終端\nあなたの燃焼済の造花結晶を1つ回復する。その後、あなたが燃焼済の造花結晶をもたないならば、このカードの上にダストから桜花結晶を1つ置く。2つになったらこのカードの上の桜花結晶をダストに送るとともに、あなたのマシンはTransFormする。\n----\n【再起】あなたのマシンにある造花結晶が3個以下である。または、このターンにあなたのマシンはTransFormしている。',
      textkr: '종단\n당신의 연소된 조화 결정을 1개 회복한다. 그 다음 당신의 머신에 연소된 벚꽃 결정이 없다면 이 카드 위에 더스트에서 벚꽃 결정을 1개 올린다. 2개가 되었다면 이 카드 위의 벚꽃 결정을 더스트로 보내는 것과 함께 당신의 머신은 TransForm한다.\n----\n【재기】당신의 머신에 있는 조화 결정이 3개이하다. 또는 이 턴에 당신의 머신이 TransForm했다.'
    },
    {
      changeIndex: '2',
      id: '11-thallya-a1-s-2',
      name: 'OMNIS-Blaster',
      namejp: 'OMNIS-Blaster',
      baseType: 'special',
      types: ['attack'],
      range: '3-10',
      damage: 'X/X',
      cost: 'X',
      text: '【常时】X等于本局游戏中你的引擎进行TRANSFORM的次数。',
      textjp: '【常時】XはあなたのマシンがこのゲームでTransFormした回数に等しい。',
      textkr: '【상시】X는 당신의 머신이 이 게임에서 TransForm한 회수와 같다.'
    }],
    changeTransform: [{
      changeIndex: '1',
      id: '11-thallya-a1-tf-1',
      name: 'Form: KINNARI',
      namejp: 'Form: KINNARI',
      baseType: 'transform',
      types: ['transform'],
      text: '【变形时】盖伏对手的牌库。\n----\n【常时】Zeta-Voice：每当对手重铸牌库时，重铸完毕后你可以进行一次“攻击距离2,4,6 伤害2/2”的攻击。',
      textjp: '【変形時】相手は山札をすべて伏せ札にする。\n----\n【常時】Zeta-Voice：相手が山札を再構成したとき、その解決後に攻撃『適正距離2,4,6、2/2』を行ってもよい。',
      textkr: '【변형시】상대는 패산을 전부 덮임패로 한다.\n----\n【상시：Zeta-Voice】\n상대가 패산을 재구성할 때마다 그 해결 후에 공격 「적정 거리 2, 4, 6, 2/2」을 해도 좋다.'
    },
    {
      changeIndex: '3',
      id: '11-thallya-a1-tf-3',
      name: 'Form: ASURA',
      namejp: 'Form: ASURA',
      baseType: 'transform',
      types: ['transform'],
      text: '【变形时】对手从其盖牌中选择1张牌并弃置之。然后再结算上述效果1次。\n----\n【追加基本动作】Sigma-Drive：进行一次“攻击距离3,5 伤害3/2 【攻击后】你畏缩”的攻击。此基本动作每回合至多执行一次。',
      textjp: '【変形時】相手は伏せ札から１枚を選び、それを捨て札にする。これをもう１回繰り返す。\n----\n【常時】Sigma-Drive：『適正距離3,5、3/2【攻撃後】あなたは畏縮する。』を行う。\nこの基本動作は一ターンに1回だけ行える。'
    },
    {
      changeIndex: '4',
      id: '11-thallya-a1-tf-4',
      name: 'Form: DEVA',
      namejp: 'Form: DEVA',
      baseType: 'transform',
      types: ['transform'],
      text: '【变形时】回复2个处于燃尽状态的造花结晶。执行2次基本动作《装附》。\n----\n【常时】Phi-Cycle：每当对手的弃牌张数变为除0以外的2的倍数时，你获得1点集中力。',
      textjp: '【変形時】あなたの燃焼済の造花結晶を2つ回復し、基本動作《纏い》を2回行う。\n----\n【常時】Phi-Cycle：相手の捨て札にあるカードの枚数が0でない2の倍数になるたびに、あなたは集中力を1得る。',
      textkr: '【변형시】당신의 연소된 조화 결정을 2개 회복하고 기본 동작 《휘감기》를 2번 한다.\n----\n【상시：Phi-Cycle】\n상대의 버림패의 수가 0이 아닌 2의 배수가 될 때마다 당신은 집중력을 1얻는다.'
    }]
  }]
},
{
  name: 'RAIRA 雷螺',
  namejp: 'ライラ',
  namekr: '라이라',
  nameen: 'RAIRA',
  desc: '风雷～具有风神槽和雷神槽，槽的初始值为0，最大值为20。每当你使用其他女神的牌时，该牌会带电。若你解除牌的带电状态，则两个槽之一的值上升1。（横置牌表示其已解除带电）',
  descjp: '風雷～風神ゲージと雷神ゲージを持ち、初期値は0、最大値は20である。あなたが他のメガミのカードを使用するたびにそれは帯電し、帯電を解除すればどちらかのゲージを1上げられる。（帯電を解除したらカードを横向きにして表す）',
  // girlInfo: '身高：161cm\n喜欢的东西：肉、天体観測、走ること、沐浴\n<b>--物語--</b>\n「らいの爪、迅い。頼りにしていい……」\nライラは風と雷を象徴するメガミです。外見の通り、人間よりも獣に近い精神性を持ち、戦いの場においては獰猛に吠え、敵を引き掴み切り裂きます。野生の獣のように警戒心が強く、冷静で冷徹。しかし一度気を許した家族には思う存分甘えるようです。\nこれだけ見ると彼女の頭が悪いと誤解されてしまいそうですが、実はそうではありません。彼女は学問に興味はなく、言葉を扱うのが苦手です。しかし彼女は誰よりも自然の知恵に長けているのです。例えば星の運行を本能で把握し、時刻や方角を深く理解するのはお手の物です。彼女は天性のシャーマンでもあり、いつも自然と共にあるのです。',
  // girlInfojp: '身長：161cm\n好きなもの：肉、天体観測、走ること、沐浴\n<b>--物語--</b>\n「らいの爪、迅い。頼りにしていい……」\nライラは風と雷を象徴するメガミです。外見の通り、人間よりも獣に近い精神性を持ち、戦いの場においては獰猛に吠え、敵を引き掴み切り裂きます。野生の獣のように警戒心が強く、冷静で冷徹。しかし一度気を許した家族には思う存分甘えるようです。\nこれだけ見ると彼女の頭が悪いと誤解されてしまいそうですが、実はそうではありません。彼女は学問に興味はなく、言葉を扱うのが苦手です。しかし彼女は誰よりも自然の知恵に長けているのです。例えば星の運行を本能で把握し、時刻や方角を深く理解するのはお手の物です。彼女は天性のシャーマンでもあり、いつも自然と共にあるのです。',
  list: [{
    name: '爪',
    namejp: '爪',
    namekr: '발톱',
    nameen: 'CLAW',
    isSelect: false,
    pic: 'twiicon_sa_14.jpg',
    picq: 'sd_raira.png',
    normal: [{
      id: '12-raira-o-n-1',
      name: '兽爪',
      namejp: '獣爪',
      namekr: '짐승의 발톱',
      baseType: 'normal',
      types: ['attack'],
      range: '1-2',
      damage: '3/1',
      text: '',
      textjp: ''
    },
    {
      id: '12-raira-o-n-2',
      name: '风雷击',
      namejp: '風雷撃',
      namekr: '풍뢰격',
      baseType: 'normal',
      types: ['attack'],
      range: '2',
      damage: 'X/2',
      text: '【常时】X等于风神槽与雷神槽的值中的较小者。',
      textjp: '【常時】Xは風神ゲージと雷神ゲージのうち、小さい方の値である。',
      textkr: '【상시】X는 풍신 게이지나 뇌신 게이지 중, 작은쪽의 수치가 된다.'
    },
    {
      id: '12-raira-o-n-3',
      name: '流转爪',
      namejp: '流転爪',
      namekr: '윤회의 발톱',
      baseType: 'normal',
      types: ['attack'],
      range: '1-2',
      damage: '2/1',
      text: '【攻击后】你可以从弃牌中选择1张《攻击》牌，将其置于你的牌库顶。',
      textjp: '【攻撃後】あなたの捨て札にある《攻撃》カード1枚を選び、山札の一番上に置いてもよい。',
      textkr: '【공격후】당신의 버림패에 있는 《공격》카드 1장을 골라, 패산 맨 위에 두어도 좋다.'
    },
    {
      id: '12-raira-o-n-4',
      name: '疾风步',
      namejp: '風走り',
      namekr: '바람 달리기',
      baseType: 'normal',
      types: ['action'],
      text: '若当前距离大于等于3，则距（2）→虚',
      textjp: '現在の間合が3以上ならば、間合→ダスト：2',
      textkr: '현재 간격이 3이상이라면、간격→더스트：2'
    },
    {
      id: '12-raira-o-n-5',
      name: '风雷的知慧',
      namejp: '風雷の知恵',
      namekr: '풍뢰의 지혜',
      baseType: 'normal',
      types: ['action'],
      text: '若风神槽与雷神槽的值之和大于等于4，则你可以从弃牌中选择1张其他女神的牌，将其置于你的牌库顶。\n选择风神槽或雷神槽，其值增加1。',
      textjp: '風神ゲージと雷神ゲージの合計が4以上ならば、あなたの捨て札にある他のメガミのカード1枚を選び、山札の一番上に置いてもよい。 \n風神ゲージか雷神ゲージを1上げる。',
      textkr: '풍신 게이지와 뇌신 게이지의 합계가 4이상이라면, 당신의 버림패에 있는 다른 여신 카드 1장을 골라, 패산 맨 위에 두어도 좋다.\n 풍신 게이지나 뇌신 게이지를 1 올린다.'
    },
    {
      id: '12-raira-o-n-6',
      name: '吼叫',
      namejp: '呼び声',
      namekr: '울부짖기',
      baseType: 'normal',
      types: ['action', 'fullpower'],
      text: '对手畏缩。选择1项：\n1.风神槽与雷神槽的值各增加1；\n2.盖伏所有手牌，雷神槽的值加倍。',
      textjp: '相手を畏縮させ、以下から1つを選ぶ。\n・風神ゲージと雷神ゲージを1ずつ上げる。\n・手札を全て伏せ札にし、雷神ゲージを2倍にする。',
      textkr: '상대를 위축시키고, 이하에서 하나를 고른다.\n ・풍신 게이지와 뇌신 게이지를 1개씩 올린다.\n ・손패를 모두 덮임패로하고, 뇌신 게이지를 2배로 한다.'
    },
    {
      id: '12-raira-o-n-7',
      name: '驭空术',
      namejp: '空駆け',
      namekr: '하늘 달리기',
      baseType: 'normal',
      types: ['action', 'fullpower'],
      text: '距（3）⇔ 虚',
      textjp: '間合⇔ダスト：3',
      textkr: '간격⇔더스트：3'
    }],
    special: [{
      id: '12-raira-o-s-1',
      name: '雷螺风神爪',
      namejp: '雷螺風神爪',
      namekr: '뇌라풍신조',
      baseType: 'special',
      types: ['attack'],
      range: '1-2',
      damage: '2/2',
      cost: '3',
      text: '【常时】若雷神槽的值大于等于4，则此《攻击》获得+1/+0。\n----\n【再起】风神槽的值大于等于4。',
      textjp: '【常時】あなたの雷神ゲージが4以上ならば、この《攻撃》は+1/+0となる。 \n----\n【再起】あなたの風神ゲージが4以上である。',
      textkr: '【상시】당신의 뇌신 게이지가 4이상이라면、이 《공격》은 +1/+0이 된다. \n ----\n 【재기】당신의 풍신 게이지가 4 이상이다.'
    },
    {
      id: '12-raira-o-s-2',
      name: '天雷召唤阵',
      namejp: '天雷召喚陣',
      namekr: '천뢰소환진',
      baseType: 'special',
      types: ['action', 'fullpower'],
      cost: '6',
      text: '进行X次“攻击距离0-10 伤害1/1”的攻击，X等于雷神槽的值的一半（向上取整）。',
      textjp: '攻撃『適正距離0-10、1/1』をX回行う。Xは雷神ゲージの半分(切り上げ)に等しい。',
      textkr: '공격『적정거리0-10、1/1』을 X번 행한다. X는 뇌신 게이지의 절반(올림값)과 같다.'
    },
    {
      id: '12-raira-o-s-3',
      name: '风魔招来孔',
      namejp: '風魔招来孔',
      namekr: '풍마초래공',
      baseType: 'special',
      types: ['action'],
      cost: '2',
      text: '根据现在的风神槽的值，将以下牌从追加牌区以未使用状态加入王牌，然后将此牌移出游戏。\n大于等于3……『风魔旋风』\n大于等于7……『风魔缠回』\n大于等于12……『风魔天狗道』',
      textjp: '現在の風神ゲージに応じて、以下の切札を追加札から未使用で得る(条件を満たしたものは全て得る)。その後、このカードを取り除く。 \n3以上……風魔旋風 \n7以上……風魔纏廻 \n12以上……風魔天狗道',
      textkr: '현재 풍신 게이지에 따라, 이하의 비장패를 추가패에서 미사용으로 얻는다(조건을 만족한 것은 모두 얻는다). 그 후, 이 카드를 제외한다.\n 3이상……풍마선풍 \n 7이상……풍마전회 \n 12이상……풍마천구도'
    },
    {
      id: '12-raira-o-s-4',
      name: '圆环轮回旋',
      namejp: '円環輪廻旋',
      namekr: '원환륜회선',
      baseType: 'special',
      types: ['enhance', 'reaction'],
      capacity: '3',
      cost: '2',
      text: '【展开中】每当对手进行的《攻击》结算完毕时，你可以依次执行：\n距（1）⇔ 虚\n选择风神槽或雷神槽，其值增加1。',
      textjp: '【展開中】相手が《攻撃》を行なったならば、その解決後に以下を行ってもよい。\nダスト⇔間合：1 \n風神ゲージか雷神ゲージを1上げる。',
      textkr: '【전개중】상대의 《공격》 해결 후에 아래를 전부 처리해도 좋다.\n・간격⇔더스트：1\n・풍신 게이지 또는 뇌신 게이지를 1올린다.'
    }],
    extra: [{
      id: '12-raira-o-s-3-ex1',
      name: '风魔旋风',
      namejp: '風魔旋風',
      namekr: '풍마선풍',
      baseType: 'special',
      extraFrom: '12-raira-o-s-3',
      types: ['attack'],
      range: '1-3',
      damage: '1/2',
      cost: '1',
      text: '',
      textjp: ''
    },
    {
      id: '12-raira-o-s-3-ex2',
      name: '风魔缠回',
      namejp: '風魔纏廻',
      namekr: '풍마전회',
      baseType: 'special',
      extraFrom: '12-raira-o-s-3',
      types: ['action'],
      cost: '1',
      text: '从你的处于使用后状态的王牌中选择1张，将其变为未使用状态。\n【使用后】你的王牌的费用减小1（王牌的费用不会为负）。',
      textjp: 'あなたの使用済の切札を1枚選び、それを未使用に戻す。 \n【使用済】あなたの切札の消費は1少なくなる(0未満にはならない)。',
      textkr: '당신의 사용완료 비장패를 1장 골라, 그것을 미사용으로 되돌린다.\n 【사용완료】당신의 비장패의 소비는 1 적게 된다.(0 미만으로는 되지 않는다).'
    },
    {
      id: '12-raira-o-s-3-ex3',
      name: '风魔天狗道',
      namejp: '風魔天狗道',
      baseType: 'special',
      extraFrom: '12-raira-o-s-3',
      types: ['action', 'reaction'],
      cost: '4',
      text: '距（5）⇔ 虚\n结算上述效果时，你可以选择移动少于指定数目的樱花结晶。\n将此牌移出游戏。',
      textjp: 'ダスト⇔間合：5 \nあなたはこの効果で本来より少ない個数の桜花結晶を動かしてもよい。その後、このカードを取り除く。'
    }]
  },
  {
    name: '岚',
    namejp: '嵐',
    namekr: '폭풍',
    nameen: 'STORM',
    isSelect: false,
    pic: 'twiicon_sa_32.jpg',
    picq: 'sd_raira_a1.png',
    changenormal: [{
      changeIndex: '2',
      id: '12-raira-a1-n-2',
      name: '暴风',
      namejp: '暴風',
      namekr: '폭풍',
      baseType: 'normal',
      types: ['attack'],
      range: '2-3',
      damage: '2/1',
      text: '【攻击后】你可以使用1次岚之力。',
      textjp: '【攻撃後】嵐の力を1回使用してもよい。'
    },
    {
      changeIndex: '6',
      id: '12-raira-a1-n-6',
      name: '大风暴',
      namejp: '大嵐',
      namekr: '대폭풍',
      baseType: 'normal',
      types: ['enhance', 'fullpower'],
      capacity: '0',
      text: '【展开时】选择3次。你可以多次选择同一个选项。\n1.选择风神槽或雷神槽，其值增加1；\n2.将1个樱花结晶从虚移至此牌上。\n【展开中】每回合的结束阶段开始时，进行一次“攻击距离0-4 伤害1/1 不可被对应”的攻击。\n【展开中】每回合内，每当对手进行第一次《攻击》时，该《攻击》获得+0/-1。',
      textjp: '【展開時】以下を3回選ぶ。同じものを複数回選んでも良い。\n・風神ゲージか雷神ゲージを1上げる。\n・このカードの上にダストから桜花結晶を1つ置く。\n【展開中】あなたと相手の終了フェイズに攻撃『適正距離0-4、1/1、対応不可』を行う。\n【展開中】各ターンにおける相手の最初の《攻撃》は+0/-1となる。',
      textkr: '【전개시】아래를 3번 고른다. 같은 것을 여러 선택해도 좋다.\n・풍신 게이지 또는 뇌신 게이지를 1올린다.\n・이 카드 위에 더스트에서 벚꽃 결정을 1개 올린다.\n【전개중】당신과 상대의 종료 페이즈에 공격 『적정 거리0-4, 1/1, 대응불가』를 한다.\\n【전개중】각 턴마다 상대의 최초의 《공격》은 +0/-1된다.'
    }],
    changespecial: [{
      changeIndex: '3',
      id: '12-raira-a1-s-3',
      name: '阵风祭天式',
      namejp: '陣風祭天儀',
      namekr: '진풍제천의',
      baseType: 'special',
      types: ['action'],
      cost: '2',
      text: '风神槽和雷神槽各增加1，对手畏缩。\n【使用后】你使用的牌不会带电。\n【使用后】每当你的主要阶段开始时，若你选择执行标准行动，则你可以使用至多2次岚之力，但不能选择同一项2次。',
      textjp: '風神ゲージと雷神ゲージを1ずつ上げ、相手を畏縮させる。\n【使用済】あなたが使用したカードは帯電しない。\n【使用済】あなたのメインフェイズの開始時に、あなたが標準行動を選択したなら、嵐の力を2回まで使用してもよい。だたし、同じ力は選べない。',
      textkr: '풍신 게이지와 뇌신 게이지를 1개씩 올리고 상대를 위축시킨다.\n【사용됨】당신이 사용한 카드는 대전되지 않는다.\n【사용됨】당신의 페인 페이즈 개시 시에 당신이 표준 행동을 선택했다면, 태풍의 힘을 2번까지 사용해도 좋다. 하지만 같은 힘은 선택할 수 없다.'
    }],
    girlBoard: [{
      id: '12-raira-a1-st',
      name: '【岚之力】',
      namejp: '【嵐の力】',
      namekr: '【폭풍의 힘】',
      baseType: '',
      types: ['extra'],
      text: '1风：虚（1）⇔ 距\n2风：抓1张牌，盖伏1张手牌。\n3风：你获得1点集中力，对手失去1点集中力。\n----\n1雷：本回合内你的下一次《攻击》获得+1/+0。\n2雷：进行一次“攻击距离0-4 伤害1/1”的攻击。\n3雷：本回合内你的下一次对装伤害不为“-”的《攻击》获得+0/+1。',
      textjp: '風1：ダスト（１）⇔間合。\n風2：カードを１枚引き、手札を１枚伏せ札にする。\n風3：あなたは集中力を１得て、相手は集中力を１失う。\n----\n雷1：このターンにあなたが次に行う《攻撃》は+1/+0となる。\n雷2：攻撃『適正距離0-4、1/1』を行う。\n雷3：このターンにあなたが次に行うオーラへのダメージが「-」でない《攻撃》は+0/+1となる。'
    }]
  }]
},
{
  name: 'UTSURO 虚路',
  namejp: 'ウツロ',
  namekr: '우츠로',
  nameen: 'UTSURO',
  desc: '灰尘～若虚中的樱花结晶的数目大于等于12，则你的一部分牌会获得强化。',
  descjp: '灰塵～ダストが12以上ならば、いくつかのカードが強化される。',
  // girlInfo: '身高：147cm\n喜欢的东西：お掃除、すごく辛いもの、一人遊び\n<b>--物語--</b>\n「灰よ、塵よ、集いて呑み込め……！」\nこの世界の力の源である桜花結晶は、その生成を司るホノカと塵化を司るウツロにより循環しています。役割からも分かる通り、かつて彼女は世界の根幹をなす強大なメガミでした。ですが今は違います。はるか昔の時代において、生成を司っていたヲウカとの対立によりかつてのウツロは封じられ、今の彼女はそこから零れた残滓に過ぎないのです。\n２０年前の一大事でその姿を現し、騒乱を引き起こしました。しかしユリナとホノカによって助けられ、今は彼女らと共に桜花決闘の運営を行っています。無感情で冷酷なように見えますが、本質は孤独を恐れる優しい気質をしています。',
  // girlInfojp: '身長：147cm\n好きなもの：お掃除、すごく辛いもの、一人遊び\n<b>--物語--</b>\n「灰よ、塵よ、集いて呑み込め……！」\nこの世界の力の源である桜花結晶は、その生成を司るホノカと塵化を司るウツロにより循環しています。役割からも分かる通り、かつて彼女は世界の根幹をなす強大なメガミでした。ですが今は違います。はるか昔の時代において、生成を司っていたヲウカとの対立によりかつてのウツロは封じられ、今の彼女はそこから零れた残滓に過ぎないのです。\n２０年前の一大事でその姿を現し、騒乱を引き起こしました。しかしユリナとホノカによって助けられ、今は彼女らと共に桜花決闘の運営を行っています。無感情で冷酷なように見えますが、本質は孤独を恐れる優しい気質をしています。',
  list: [{
    name: '镰',
    namejp: '鎌',
    namekr: '낫',
    nameen: 'SCYTHE',
    isSelect: false,
    pic: 'twiicon_sa_12.jpg',
    picq: 'sd_utsuro.png',
    normal: [{
      id: '13-utsuro-o-n-1',
      name: '圆月',
      namejp: '円月',
      namekr: '만월',
      baseType: 'normal',
      types: ['attack'],
      range: '5-7',
      damage: '2/2',
      text: '【常时】灰尘～若虚中的樱花结晶的数目大于等于12，则此《攻击》获得距离扩大（近1），且对装伤害变为“-”。',
      textjp: '【常時】灰塵-ダストが12以上ならば、この《攻撃》は距離拡大（近1）を得て、そのオーラへのダメージは「-」になる。'
    },
    {
      id: '13-utsuro-o-n-2',
      name: '黑之波动',
      namejp: '黒き波動',
      namekr: '검은 파동',
      baseType: 'normal',
      types: ['attack'],
      range: '4-7',
      damage: '1/2',
      text: '【攻击后】若对手选择由装承受此次伤害，则检视对手的手牌，从中选择1张弃置。',
      textjp: '【攻撃後】相手がオーラへのダメージを選んだならば、相手の手札を見てその中から1枚を選び、それを捨て札にする。',
      textkr: '【공격후】상대가 오라로의 대미지를 골랐다면, 상대의 손패를 보고 그 중 1장을 골라, 그것을 버림패로 한다.'
    },
    {
      id: '13-utsuro-o-n-3',
      name: '收割',
      namejp: '刈取り',
      namekr: '수확',
      baseType: 'normal',
      types: ['attack'],
      range: '4',
      damage: '-/0',
      text: '【攻击后】对手从其装、气、命三个区域中选择共2个樱花结晶移至虚。\n【攻击后】你可以选择对手的1张展开中的《付与》牌，将其上2个樱花结晶移至虚。',
      textjp: '【攻撃後】相手は相手のオーラ、フレア、ライフのいずれかから桜花結晶を合計2つダストへ移動させる。 \n【攻撃後】相手の付与札を1枚選んでもよい。そうした場合、その付与札の上から桜花結晶を2つダストへ送る。',
      textkr: '【공격후】상대는 상대의 오라, 플레어, 라이프 중 원하는 곳들에서 벚꽃 결정을 총합 2개를 더스트로 이동시킨다. \n【공격후】상대의 부여패를 1장 선택해도 좋다. 그럴 경우, 그 부여패 위에서 벚꽃 결정을 2개 더스트로 보낸다.'
    },
    {
      id: '13-utsuro-o-n-4',
      name: '重压',
      namejp: '重圧',
      namekr: '중압',
      baseType: 'normal',
      types: ['action'],
      text: '对手从其装、气、命三个区域中选择1个樱花结晶移至虚。\n灰尘～若虚中的樱花结晶的数目大于等于12，则对手畏缩。',
      textjp: '相手は相手のオーラ、フレア、ライフのいずれかから桜花結晶を1つダストへ移動させる。 \n灰塵-ダストが12以上ならば、相手を畏縮させる。',
      textkr: '상대는 상대의 오라, 플레어, 라이프 중 원하는 곳에서 벚꽃 결정을 하나 더스트로 이동시킨다.\n 회진-더스트가 12 이상이라면、상대를 위축시킨다.'
    },
    {
      id: '13-utsuro-o-n-5',
      name: '影之翅',
      namejp: '影の翅',
      namekr: '그림자 날개',
      baseType: 'normal',
      types: ['action'],
      text: '直到回合结束，当前距离增大2，达人距离增大2。',
      textjp: 'このターン中、現在の間合は2増加し、達人の間合は2大きくなる。',
      textkr: '이 턴에는, 현재 간격은 2 증가하고, 달인의 간격은 2 크게 된다.'
    },
    {
      id: '13-utsuro-o-n-6',
      name: '影之壁',
      namejp: '影の壁',
      namekr: '그림자 벽',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '被对应的《攻击》获得-0/-1。',
      textjp: '対応した《攻撃》は+0/-1となる。',
      textkr: '대응한 《공격》은 +0/-1이 된다.'
    },
    {
      id: '13-utsuro-o-n-7',
      name: '遗灰咒',
      namejp: '遺灰呪',
      namekr: '유회주',
      baseType: 'normal',
      types: ['enhance', 'fullpower'],
      capacity: '2',
      text: '【展开时】敌装（3）→虚 \n【破弃时】灰尘～若虚中的樱花结晶的数目大于等于12，则虚（2）→敌装，敌命（1）→虚',
      textjp: '【展開時】相オーラ→ダスト：3 \n【破棄時】灰塵-ダストが12以上ならば以下を行う。 \nダスト→相オーラ：2、相ライフ→ダスト：1',
      textkr: '【전개시】상대 오라→더스트：3 \n 【파기시】회진-더스트가 12이상이라면 아래를 행한다. \n 더스트→상대 오라：2、상대 라이프→더스트：1'
    }],
    special: [{
      id: '13-utsuro-o-s-1',
      name: '灰灭',
      namejp: '灰滅',
      namekr: '회멸~вымирание~',
      baseType: 'special',
      types: ['action'],
      cost: '24',
      text: '【常时】此牌的费用减小X，X等于虚中的樱花结晶的数目。\n敌命（3）→虚\n将此牌移出游戏。',
      textjp: '【常時】このカードの消費はダストの数だけ少なくなる。 \n相ライフ→ダスト：3 \nこのカードを取り除く。',
      textkr: '【상시】이 카드의 소비는 더스트의 수 만큼 줄어든다.\n 상대 라이프→더스트：3 \n 이 카드를 제외한다.'
    },
    {
      id: '13-utsuro-o-s-2',
      name: '虚伪',
      namejp: '虚偽',
      namekr: '허위~Ложь~',
      baseType: 'special',
      types: ['enhance', 'reaction'],
      capacity: '3',
      cost: '3',
      text: '【展开中】对手的《攻击》获得距离缩小（近1），且不结算其【攻击后】效果。\n【展开中】对手的《付与》牌的纳减小1，且不结算其【破弃时】效果。',
      textjp: '【展開中】相手の《攻撃》は距離縮小(近1)を得て、【攻撃後】効果が解決されない。 \n【展開中】相手の《付与》カードは納が1減少し、【破棄時】効果が解決されない。',
      textkr: '【전개중】상대의 《공격》은 거리축소(근1)을 얻고, 【공격후】효과가 해결되지 않는다.\n 【전개중】상대의 《부여》카드는 납이 1 감소하고, 【파기시】효과가 해결되지 않는다.'
    },
    {
      id: '13-utsuro-o-s-3',
      name: '终末',
      namejp: '終末',
      namekr: '종말~Конец~',
      baseType: 'special',
      types: ['enhance'],
      capacity: '3',
      cost: '2',
      text: '【展开中】当你因被攻击受到了大于等于1点的伤害时，该《攻击》结算完毕后将此牌上所有樱花结晶移至虚。\n【破弃时】结束当前阶段。\n----\n【再起】灰尘～虚中的樱花结晶的数目大于等于12。',
      textjp: '【展開中】あなたに1以上のダメージを与えた《攻撃》の解決後に、このカードの上の桜花結晶を全てをダストに送る。 \n【破棄時】現在のフェイズを終了する。 \n----\n【再起】灰塵-ダストが12以上である。',
      textkr: '【전개중】당신에게 1 이상의 대미지를 준  《공격》을 해결한 뒤, 이 카드 위의 벚꽃 결정을 모두 더스트로 보낸다.\n 【파기시】현재 페이즈를 종료한다.\n ----\n 【재기】회진-더스트가 12 이상이다.'
    },
    {
      id: '13-utsuro-o-s-4',
      name: '魔食',
      namejp: '魔食',
      namekr: '마식~Эрозия~',
      baseType: 'special',
      types: ['action'],
      cost: '4',
      text: '【使用后】每当你的准备阶段开始时，对手选择一项：\n1.敌装（1）→虚\n2.敌气（2）→虚',
      textjp: '【使用済】あなたの開始フェイズの開始時に相手は以下のどちらかを選ぶ。\n・相オーラ→ダスト：1\n・相フレア→ダスト：2',
      textkr: '【사용완료】당신의 개시 페이즈 시작시에 상대는 이하에서 하나를 고른다.\n ・상대 오라→더스트：1\n ・상대 플레어→더스트：2'
    }]
  },
  {
    name: '尘',
    namejp: '塵',
    namekr: '먼지',
    nameen: 'DUST',
    isSelect: false,
    pic: 'twiicon_sa_21.jpg',
    picq: 'sd_utsuro_a1.png',
    changenormal: [{
      changeIndex: '2',
      id: '13-utsuro-a1-n-2',
      name: '侵蚀之尘',
      namejp: '蝕みの塵',
      namekr: '좀먹는 먼지',
      baseType: 'normal',
      types: ['attack'],
      range: '3-6',
      damage: '2/0',
      text: '【攻击后】若对手选择由命承受此次伤害，则敌气（2）→虚',
      textjp: '【攻撃後】相手がライフへのダメージを選んだならば、相フレア→ダスト：2',
      textkr: '【공격후】상대가 라이프로의 대미지를 골랐다면, 상대 플레어→더스트：2'
    }],
    changespecial: [{
      changeIndex: '1',
      id: '13-utsuro-a1-s-1',
      name: '残响装置：枢式',
      namejp: '残響装置:枢式',
      namekr: '잔향장치:쿠루루 식',
      baseType: 'special',
      types: ['enhance'],
      capacity: '2',
      cost: '2',
      text: '【展开中】仅当虚中的樱花结晶的数目大于等于13，且自命中的樱花结晶的数目小于等于6时可以移动此牌上的樱花结晶。\n【破弃时】若当前阶段为准备阶段，则终焉之影苏醒（将你手牌、牌库、盖牌区、弃牌区与付与区中的所有非王牌的牌移出游戏（不结算《付与》牌的破弃时效果），将因此移出游戏的樱花结晶移至虚，将『万象乖离残灭之影』『自灭往寂』『终焉将至』从追加牌区置入弃牌区并洗牌）。从追加牌区将『夙愿』以使用后状态加入王牌，抓1张牌，然后将此牌移出游戏。',
      textjp: '【展開中】ダストが13以上かつあなたのライフが6以下である場合のみ、このカードの上の桜花結晶は移動する。\n【破棄時】現在のフェイズが開始フェイズならば終焉の影が蘇る。その後、このカードを取り除き、あなたの追加札から「望我」を使用済で得て、カードを1枚引く。',
      textkr: '【전개중】더스트가 13이상이고 당신의 라이프가 6이하일 경우에만 이 카드 위의 벚꽃결정이 이동한다.\n【파기시】현재 페이즈가 개시 페이즈라면 종언의 그림자가 되살아난다. 그 후에 이 카드를 제외하고 당신의 추가패에서 「욕망」을 사용된 상태로 얻고 카드를 1장 뽑는다.'
    }],
    changeExtra: [{
      id: '13-utsuro-a1-s-1-ex1',
      name: '夙愿',
      namejp: '望我',
      namekr: '욕망~желание~',
      baseType: 'special',
      extraFrom: '13-utsuro-a1-s-1',
      types: ['action'],
      cost: '6',
      text: '【使用后】你不会受到伤害。\n----\n【即再起】你的主要阶段开始时。',
      textjp: '【使用済】あなたはダメージを受けない。 \n----\n【即再起】あなたのメインフェイズが開始する。',
      textkr: '【사용완료】당신은 대미지를 받지 않는다.\n----\n【즉재기】당신의 메인페이즈가 개시된다.'
    },
    {
      id: '13-utsuro-a1-s-1-ex2',
      name: '万象乖离残灭之影',
      namejp: '万象乖ク殲滅ノ影',
      namekr: '만물을 끊는 섬멸의 그림자',
      baseType: 'normal',
      extraFrom: '13-utsuro-a1-s-1',
      types: ['attack', 'fullpower'],
      range: '0-3',
      damage: '-/0',
      text: '不可被对应\n【攻击后】对手从其装、命、气三个区域中选择共6个樱花结晶移至虚。',
      textjp: '対応不可 \n【攻撃後】相手は相手のオーラ、フレア、ライフのいずれかから桜花結晶を合計6つダストへ移動させる。',
      textkr: '대응불가 \n【공격후】상대는 상대의 오라, 플레어, 라이프 중 원하는 곳들에서 벚꽃 결정을 총합 6개를 더스트로 이동시킨다.'
    },
    {
      id: '13-utsuro-a1-s-1-ex3',
      name: '自灭往寂',
      namejp: '我ヲ亡クシテ静寂ヲ往ク',
      namekr: '나를 잊고 적막으로 가거라',
      baseType: 'normal',
      extraFrom: '13-utsuro-a1-s-1',
      types: ['action', 'fullpower'],
      text: '你可以执行至多5次非《前进》的基本动作。\n进行一次“攻击距离4-10 伤害3/2”的攻击。\n进行一次“攻击距离5-10 伤害1/1”的攻击。\n进行一次“攻击距离6-10 伤害1/1”的攻击。',
      textjp: 'あなたは《前進》以外の基本動作を5回まで行ってもよい。 \n攻撃『適正距離4-10、3/2』を行う。 \n攻撃『適正距離5-10、1/1』を行う。 \n攻撃『適正距離6-10、1/1』を行う。',
      textkr: '당신은 《전진》이외의 기본동작을 5번까지 행해도 좋다.\n공격「적정거리 4-10、3/2」를 행한다.\n공격「적정거리 5-10、1/1」를 행한다. \n공격「적정거리 6-10、1/1」를 행한다.'
    },
    {
      id: '13-utsuro-a1-s-1-ex4',
      name: '终焉将至',
      namejp: '終焉、来タレ',
      namekr: '종언, 당도했나니',
      baseType: 'normal',
      extraFrom: '13-utsuro-a1-s-1',
      types: ['enhance'],
      capacity: '2',
      text: '【破弃时】对手将其牌库与手牌置入弃牌区。对手的集中力变为0，对手畏缩。',
      textjp: '【破棄時】相手は手札と山札をすべて捨て札にする。相手の集中力は0になる。相手を畏縮させる。',
      textkr: '【파기시】상대는 손패와 패산을 모두 버림패로 한다. 상대의 집중력은 0이 된다. 상대를 위축시킨다.'
    }]
  }]
},
{
  name: 'HONOKA 仄佳',
  namejp: 'ホノカ',
  namekr: '호노카',
  nameen: 'HONOKA',
  desc: '开花～你的一部分牌在使用后可以与其他牌交换。',
  descjp: '開花～いくつのカードは使用した後で異なるカードへと変換される。',
  // girlInfo: '身高：147cm\n喜欢的东西：お料理、衣装作り、和菓子\n<b>--物語--</b>\n「塵はまた桜へ……そしてわたしたちの力へ！」\nこの世界の力の源である桜花結晶は、その生成を司るホノカと塵化を司るウツロにより循環しています。世界の根幹をなす力ではありますが、彼女はまだその力を使いこなせていません。彼女ははるか昔の時代で生成を司っていた原初の三柱・ヲウカが転生した姿であり、未成熟な存在なのです。\nある動乱でヲウカは危機に陥り、転生しました。そして２０年前の一大事においてまだ人間だった天音揺波の片手に宿り、彼女との絆を育み、今ではユリナ、ウツロと共に桜花決闘の運営を行っています。いい子ではあるのですが、最近は本性が見えてきたとの噂も？',
  // girlInfojp: '身長：147cm\n好きなもの：お料理、衣装作り、和菓子\n<b>--物語--</b>\n「塵はまた桜へ……そしてわたしたちの力へ！」\nこの世界の力の源である桜花結晶は、その生成を司るホノカと塵化を司るウツロにより循環しています。世界の根幹をなす力ではありますが、彼女はまだその力を使いこなせていません。彼女ははるか昔の時代で生成を司っていた原初の三柱・ヲウカが転生した姿であり、未成熟な存在なのです。\nある動乱でヲウカは危機に陥り、転生しました。そして２０年前の一大事においてまだ人間だった天音揺波の片手に宿り、彼女との絆を育み、今ではユリナ、ウツロと共に桜花決闘の運営を行っています。いい子ではあるのですが、最近は本性が見えてきたとの噂も？',
  list: [{
    name: '旗',
    namejp: '旗',
    namekr: '깃발',
    nameen: 'FLAG',
    isSelect: false,
    pic: 'twiicon_sa_13.jpg',
    picq: 'sd_honoka.png',
    normal: [{
      id: '14-honoka-o-n-1',
      name: '精灵式',
      namejp: '精霊式',
      namekr: '정령식',
      baseType: 'normal',
      types: ['attack'],
      range: '2-8',
      damage: '1/1',
      text: '不可被对应\n【攻击后】开花～你可以将这张『精灵式』与追加牌区中的『守护灵式』交换。若如此做，则你可以将『守护灵式』置于你的牌库底。',
      textjp: '対応不可 \n【攻撃後】開花-この「精霊式」を追加札の「守護霊式」と交換してもよい。そうした場合、その「守護霊式」を山札の底に置いてもよい。',
      textkr: '대응불가 \n【공격후】개화-이 「정령식」을 추가패의 「수호령식」과 교환해도 좋다. 그럴 경우, 그 「수호령식」을 패산 밑에 두어도 좋다.'
    },
    {
      id: '14-honoka-o-n-2',
      name: '樱吹雪',
      namejp: '桜吹雪',
      namekr: '벚꽃보라',
      baseType: 'normal',
      types: ['attack'],
      range: '3-5',
      damage: '2/1',
      text: '【攻击后】对手选择一项：\n1.距（1）→自装；\n2.敌装（1）→距。',
      textjp: '【攻撃後】相手は以下のどちらかを選ぶ。\n・間合→自オーラ：1\n・相オーラ→間合：1',
      textkr: '【공격후】상대는 아래에서 하나를 고른다.\n・간격→자신 오라：1\n・상대 오라→간격：1'
    },
    {
      id: '14-honoka-o-n-3',
      name: '义旗共振',
      namejp: '義旗共振',
      namekr: '의기공진',
      baseType: 'normal',
      types: ['attack', 'fullpower'],
      range: '2-9',
      damage: '2/2',
      text: '【攻击后】你可以抓1张牌。\n【攻击后】你可以将1张手牌置于你的牌库底。\n【攻击后】你可以将此牌置于你的牌库底。',
      textjp: '【攻撃後】カードを１枚引いてもよい。 \n【攻撃後】あなたは手札を1枚選び、それを山札の底に置いてもよい。 \n【攻撃後】このカードを山札の底に置いてもよい。',
      textkr: '【공격후】카드를 1장 뽑아도 좋다.\n【공격후】당신은 손패를 1장 골라, 그것을 패산 밑에 두어도 좋다.\n【공격후】이 카드를 패산 밑에 두어도 좋다.'
    },
    {
      id: '14-honoka-o-n-4',
      name: '樱之翅',
      namejp: '桜の翅',
      namekr: '벚꽃 날개',
      baseType: 'normal',
      types: ['action'],
      text: '距（2）⇔虚\n将这张『樱之翅』与追加牌区中的『再生』交换。',
      textjp: '間合⇔ダスト：2 \nこの「桜の翅」を追加札の「再生」と交換する。',
      textkr: '간격⇔더스트：2 \n이 「벚꽃 날개」를 추가패의 「재생」과 교환한다.'
    },
    {
      id: '14-honoka-o-n-5',
      name: '樱花护身符',
      namejp: '桜花のお守り',
      namekr: '벚꽃 부적',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '你可以从手牌中选择1张牌并盖伏。若如此做，则打消被对应的非王牌的《攻击》。\n开花～你可以将这张『樱花护身符』与追加牌区中的『暗淡的光辉』交换。若如此做，则你可以将『暗淡的光辉』置于你的牌库底。',
      textjp: 'あなたは手札を１枚選び、それを伏せ札にしてもよい。そうした場合、対応した切札でない《攻撃》を打ち消す。 \n開花-この「桜花のお守り」を追加札の「仄かなる輝き」と交換してもよい。そうした場合、その「仄かなる輝き」を山札の底に置いてもよい。',
      textkr: '당신은 손패를 1장 골라, 그것을 덮임패로 해도 좋다. 그럴 경우, 대응하는 비장패가 아닌 《공격》은 무효화된다.\n개화-이 「벚꽃 부적」을 추가패의 「아련한 반짝임」과 교환해도 좋다. 그럴 경우, 그 「아련한 반짝임」을 패산 밑에 두어도 좋다.'
    },
    {
      id: '14-honoka-o-n-6',
      name: '指挥',
      namejp: '指揮',
      namekr: '지휘',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '3',
      text: '【展开中】你的结束阶段开始时，进行一次“攻击距离1-5 伤害1/1 不可被对应”的攻击。',
      textjp: '【展開中】あなたの終了フェイズに攻撃『適正距離1-5、1/1、対応不可』を行う。',
      textkr: '【전개중】당신의 엔드 페이즈 시에 공격 「적정거리 1-5, 1/1, 대응불가」을 한다.'
    },
    {
      id: '14-honoka-o-n-7',
      name: '追风',
      namejp: '追い風',
      namekr: '순풍',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '3',
      text: '【展开中】你的《攻击》获得距离扩大（远1）。',
      textjp: '【展開中】あなたの《攻撃》は距離拡大(遠1)を得る。',
      textkr: '【전개중】당신의 《공격》은 거리확대(원1)을 얻는다.'
    }],
    special: [{
      id: '14-honoka-o-s-1',
      name: '感存于心',
      namejp: '胸に想いを',
      namekr: '가슴에 마음을',
      baseType: 'special',
      types: ['action'],
      cost: '5',
      text: '开花～将这张『感存于心』与追加牌区中的『结樱于手』交换，将『结樱于手』变为未使用状态。',
      textjp: '開花-この「胸に想いを」を追加札の「両手に華を」に交換し、未使用に戻す。',
      textkr: '개화-이 「품속에 마음을」을 추가패의 「양손에 꽃을」과 교환하고, 미사용으로 되돌린다.'
    },
    {
      id: '14-honoka-o-s-2',
      name: '在此旗的名义之下',
      namejp: 'この旗の名の下に',
      namekr: '이 깃발 이름 아래에',
      baseType: 'special',
      types: ['attack'],
      range: '3-7',
      damage: '3/2',
      cost: '4',
      text: '【常时】当你使用此牌时，你可以选择你的1张展开中的《付与》牌。若此《攻击》对对手造成了伤害，则不将因结算伤害移动的樱花结晶移至气或虚，而改为移至所选择的《付与》牌上。',
      textjp: '【常時】このカードを使用するに際し、あなたの付与札を1つ選んでもよい。この《攻撃》のダメージにより移動する桜花結晶はダストやフレアでなく選ばれた付与札に可能ならば動かす。 \n(付与札が存在しないなど不可能な場合は通常通りに桜花結晶を動かす)',
      textkr: '【상시】이 카드를 사용 할 때, 당신의 부여패를 1장 선택해도 좋다. 이 《공격》의 대미지에 의해 이동하는 벚꽃 결정은, 가능하다면 더스트나 플레어로가 아닌 선택한 부여패로 움직인다. \n(부여패가 존재하지 않음 등의 불가능한 경우에는 통상대로 벚꽃 결정을 움직인다)'
    },
    {
      id: '14-honoka-o-s-3',
      name: '四季轮回',
      namejp: '四季はまた廻り来る',
      namekr: '사계는 다시 돌아온다',
      baseType: 'special',
      types: ['action', 'reaction'],
      cost: '1',
      text: '你可以从你的盖牌中选择1张牌，将其置于你的牌库底。\n你可以抓1张牌。\n盖伏1张手牌。若如此做，执行1次基本动作《装附》。\n【使用后】每当你的牌从追加牌区移动至其他区域时，你可以将此牌置入追加牌区，若如此做，则将此牌从追加牌区以未使用状态加入王牌。',
      textjp: 'あなたの伏せ札からカードを1枚選び、山札の底に置いてもよい。\nカードを1枚引いてもよい。\n手札を1枚伏せ札にする。そうした場合、基本動作《纏い》を1回行う。\n【使用済】あなたのカードが追加札から别の領域へと移動した時、このカードを追加札に移してもよい。その後、このカードを未使用で追加札から得る。',
      textkr: '당신의 덮임패에서 1장을 골라서 패산 맨 밑으로 보내도 좋다.\n카드를 1장 뽑아도 좋다.\n손패를 1장 덮임패로 한다. 그렇게 한 경우, 기본 동작 《휘감기》를 1번 한다.\n\n【사용됨】당신의 카드가 추가패에서 다른 영역으로 이동했을 때, 이 카드를 추가패로 이동시켜도 좋다. 그 후에 이 카드를 미사용으로 추가패에서 얻는다.'
    },
    {
      id: '14-honoka-o-s-4',
      name: '漫天的花道',
      namejp: '満天の花道で',
      namekr: '만개한 꽃길에서',
      baseType: 'special',
      types: ['enhance'],
      capacity: '5',
      cost: '2',
      text: '【展开中】若此牌上的樱花结晶将被移除，则不将其移至虚，而改为移至自装。若自装中樱花结晶的数目大于等于5，则改为将其移至自气。',
      textjp: '【展開中】この付与札の上の桜花結晶がダストへと送られるならば、それは代わりにあなたのオーラへと移動する。あなたのオーラが5以上ならば、代わりにあなたのフレアへ移動する。',
      textkr: '【전개중】이 부여패 위의 벚꽃 결정이 더스트로 보내진다면, 그것은 대신 당신의 오라로 이동한다. 당신의 오라가 5 이상이라면, 대신 당신의 플레어로 이동한다.'
    }],
    extra: [{
      id: '14-honoka-o-n-1-ex1',
      name: '守护灵式',
      namejp: '守護霊式',
      namekr: '수호령식',
      baseType: 'normal',
      extraFrom: '14-honoka-o-n-1',
      types: ['attack', 'reaction'],
      range: '2-3',
      damage: '2/1',
      text: '【攻击后】虚（1）→自装\n【攻击后】开花～你可以将这张『守护灵式』与追加牌区中的『突击灵式』交换。若如此做，则你可以将『突击灵式』置于你的牌库底。',
      textjp: '【攻撃後】ダスト→自オーラ：1 \n【攻撃後】開花-この「守護霊式」を追加札の「突撃霊式」と交換してもよい。そうした場合、その「突撃霊式」を山札の底に置いてもよい。',
      textkr: '【공격후】더스트→자신 오라：1 \n【공격후】개화-이 「수호령식」을 추가패의 「돌격령식」과 교환해도 좋다. 그럴 경우, 그 「돌격령식」을 패산 밑에 두어도 좋다.'
    },
    {
      id: '14-honoka-o-n-1-ex2',
      name: '突击灵式',
      namejp: '突撃霊式',
      namekr: '돌격령식',
      baseType: 'normal',
      extraFrom: '14-honoka-o-n-1-ex1',
      types: ['attack'],
      range: '5',
      damage: '3/2',
      text: '不可被对应\n【攻击后】虚（1）→自命\n【攻击后】开花～你可以将这张『突击灵式』与追加牌区中的『神灵奥华』交换。若如此做，则你可以将『神灵奥华』置于你的牌库底。',
      textjp: '対応不可\n【攻撃後】ダスト→自ライフ：1\n【攻撃後】開花-この「突撃霊式」を追加札の「神霊ヲウカ」と交換してもよい。そうした場合、その「神霊ヲウカ」を山札の底に置いてもよい。'
    },
    {
      id: '14-honoka-o-n-1-ex3',
      name: '神灵奥华',
      namejp: '神霊ヲウカ',
      namekr: '신령 오우카',
      baseType: 'normal',
      extraFrom: '14-honoka-o-n-1-ex2',
      types: ['attack', 'fullpower'],
      range: '1-4',
      damage: '4/3',
      text: '不可被对应\n【攻击后】虚（2）→自装',
      textjp: '対応不可 \n【攻撃後】ダスト→自オーラ：2',
      textkr: '대응불가 \n【공격후】더스트→자신 오라：2'
    },
    {
      id: '14-honoka-o-n-4-ex1',
      name: '再生',
      namejp: '再生',
      namekr: '재생',
      baseType: 'normal',
      extraFrom: '14-honoka-o-n-4',
      types: ['action', 'fullpower'],
      text: '虚（1）→自装\n虚（1）→自气\n将这张『再生』与追加牌区中的『樱之翅』交换。',
      textjp: 'ダスト→自オーラ：1 \nダスト→自フレア：1 \nこの「再生」を追加札の「桜の翅」と交換する。',
      textkr: '더스트→자신 오라：1 \n더스트→자신 플레어：1 \n이 「재생」을 추가패의 「벚꽃 날개」와 교환한다.'
    },
    {
      id: '14-honoka-o-n-5-ex1',
      name: '暗淡余辉',
      namejp: '仄かなる輝き',
      namekr: '아련한 반짝임',
      baseType: 'normal',
      extraFrom: '14-honoka-o-n-5',
      types: ['attack'],
      range: '1-3',
      damage: '1/2',
      text: '',
      textjp: ''
    },
    {
      id: '14-honoka-o-s-1-ex1',
      name: '结樱于手',
      namejp: '両手に華を',
      namekr: '양손에 꽃을',
      baseType: 'special',
      extraFrom: '14-honoka-o-s-1',
      types: ['action', 'fullpower'],
      cost: '0',
      text: '执行1次基本动作《装附》。（此次《装附》不会触发此牌的替代效果）\n【使用后】你的结束阶段开始时，执行1次基本动作《装附》。\n【使用后】开花～你可以将你的基本动作《装附》的效果改为将1个樱花结晶从虚或自装移至此牌上。若此牌上的樱花结晶的数目因此恰好变为5，则将它们移至自气，将这张『结樱于手』与追加牌区中的『旋即旌招幕展』交换，将『旋即旌招幕展』变为未使用状态。',
      textjp: '基本動作《纏い》を1回行う。\n【使用済】あなたの終了フェイズに基本動作《纏い》を1回行う。\n【使用済】開花-あなたが基本動作《纏い》を行うならば、代わりにダストまたはあなたのオーラからこのカードの上に桜花結晶を1つ置いてもよい。その結果、ちょうど5つになったならば、それらの桜花結晶をあなたのフレアへと移動させ、この「両手に華を」を追加札の「そして新たな幕開けを」に交換し、未使用に戻す。',
      textkr: '기본 동작 《휘감기》를 1번 한다.\n【사용됨】당신의 종료 페이즈에 기본 동작 《휘감기》를 1번 한다.\n【사용됨】개화―당신이 기본 동작 《휘감기》를 한다면, 대신에 더스트 또는 당신의 오라에서 이 카드 위에 벚꽃 결정을 1개 올려도 좋다. 그 결과로 5개가 되었다면 이 카드 위의 벚꽃 결정을 전부 당신의 플레어로 이동시키고 이 「양손에 꽃을」을 추가패의 「그리고 새로운 개막을」으로 교환하고 미사용으로 되돌린다.'
    },
    {
      id: '14-honoka-o-s-1-ex2',
      name: '旋即旌招幕展',
      namejp: 'そして新たな幕開けを',
      namekr: '그리고 새로운 개막을',
      baseType: 'special',
      extraFrom: '14-honoka-o-s-1-ex1',
      types: ['action'],
      cost: '5',
      text: '【使用后】你的结束阶段开始时，进行一次“攻击距离0-10 伤害X/X 不可被对应 【常时】X等于场上樱花结晶的数目恰等于5的区域的个数。”的攻击。',
      textjp: '【使用済】あなたの終了フェイズに攻撃『適正距離0-10、X/X、対応不可 【常時】Xは桜花結晶がちょうど5つある領域の数に等しい』を行う。',
      textkr: '【사용완료】당신의 종료 페이즈에 공격 「적정거리 0-10、X/X、대응불가 【상시】X는 벚꽃 결정이 딱 5개 있는 영역의 수와 같다」를 행한다.'
    }]
  },
  {
    name: '勾玉',
    namejp: '勾玉',
    isSelect: false,
    pic: 'twiicon_sa_37.jpg',
    picq: 'sd_honoka_a1.png',
    changenormal: [{
      changeIndex: '1',
      id: '14-honoka-a1-n-1',
      name: '樱之双剑',
      namejp: '桜の双剣',
      baseType: 'normal',
      types: ['attack'],
      range: '4-6',
      damage: '2/1',
      text: '【攻击后】虚（1）→自装\n【攻击后】将这张『樱之双剑』与追加牌区中的『影之两手』交换。若如此做，则你可以将『影之两手』置于你的牌库底。',
      textjp: '【攻撃後】ダスト→自オーラ：1\n【攻撃後】この「桜の双剣」を追加札の「影の両手」と交換する。そうした場合、その「影の両手」を山札の底に置いてもよい。'
    }],
    changespecial: [{
      changeIndex: '1',
      id: '14-honoka-a1-s-1',
      name: '独醒于昏明',
      namejp: 'ひとり目覚めて',
      cost: '3',
      baseType: 'special',
      types: ['action'],
      text: '敌装（1）→自装\n开花～根据虚中樱花结晶的数目，将这张『独醒于昏明』与下述的牌进行交换，并置于你的牌库底。\n小于等于5……『循迹访清荧』\n大于等于6……『彷徨徒视影』',
      textjp: '相オーラ→自オーラ：1\n開花―ダストに応じてこの「ひとり目覚めて」を以下のカードと交換し、それを山札の底に置く。\n5以下…「標をたどり」\n6以上…「影面見向き」'
    }],
    changeExtra: [{
      id: '14-honoka-a1-n-1-ex1',
      extraFrom: '14-honoka-a1-n-1',
      name: '影之两手',
      namejp: '影の両手',
      baseType: 'normal',
      types: ['attack'],
      range: '3-4',
      damage: '1/0',
      text: '【攻击后】若对手选择由装承受此次伤害，则检视对手的手牌，从中选择1张弃置。若对手选择由命承受此次伤害，则敌气（2）→虚\n【攻击后】将这张『影之两手』与追加牌区中的『樱之双剑』交换。若如此做，则你可以将『樱之双剑』置于你的牌库底。',
      textjp: '【攻撃後】相手がオーラへのダメージを選んだならば、相手の手札を見てその中から1枚を選び、それを捨て札にする。相手がライフへのダメージを選んだならば、相フレア→ダスト：2\n【攻撃後】この「影の両手」を追加札の「桜の双剣」と交換する。そうした場合、その「桜の双剣」を山札の底に置いてもよい。'
    }, {
      id: '14-honoka-a1-s-1-ex1',
      extraFrom: '14-honoka-a1-s-1',
      name: '循迹访清荧',
      namejp: '標をたどり',
      baseType: 'normal',
      types: ['action'],
      text: '执行至多2次各不相同的基本动作。\n开花～根据虚中的樱花结晶的数目，将这张『循迹访清荧』与下述的牌进行交换，并将其变为未使用状态。\n0……『熠熠见繁樱』\n大于等于1……『觫觫结袂情』',
      textjp: '異なる基本動作を合計2回まで行う。\n開花―ダストに応じてこの「標をたどり」を以下のカードと交換し、それを未使用に戻す。\n0………「桜花眩く輝かん」\n1以上…「ふたり震える手を取ろう」'
    }, {
      id: '14-honoka-a1-s-1-ex2',
      extraFrom: '14-honoka-a1-s-1',
      name: '彷徨徒视影',
      namejp: '影面見向き',
      baseType: 'normal',
      types: ['action'],
      text: '对手从其气或命中选择1个樱花结晶移至虚。\n开花～根据虚中的樱花结晶的数目，将这张『彷徨徒视影』与下述的牌进行交换，并将其变为未使用状态。\n大于等于12……『踽踽虚路行』\n小于等于11……『觫觫结袂情』',
      textjp: '相手は相手のフレア、ライフのいずれかから桜花結晶を1つダストへ移動させる。\n開花―ダストに応じてこの「影面見向き」を以下のカードと交換し、それを未使用に戻す。\n12以上…「旧き虚路を歩みゆく」\n11以下…「ふたり震える手を取ろう」'
    }, {
      id: '14-honoka-a1-s-1-ex3',
      extraFrom: '14-honoka-a1-s-1-ex1',
      name: '熠熠见繁樱',
      namejp: '桜花眩く輝かん',
      baseType: 'special',
      types: ['attack'],
      range: '3-5',
      damage: 'X/2',
      cost: '1',
      text: '超克\n【常时】X等于此牌上的樱花结晶的数目。\n【攻击后】将1个樱花结晶从虚移至此牌上。\n----\n【再起】至少1个区域中的樱花结晶的数目恰等于5。',
      textjp: '超克\n【常時】Xはこのカードの上の桜花結晶の数に等しい。\n【攻撃後】このカードの上にダストから1つ桜花結晶を置く。\n----\n【再起】桜花結晶がちょうど5つある領域が1つ以上ある。'
    }, {
      id: '14-honoka-a1-s-1-ex4',
      extraFrom: '14-honoka-a1-s-1-ex2',
      name: '觫觫结袂情',
      namejp: 'ふたり震える手を取ろう',
      baseType: 'special',
      types: ['action'],
      cost: '5',
      text: '敌装（5）→自装',
      textjp: '相オーラ→自オーラ：5'
    }, {
      id: '14-honoka-a1-s-1-ex5',
      extraFrom: '14-honoka-a1-s-1-ex2',
      name: '踽踽虚路行',
      namejp: '旧き虚路を歩みゆく',
      baseType: 'special',
      types: ['action'],
      cost: '3',
      text: '对手失去下一个主要阶段。然后将此牌移出游戏。',
      textjp: '相手は次のメインフェイズを失う。\nこのカードを取り除く。'
    }]
  }
  ]
},
{
  name: 'KORUNU 凝努',
  namejp: 'コルヌ',
  namekr: '코르누',
  nameen: 'KORUNU',
  desc: '冻结～冻结是将一个冻结指示物置于敌装中，填充敌装中的空位。被冻结时，基本动作《聚气》的效果改为「移除一个冻结指示物」。',
  descjp: '凍結～凍結させ、凍結トークンをオーラに置いてオーラの空きを埋められる。凍結している限り、基本動作《宿し》は「凍結トークンを1つ取り除く」に変化する。',
  // girlInfo: '身高：165cm\n喜欢的东西：役割を全うすること、見どころのある者、氷上舞踏\n<b>--物語--</b>\n「貴様の器を見定めてやろう」\nこの地の北限は玄関口である御冬の里を最後に、人の住まわぬ地とされています。旧い時代よりその地の番人としての役割を担ってきたのが彼女、氷雪を象徴するメガミ・コルヌです。\n彼女の気質を述べるならば、第一には堅物の仕事主義者です。彼女は己の役割に信念を持ち、それを順守することを何よりも優先します。自分にも他人にも厳しく、信念の共有を求めます。第二にはドＳで、相手の苦闘を楽しんでいる節があります。しかし苦難を乗り越えた者は心から認め、優しさも見せるようです。',
  // girlInfojp: '身長：165cm\n好きなもの：役割を全うすること、見どころのある者、氷上舞踏\n<b>--物語--</b>\n「貴様の器を見定めてやろう」\nこの地の北限は玄関口である御冬の里を最後に、人の住まわぬ地とされています。旧い時代よりその地の番人としての役割を担ってきたのが彼女、氷雪を象徴するメガミ・コルヌです。\n彼女の気質を述べるならば、第一には堅物の仕事主義者です。彼女は己の役割に信念を持ち、それを順守することを何よりも優先します。自分にも他人にも厳しく、信念の共有を求めます。第二にはドＳで、相手の苦闘を楽しんでいる節があります。しかし苦難を乗り越えた者は心から認め、優しさも見せるようです。',
  list: [{
    name: '橇',
    namejp: '橇',
    namekr: '썰매',
    nameen: 'SKATE BLADE',
    isSelect: false,
    pic: 'twiicon_sa_22.jpg',
    picq: 'sd_korunu.png',
    normal: [{
      id: '15-korunu-o-n-1',
      name: '雪刃',
      namejp: '雪刃',
      namekr: '눈 칼날',
      baseType: 'normal',
      types: ['attack'],
      range: '3-4',
      damage: '1/1',
      text: '【攻击后】冻结对手1次。',
      textjp: '【攻撃後】相手は1回凍結する。',
      textkr: '【공격후】상대를 동결시킨다.'
    },
    {
      id: '15-korunu-o-n-2',
      name: '旋回刃',
      namejp: '旋回刃',
      namekr: '선회날',
      baseType: 'normal',
      types: ['attack'],
      range: '2-3',
      damage: '2/2',
      text: '【常时】若此《攻击》被对手对应，则每张对应此《攻击》的牌结算完毕后虚（2）⇔距',
      textjp: '【常時】この《攻撃》が対応されたならば、対応したカードの解決後に間合⇔ダスト:2',
      textkr: '【상시】이 카드에 대응을 했다면 대응을 해결한 뒤에, \n\n간격⇔더스트:2'
    },
    {
      id: '15-korunu-o-n-3',
      name: '剑舞',
      namejp: '剣の舞',
      namekr: '칼춤',
      baseType: 'normal',
      types: ['attack'],
      range: '4-5',
      damage: '2/1',
      text: '【常时】若敌装中没有空位，则此《攻击》获得+1/+1。',
      textjp: '【常時】相手のオーラに空きがないならば、この《攻撃》は+1/+1となる。',
      textkr: '【상시】상대의 오라가 꽉 차있다면, 이 《공격》은 +1/+1된다.'
    },
    {
      id: '15-korunu-o-n-4',
      name: '渡雪',
      namejp: '雪渡り',
      namekr: '눈 타기',
      baseType: 'normal',
      types: ['action'],
      text: '距（1）⇔虚\n若敌装中没有空位，则你可以选择虚（1）→距',
      textjp: '間合⇔ダスト:1\n相手のオーラの空きがないならば、ダスト→間合：1を行ってもよい',
      textkr: '간격⇔더스트:1\n\n상대의 오라가 꽉 차있다면,\n더스트→간격:1\n을 해도 좋다.'
    },
    {
      id: '15-korunu-o-n-5',
      name: '绝对零度',
      namejp: '絶対零度',
      namekr: '절대영도',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '全力化：进行一次“攻击距离2-5 伤害1/2”的攻击。冻结对手，直至敌装中没有空位为止。\n执行1次基本动作《装附》。若敌装中有至少3个冻结指示物，则再执行1次基本动作《装附》。',
      textjp: '全力化:攻撃『適正距離2-5、1/2』を行い、相手はオーラの空きがなくなるまで凍結する。\n基本動作《纏い》を1回行う。相手が3つ以上凍結しているならばさらにもう1回行う。'
    },
    {
      id: '15-korunu-o-n-6',
      name: '冻僵',
      namejp: 'かじかみ',
      namekr: '동상',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '2',
      text: '【展开时】冻结对手1次。\n【展开中】对手不能执行基本动作《聚气》。',
      textjp: '【展開時】相手は1回凍結する。\n【展開中】相手は基本動作《宿し》を行えない。',
      textkr: '【전개시】상대를 동결시킨다.\n【전개중】상대는 기본 동작 《품기》를 할 수 없다.'
    },
    {
      id: '15-korunu-o-n-7',
      name: '霜之棘',
      namejp: '霜の茨',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '2',
      text: '【展开中】你的回合内，每当你进行第一次非王牌的《攻击》时，该《攻击》获得+1/+1。\n【展开中】若对手被冻结，则你的准备阶段从所有《付与》牌上移除樱花结晶时可以不移除此牌上的樱花结晶。',
      textjp: '【展開中】あなたのターンにおけるあなたの最初の切札でない《攻撃》は+1/+1となる。\n【展開中】相手が凍結しているならば、\nあなたの開始フェイズの処理でこのカードの上の桜花結晶を移動させなくてもよい。'
    }],
    special: [{
      id: '15-korunu-o-s-1',
      name: '凛冽冰雨',
      namejp: 'コンルルヤンペ',
      namekr: '콘루 루얀페',
      baseType: 'special',
      types: ['attack'],
      range: '2-3',
      damage: '2/3',
      cost: '4',
      text: '【攻击后】若对手选择由装承受此次伤害，则冻结对手，直至敌装中没有空位为止。',
      textjp: '【攻撃後】相手がオーラへのダメージを選んだならば、相手はオーラの空きがなくなるまで凍結する。',
      textkr: '【공격후】상대가 오라 데미지를 선택했다면 상대의 오라가 꽉 찰때까지 동결시킨다.'
    },
    {
      id: '15-korunu-o-s-2',
      name: '刺骨霜风',
      namejp: 'レタルレラ',
      namekr: '레타르 레라',
      baseType: 'special',
      types: ['action', 'reaction'],
      cost: '2',
      text: '若敌装中没有空位，则打消被对应的《攻击》。否则距（1）→敌装',
      textjp: '相手のオーラに空きがないならば、対応した《攻撃》を打ち消す。そうでなければ、間合→相オーラ：1',
      textkr: '상대의 오라가 꽉 차있다면 대응한 공격을 무효한다. 그렇지 않다면,\n간격→상대 오라:1'
    },
    {
      id: '15-korunu-o-s-3',
      name: '纷飞寒雪',
      namejp: 'ウパシトゥム',
      namekr: '우파스툼',
      baseType: 'special',
      types: ['attack'],
      range: '3-6',
      damage: '0/-',
      cost: '0',
      text: '【攻击后】冻结对手1次。\n（即使因此效果使敌装变为没有空位的状态，此牌也会因为仍在使用中而不会变为未使用状态。）----\n【即再起】敌装从有空位的状态变为没有空位的状态。',
      textjp: '【攻撃後】相手は1回凍結する。(この効果でオーラの空きがなくなっても、まだ使用中なので未使用には戻らない)----\n【即再起】相手のオーラが空いた状態から空きがなくなる。',
      textkr: '【공격후】상대를 동결시킨다. (이 카드는 아직 사용중이기 때문에 오라가 꽉 차도 즉재기되지 않는다)\n----\n즉재기:상대의 오라가 꽉 찬다.'
    },
    {
      id: '15-korunu-o-s-4',
      name: '彼世深渊',
      namejp: 'ポルチャルトー',
      namekr: '폴챠르트',
      baseType: 'special',
      types: ['enhance'],
      capacity: '1',
      cost: '2',
      text: '【常时】此牌可以如《对应》牌一样对应《攻击》使用。若以此法使用，则此牌的费用视为4。\n【展开时】距（1） ⇔ 虚\n冻结对手1次。\n【破弃时】你可以再次使用此牌。若以此法使用，则此牌的纳视为4。（仍需支付费用）',
      textjp: '【常時】このカードを消費４で対応を持つかのように相手の《攻撃》に割り込んで使用してもよい。\n【展開時】間合⇔ダスト：1\n相手は１回凍結する。\n【破棄時】このカードを納４として使用してもよい。（消費は支払う）'
    }]
  }]
},
{
  name: 'YATSUHA 八叶',
  namejp: 'ヤツハ',
  namekr: '야츠하',
  nameen: 'YATSUHA',
  desc: '镜映～镜映数等于你的装，气，命和对手对应区域中的樱花结晶相同的区域数目。',
  descjp: '鏡映～あなたと相手のオーラ、フレア、ライフで値が一致している個数が鏡映数となる。',
  // girlInfo: '身高：157cm\n喜欢的东西：お買い物、小物集め、旅\n<b>--物語--</b>\n「私は誰なのか。それを探すのを、手伝ってくれますか？」\n北限で目覚めた正体不明のメガミ、それがヤツハです。自らの名前を除いて記憶がなく、その権能も定かではありません。しかし北限での騒乱で垣間見えた力は暴虐的で恐ろしいものでした。\n今は自らを知るためにクルルやハツミと行動を共にしています。桜降る代の各地を巡る旅を通してこの世界を知り、自らのいるべき場所を探し続けています。知識こそないものの頭は良いようですが、ちょっと感性のピントはずれているようにも見えます。彼女が未知の果てに何を見出すのか。それはまだ、これからのお話。',
  // girlInfojp: '身長：157cm\n好きなもの：お買い物、小物集め、旅\n<b>--物語--</b>\n「私は誰なのか。それを探すのを、手伝ってくれますか？」\n北限で目覚めた正体不明のメガミ、それがヤツハです。自らの名前を除いて記憶がなく、その権能も定かではありません。しかし北限での騒乱で垣間見えた力は暴虐的で恐ろしいものでした。\n今は自らを知るためにクルルやハツミと行動を共にしています。桜降る代の各地を巡る旅を通してこの世界を知り、自らのいるべき場所を探し続けています。知識こそないものの頭は良いようですが、ちょっと感性のピントはずれているようにも見えます。彼女が未知の果てに何を見出すのか。それはまだ、これからのお話。',
  list: [{
    name: '镜',
    namejp: '鏡',
    namekr: '거울',
    nameen: 'MIRROR',
    isSelect: false,
    pic: 'twiicon_sa_23.jpg',
    picq: 'sd_yatsuha.png',
    normal: [{
      id: '16-yatsuha-o-n-1',
      name: '星之爪',
      namejp: '星の爪',
      namekr: '별의 손톱',
      baseType: 'normal',
      types: ['attack'],
      range: '3-4',
      damage: '3/2',
      text: '不可被对应（通常牌）\n【攻击后】自装（1）→敌气',
      textjp: '対応不可（通常札）\n【攻撃後】自オーラ→相フレア：1',
      textkr: '대응불가(통상패)\n【공격후】자신 오라→상대 플레어：1'
    },
    {
      id: '16-yatsuha-o-n-2',
      name: '暗之颚',
      namejp: '昏い咢',
      namekr: '황혼의 칼날',
      baseType: 'normal',
      types: ['attack'],
      range: '4',
      damage: '3/1',
      text: '不可被对应（通常牌）\n【常时】此《攻击》获得+0/+X。X等于镜映数。\n【攻击后】你畏缩。',
      textjp: '対応不可（通常札）\n【常時】この《攻撃》は+0/+Xとなる。Xは鏡映数に等しい。\n【攻撃後】あなたは畏縮する。',
      textkr: '대응불가(통상패)\n【상시】이 《공격》은 +0/+X된다. X는 거울 수에 해당된다.\n【공격후】당신은 위축된다.'
    },
    {
      id: '16-yatsuha-o-n-3',
      name: '镜之恶魔',
      namejp: '鏡の悪魔',
      namekr: '거울의 악마',
      baseType: 'normal',
      types: ['attack', 'fullpower'],
      range: '2-3',
      damage: '5/3',
      text: '【攻击后】自命（1）→虚',
      textjp: '【攻撃後】自ライフ→ダスト：1',
      textkr: '【공격후】자신 라이프→더스트：1'
    },
    {
      id: '16-yatsuha-o-n-4',
      name: '幻影步法',
      namejp: '幻影歩法',
      namekr: '환영보법',
      baseType: 'normal',
      types: ['action'],
      text: '获得1点集中力。选择1项：\n1.本回合内，当前距离增大1，达人距离增大1；\n2.本回合内，当前距离减小1，达人距离减小1。',
      textjp: 'あなたは集中力を1得る。以下から1つを選ぶ。\n・このターン中、現在の間合は1増加し、達人の間合は1大きくなる。\n・このターン中、現在の間合は1減少し、達人の間合は1小きくなる。\n',
      textkr: '당신은 집중력을 1얻는다.\n아래에서 1개를 고른다.\n・이 턴 동안 현재의 간격은 1증가하고 달인의 간격은 1늘어난다.\n・이 턴 동안 현재의 간격은 1감소하고 달인의 간격은 1줄어든다.'
    },
    {
      id: '16-yatsuha-o-n-5',
      name: '意志',
      namejp: '意志',
      namekr: '의지',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '选择一项或都选：\n1.自装（1）⇔自气\n2.敌装（1）⇔敌气',
      textjp: '以下のどちらかまたは両方を行う。\n・自オーラ⇔自フレア：1\n・相オーラ⇔相フレア：1',
      textkr: '아래에서 하나 또는 양쪽을 실행한다.\n・자신 오라⇔자신 플레어：1\n・상대 오라⇔상대 플레어：1'
    },
    {
      id: '16-yatsuha-o-n-6',
      name: '契约',
      namejp: '契約',
      namekr: '계약',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '敌气（1）→自装\n下一个结束阶段开始时，若敌气中的樱花结晶的数目小于等于自气，则自装（1）→敌气',
      textjp: '相フレア→自オーラ：1\n次の終了フェイズに相手のフレアがあなたのフレア以下ならば、\n自オーラ→相フレア：1',
      textkr: '상대 플레어→자신 오라：1\n다음 종료 페이즈에 상대의 플레어가 당신의 플레어 이하라면,\n자신 오라→상대 플레어：1'
    },
    {
      id: '16-yatsuha-o-n-7',
      name: '寄花',
      namejp: '寄花',
      namekr: '기묘한 꽃',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '3',
      text: '破绽\n【常时】此牌的纳减小X，X等于镜映数。\n【破弃时】进行一次“攻击距离1-4 伤害0/0 【攻击后】敌装（2）→自装”的攻击。',
      textjp: '隙\n【常時】このカードの納は鏡映数だけ小さくなる。\n【破棄時】攻撃『適正距離1-4、0/0、【攻撃後】相オーラ→自オーラ：2』を行う。',
      textkr: '틈\n【상시】이 카드의 납은 거울 수만큼 줄어든다.\n【파기시】공격 『적정거리1-4, 0/0, 【공격후】상대 오라→자신 오라：2』를 한다.'
    }],
    special: [{
      id: '16-yatsuha-o-s-1',
      name: '双叶镜的祟神',
      namejp: '双葉鏡の祟り神',
      namekr: '쌍잎 거울의 재앙신',
      baseType: 'special',
      types: ['action', 'reaction'],
      cost: '4',
      text: '若自命中的樱花结晶的数目小于敌命，则进行一次《攻击》，该《攻击》为被对应的《攻击》的复制，且视为该《攻击》也对应了原《攻击》。\n（复制的《攻击》的攻击距离、伤害、【攻击后】效果、有无超克、使用女神均与被复制的攻击相同。攻击距离与伤害使用由其他所有效果修正后的值）\n打消被对应的非王牌的《攻击》。',
      textjp: 'あなたのライフが相手のライフよりも小さいならば、対応した《攻撃》複製である《攻撃》を行う。その《攻撃》は対応した《攻撃》に対応しているものとして扱う。（複製とは適正距離、ダメージ、【攻撃後】効果、超克の有無、使用メガミが同一の攻撃である。適正距離やダメージは全ての効果を適用した後のものを用いる）\n対応した切札でない《攻撃》を打ち消す。',
      textkr: '당신의 라이프가 상대의 라이프보다 적다면 대응한 《공격》의 복제에 해당되는 《공격》을 한다. 그 《공격》은 대응한 《공격》에 대응한 것으로 취급한다. (복제란 적정거리, 데미지, 【공격후】 효과, 초극의 유무, 사용 여신의 동일한 공격이다. 적정거리나 데미지는 모든 효과를 적용한 후의 것을 사용한다)\n대응한 비장패가 아닌 《공격》을 무효로 한다.'
    },
    {
      id: '16-yatsuha-o-s-2',
      name: '四叶镜的童谣',
      namejp: '四葉鏡のわらべ唄',
      namekr: '네잎 거울의 전래동요',
      baseType: 'special',
      types: ['action'],
      cost: '2',
      text: '选择1张展开中的非王牌的《付与》牌，将其上所有樱花结晶移至虚。\n若该《付与》牌因此置入弃牌区，则你可以使用该牌。若如此做，且该牌具有《全力》副类别，则此牌额外获得终端。',
      textjp: '切札でない付与札を1つ選び、その上から桜花結晶全てをダストに送る。\nその《付与》カードがいずれかの捨て札にあるならば、そのカードを消費を支払わずに使用してもよい。そうした場合、そのカードが《全力》ならばこのカードは終端を得る。'
    },
    {
      id: '16-yatsuha-o-s-3',
      name: '六叶镜的星海',
      namejp: '六葉鏡の星の海',
      namekr: '여섯잎 거울의 별바다',
      baseType: 'special',
      types: ['attack'],
      range: '3-7',
      damage: '3/1',
      cost: '5',
      text: '超克 不可被对应（通常牌）\n【常时】此《攻击》获得+X/+X。X等于镜映数。',
      textjp: '超克　対応不可（通常札） \n【常時】この《攻撃》は＋X/+Xとなる。Xは鏡映数に等しい。',
      textkr: '초극　대응불가（통상패） \n【상시】이 《공격》은+X/+X된다. X는 거울 수에 해당된다.'
    },
    {
      id: '16-yatsuha-o-s-4',
      name: '八叶镜的映界',
      namejp: '八葉鏡の向こう側',
      namekr: '여덟잎 거울의 저편',
      baseType: 'special',
      types: ['enhance'],
      capacity: '5',
      cost: '2',
      text: '终端\n【展开中】你的牌的效果中的箭头（→）变为双箭头（⇔）。\n【破弃时】将此牌移出游戏。',
      textjp: '終端\n【展開中】あなたのカードの矢印(→)は両矢印(⇔)になる。\n【破棄時】このカードを取り除く。',
      textkr: '종단\n【전개중】당신의 카드의 화살표(→)는 양쪽 화살표(⇔)가 된다.\n【파기시】이 카드를 제외한다.'
    }]
  }, {
    name: '花',
    namejp: '花',
    isSelect: false,
    pic: 'twiicon_sa_41.jpg',
    picq: 'sd_yatsuha_a1.png',
    changenormal: [],
    changespecial: [{
      changeIndex: '4',
      id: '16-yatsuha-a1-s-4',
      name: '八叶镜的徒樱',
      namejp: '八葉鏡の徒桜',
      baseType: 'special',
      cost: 1,
      types: ['attack'],
      range: '0-8',
      damage: '1/0',
      text: '终端 不可被对应\n【攻击后/使用后】攻击后或每当你将要重铸牌库时，你可以从弃牌或手牌中选择1张八叶的牌，展示该牌，然后将其变为完全态。\n（例如，若你展示了手牌中的『星之爪』，则将其与追加牌区中的『星尘之利爪』交换，并加入手牌。）',
      textjp: '終端 対応不可\n【攻撃後/使用済】攻撃後とあなたが山札を再構成する直前に、あなたの捨て札または手札にあるヤツハのカード1枚を公開し、完全態にしてもよい。\n（例えば手札の「星の爪」を公開したならば追加札の「星辰の鈎爪」と交換され、手札に加わる。）'
    }],
    changeExtra: [{
      id: '16-yatsuha-a1-n-1-ex1',
      extraFrom: '16-yatsuha-o-n-1',
      name: '星辰之利爪',
      namejp: '星辰の鉤爪',
      baseType: 'normal',
      types: ['attack'],
      range: '3-4',
      damage: '2/1',
      text: '【攻击后】敌气（1）→自装',
      textjp: '【攻撃後】相フレア→自オーラ：1。'
    }, {
      id: '16-yatsuha-a1-n-2-ex1',
      extraFrom: '16-yatsuha-o-n-2',
      name: '深渊之巨吻',
      namejp: '深淵の大口',
      baseType: 'normal',
      types: ['attack'],
      range: '4-5',
      damage: '2/1',
      text: '不可被对应\n【常时】此攻击得+X/+X，X等于镜映数。',
      textjp: '対応不可\n【常時】この《攻撃》は+Ｘ/+Ｘとなる。Ｘは鏡映数に等しい。'
    }, {
      id: '16-yatsuha-a1-n-3-ex1',
      extraFrom: '16-yatsuha-o-n-3',
      name: '现世之魔物',
      namejp: '本当の怪物',
      baseType: 'normal',
      types: ['attack', 'fullpower'],
      range: '1-3',
      damage: '4/1',
      text: '【攻击后】若对手选择由命承受此《攻击》的伤害，则\n敌命（1）→自命',
      textjp: '【攻撃後】相手がライフへのダメージを選んだならば、\n相ライフ→自ライフ：1。'
    }, {
      id: '16-yatsuha-a1-n-4-ex1',
      extraFrom: '16-yatsuha-o-n-4',
      name: '幻影联动',
      namejp: '幻影連携',
      baseType: 'normal',
      types: ['action'],
      text: '选择1项：\n1.本回合内，当前距离增大1，达人距离增大1；\n2.本回合内，当前距离减小1，达人距离减小1。\n然后进行一次“攻击距离3-5 伤害2/1”的攻击。',
      textjp: '以下から1つを選ぶ。\n・このターン中、現在の間合は1増加し、達人の間合は1大きくなる。\n・このターン中、現在の間合は1減少し、達人の間合は1小さくなる。\nその後、攻撃『適正距離3-5、2/1』を行う。'
    }, {
      id: '16-yatsuha-a1-n-5-ex1',
      extraFrom: '16-yatsuha-o-n-5',
      name: '决意',
      namejp: '決意',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '选择一项或都选：\n1.自装（1）⇔自气\n2.若被对应的《攻击》非王牌且对装伤害小于等于X，则打消被对应的《攻击》。X等于镜映数加1。',
      textjp: '以下のどちらかまたは両方を行う。\n・自オーラ↔自フレア：1\n・対応した切札でない《攻撃》のオーラへのダメージがX以下ならば、その《攻撃》を打ち消す。Xは鏡映数に1を足した値に等しい。'
    }, {
      id: '16-yatsuha-a1-n-6-ex1',
      extraFrom: '16-yatsuha-o-n-6',
      name: '盟约',
      namejp: '盟約',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '选择1项：\n1.敌装（1）⇔自气\n2.敌气（1）⇔自装',
      textjp: '以下から1つを選ぶ。\n・相オーラ↔自フレア：1。\n・相フレア↔自オーラ：1。'
    }, {
      id: '16-yatsuha-a1-n-7-ex1',
      extraFrom: '16-yatsuha-o-n-7',
      name: '徒寄花',
      namejp: '徒寄花',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '3',
      text: '【破弃时】根据你的八叶的牌变为完全态的次数结算以下效果。\n小于等于3……你可以从弃牌或手牌中选择1张八叶的牌，展示该牌，然后将其变为完全态。\n大于等于4……将此牌置于牌库底，敌命（2）→游戏外',
      textjp: '【破棄時】完全態にした枚数に応じて以下を行う。\n3以下…あなたの捨て札または手札にあるヤツハのカード1枚を公開し、完全態にしてもよい。\n4以上…このカードを山札の底に置き、相ライフ→ゲーム外:2。'
    }]
  },
  {
    name: '魂',
    namejp: '魂',
    isSelect: false,
    pic: 'twiicon_sa_45.jpg',
    picq: 'sd_yatsuha_aa1.png',
    changenormal: [
      {
        changeIndex: '7',
        id: '16-yatsuha-aa1-n-7',
        baseType: 'normal',
        types: ['enhance'],
        capacity: '1',
        namejp: '見知らぬ世界',
        name: '万叶仍未识',
        textjp: '【常時】このカードがあなたがこのゲームで初めて使用するカードならば、使用するに際し、ゲーム外から桜花結晶を納めてもよい。\n【破棄時】あなたは基本動作《前進》を2回行う。その後、このカードを取り除き。追加札から「色づく世界」を未使用で得る。',
        text: '【常时】若此牌是你本局游戏中使用的第一张牌，则你可以选择游戏外的樱花结晶作为此牌的纳。\n【破弃时】进行2次基本动作《前进》。然后将此牌移出游戏，将『千芳犹增色』从追加牌区以未使用状态加入王牌。'
      }
    ],
    changespecial: [
      {
        changeIndex: '4',
        id: '16-yatsuha-aa1-s-4',
        baseType: 'special',
        types: ['action'],
        cost: '4',
        namejp: '彼女にとっての自我と決意',
        name: '此心所念之神与魂',
        textjp: '捨て札、伏せ札、手札のいずれかからヤツハのカードを1枚公開し、そのカードを完全態にしてもよい。その後、そのカードを山札の上に置いてもよい。\n【使用済】あなたはある《攻撃》に対応を行う代わりにこのカードを取り除き、手札から他のメガミのカード1枚を捨て札にしてもよい。そうした場合、その《攻撃》を打ち消す。\n（対応不可を持つ《攻撃》にも行える）',
        text: '你可以从弃牌、盖牌或手牌中选择1张八叶的牌。展示该牌，然后将其变为完全态。你可以将该牌置于牌库顶。\n【使用后】每当结算对你进行的《攻击》时，你可以选择不使用牌来对应该《攻击》，而改为将此牌移出游戏，并从手牌中弃置1张其他女神的牌。若如此做，则打消被对应的《攻击》。\n（对于具不可被对应关键字的《攻击》也可以如此做，但对于对应使用的《攻击》牌生成的攻击不能如此做）'
      }
    ],
    girlBoard: [
      {
        id: '16-yatsuha-aa1-t-1',
        namejp: '【桜降る代の旅路】',
        name: '【散樱代的旅途】',
        textjp: '桜降る代の旅路に出発するならば、旅路の面を表として、任意の辺を下に向けて用意する。これによりしたに向けた箇所が始点となる。その後、ダストから桜花結晶1つを始点に置く。\n----家路----\n手札からカードを1枚まで選ぶ。選ばれたカード以外のあなたの通常札全てを思い出に仕舞い、この上の桜花結晶をダストに送り、追加札から「彼女にとっての桜降る代」を未使用で得る。\n----旅路----\n・カードを1枚引く。\n・あなたは集中力を1得る。\n・あなたか相手の付与札を1つ選ぶ。その付与札から桜花結晶を1つダストに送るか、その付与札に桜花結晶をダストから1つ置く。\n・捨て札か伏せ札からカードを1枚選ぶ。それを山札の底に置く。',
        text: '开始散樱代的旅途时，将此牌翻为旅途面朝上，并旋转至任意一边向下。向下的一边上所述的地点变为出发地。然后将1个樱花结晶从虚移至出发地。\n----归途----\n选择至多1张手牌。将你的牌库、手牌、弃牌、盖牌与付与区中除所选择的牌以外的所有通常牌背面朝上置入回忆区（不结算《付与》牌的破弃时效果，仅你可以检视这些牌），将此牌上的樱花结晶移至虚，将『此目所及之散樱代』从追加牌区以未使用状态加入王牌。\n----旅途----\n1.抓1张牌\n2.获得1点集中力\n3.选择你或对手的1张展开中的《付与》牌。将该牌上1个樱花结晶移至虚，或将1个樱花结晶从虚移至该牌上。\n4.从弃牌或盖牌中选择1张牌，将其置于牌库底。'
      }
    ],
    changeExtra: [
      {
        id: '16-yatsuha-aa1-n-7-ex1',
        extraFrom: '16-yatsuha-aa1-n-7',
        baseType: 'special',
        types: ['action'],
        cost: '2',
        namejp: '色づく世界',
        name: '千芳犹增色',
        textjp: '桜降る代の旅路に任意の始点から出発する。\n【使用済】各ターンの開始フェイズの開始時に所在地の効果を解決し、桜花結晶を次の位置へと時計回りに動かす。始点の効果を2回目に解決するならば、代わりに家路の効果を解決する。',
        text: '从任意起点出发，开始散樱代的旅途。（仅寄宿了自我八叶的玩家可以开始旅途，每局游戏中每名玩家仅能开始旅途一次）\n【使用后】每回合的准备阶段开始时，结算所在地的效果，然后将樱花结晶沿顺时针方向移至下一个地点。当将要第2次结算出发地的效果时，不结算出发地的效果，而改为结算归途的效果。'
      },
      {
        id: '16-yatsuha-aa1-n-7-ex2',
        extraFrom: '16-yatsuha-aa1-n-7-ex1',
        baseType: 'special',
        cost: '0',
        types: ['action'],
        namejp: '彼女にとっての桜降る代',
        name: '此目所及之散樱代',
        textjp: '思い出からカードを1枚選び、それを手札に戻す。\n【使用済】あなたがカードを引くならば、代わりに思い出のカードを選んで手札に戻してよい。\n【使用済】あなたが山札の再構成によりダメージを受けるならば、代わりに思い出のカードを1枚選んで公開し、それを取り除いてもよい。\n（思い出から戻るカードは公開し完全態とできる）',
        text: '从回忆区中选择1张牌置入手牌。\n【使用后】每当你将要抓牌时，你可以选择不抓牌，而改为从回忆区中选择等量的牌置入手牌。\n【使用后】每当你将要因重铸牌库受到命伤时，你可以选择不受到此次命伤，而改为从回忆区中选择并展示1张牌，然后将该牌移出游戏。\n（若八叶的未变为完全态的牌将从回忆区置入手牌，则你可以选择将该牌变为完全态后置入手牌）'
      }
    ]
  }
  ]
},
{
  name: 'HATSUMI 初海',
  namejp: 'ハツミ',
  namekr: '하츠미',
  nameen: 'HATSUMI',
  desc: '航海～若上一回合内对手没有进行过《攻击》，则本回合内你处于顺风状态，否则处于逆风状态。',
  descjp: '航海～直前のターンに相手に攻撃されていないならば順風に、されているならば逆風になる。',
  // girlInfo: '身高：151cm\n喜欢的东西：波間を漂うこと、海獣たち、日記や散文を書くこと\n<b>--物語--</b>\n「あの……鍛錬に励むってのはほら、自らの道とかそんな感じの意味で……」\n海を象徴する偉大なメガミです。広い桜降る代に数多く存在するメガミの中でも、彼女ほど信頼され、深い敬意を払われている者はいないかもしれません。海のように広い心ゆえに人々に優しく、それでいて自然の偉大さを教えるような厳しさも持ち合わせています。彼女は人々に苦難を乗り越えるだけの屈強な肉体を求めており、ゆえに彼女を信じる者たちはそれに見合った肉体を備えています。\n以上が桜降る代で一般的に認知されているハツミの姿です。はてさて、実際はどうなのでしょうか。いつの日か、本当の彼女を理解してくれる方が現れるといいですね。',
  // girlInfojp: '身長：151cm\n好きなもの：波間を漂うこと、海獣たち、日記や散文を書くこと\n<b>--物語--</b>\n「あの……鍛錬に励むってのはほら、自らの道とかそんな感じの意味で……」\n海を象徴する偉大なメガミです。広い桜降る代に数多く存在するメガミの中でも、彼女ほど信頼され、深い敬意を払われている者はいないかもしれません。海のように広い心ゆえに人々に優しく、それでいて自然の偉大さを教えるような厳しさも持ち合わせています。彼女は人々に苦難を乗り越えるだけの屈強な肉体を求めており、ゆえに彼女を信じる者たちはそれに見合った肉体を備えています。\n以上が桜降る代で一般的に認知されているハツミの姿です。はてさて、実際はどうなのでしょうか。いつの日か、本当の彼女を理解してくれる方が現れるといいですね。',
  list: [{
    name: '桨',
    namejp: '櫂',
    namekr: '노',
    nameen: 'QUANT',
    isSelect: false,
    pic: 'twiicon_sa_27.jpg',
    picq: 'sd_hatsumi.png',
    normal: [{
      id: '17-hatsumi-o-n-1',
      namejp: '水雷球',
      name: '水雷球',
      namekr: '수뢰구',
      baseType: 'normal',
      types: ['attack'],
      range: '3-5',
      damage: '0/0',
      text: '【常时】若你处于顺风状态，则此《攻击》获得+2/+2。\n【攻击后】若你处于逆风状态，则距（2） ⇔ 虚',
      textjp: '【常時】順風ならば、この《攻撃》は+2/+2となる。\n【攻撃後】逆風ならば、間合⇔ダスト：2',
      textkr: '【상시】순풍이라면, 이 《공격》은 +2/+2된다.\n【공격후】역풍이라면, 간격⇔더스트：2 '
    },
    {
      id: '17-hatsumi-o-n-2',
      namejp: '水流',
      name: '水流',
      namekr: '수류',
      baseType: 'normal',
      types: ['attack'],
      range: '4-5',
      damage: '2/1',
      text: '【常时】若你处于顺风状态，则此《攻击》获得+1/+1。\n全力化（主要阶段，若你选择执行全力行动，则你可以如使用《全力》牌一样使用此牌。若如此做，则此牌额外获得以下效果）：【常时】此《攻击》获得不可被对应（通常牌），若此《攻击》对对手造成了伤害，则不将因结算伤害移动的樱花结晶移至气或虚，而改为移至距。',
      textjp: '【常時】順風ならば、この《攻撃》は+1/+1となる。\n全力化：【常時】この《攻撃》は対応不可（通常札）を得るとともに、そのダメージにより移動する桜花結晶はダストやフレアでなく間合に動かす。',
      textkr: '【상시】순풍이라면, 이 《공격》은 +1/+1된다.\n전력화：【상시】이 《공격》은 대응불가(통상패)를 얻고, 이 데미지에 의해서 이동하는 벚꽃 결정은 더스트나 플레어가 아닌 간격으로 옮겨진다.'
    },
    {
      id: '17-hatsumi-o-n-3',
      namejp: '強酸',
      name: '强酸',
      namekr: '강산',
      baseType: 'normal',
      types: ['attack'],
      range: '5-6',
      damage: '3/1',
      text: '【常时】若你处于逆风状态，且此《攻击》对敌命造成了伤害，则不将因结算伤害移动的樱花结晶移至气，而改为移至虚。',
      textjp: '【常時】逆風ならば、この《攻撃》のライフへのダメージにより移動する桜花結晶はフレアでなくダストに動かす。',
      textkr: '【상시】역풍이라면, 이 《공격》의 라이프에 대한 데미지에 의해서 이동하는 벚꽃 결정은 플레어가 아닌 더스트로 옮겨진다.'
    },
    {
      id: '17-hatsumi-o-n-4',
      namejp: '海嘯',
      name: '海啸',
      namekr: '해일',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '若当前距离小于等于4，则虚（1）→距。\n【常时】若你处于逆风状态，则此箭头效果左侧的区域改为敌气。',
      textjp: '現在の間合が4以下ならば、\n間合→ダスト：1\n逆風ならば、この矢印効果の左側を相手のフレアに変更する。',
      textkr: '현재의 간격이 4이하라면, 더스트→간격：1\n역풍이라면, 이 화살표의 왼쪽을 상대의 플레어로 변경한다.'
    },
    {
      id: '17-hatsumi-o-n-5',
      namejp: '準備万端',
      name: '准备万全',
      namekr: '준비만전',
      baseType: 'normal',
      types: ['action', 'fullpower'],
      text: '虚（3）→自装\n你可以抓1张牌。\n若你处于逆风状态，则本回合内你的手牌上限增大1。',
      textjp: 'ダスト→自オーラ：3\nカードを1枚引いてもよい。\n逆風ならばこのターンの間、手札の上限が1増加する。'
    },
    {
      id: '17-hatsumi-o-n-6',
      namejp: '羅針盤',
      name: '罗盘',
      namekr: '나침반',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '3',
      text: '【展开中】你的《攻击》额外获得攻击距离5，对手的《攻击》失去攻击距离5。若游戏中存在多个此效果，则此效果相互抵消。（此效果先于距离扩大与距离缩小结算）\n【破弃时】虚（1）→自装',
      textjp: '【展開中】あなたの《攻撃》に適正距離5を追加し、相手の《攻撃》から適正距離5を取り除く。この効果が重複したら相殺する。（距離拡大、距離縮小より先に適用する）\n【破棄時】ダスト→自オーラ：1',
      textkr: '【전개중】당신의 《공격》에 적정 거리5를 추가하고, 상대의 《공격》에서 적정 거리5를 제거한다. 이 효과는 중첩되면 상쇄된다.\n（거리 확대, 거리 축소보다 먼저 적용된다）\n【파기시】더스트→자신 오라：1'
    },
    {
      id: '17-hatsumi-o-n-7',
      namejp: '波呼び',
      name: '唤潮',
      namekr: '파도 부르기',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '1',
      text: '破绽\n【展开中】仅当你的回合内你处于顺风状态时可以移除此牌上的樱花结晶。\n【破弃时】进行一次“攻击距离2-7 伤害1/- 【攻击后】盖伏对手的牌库。”的攻击。',
      textjp: '隙\n【展開中】あなたのターンかつ順風である場合のみ、このカードの上の桜花結晶は移動する。\n【破棄時】攻撃『適正距離2-7、1/-、【攻撃後】相手は山札をすべて伏せ札にする。』を行う。',
      textkr: '틈\n【전개중】당신의 턴 및 순풍일 때에만, 이 카드 위의 벚꽃 결정이 이동한다.\n【파기시】공격 『적정 거리2-7, 1/-, 【공격후】상대는 패산을 전부 덮임패로 한다.』를 한다.'
    }],
    special: [{
      id: '17-hatsumi-o-s-1',
      namejp: 'イサナ海域',
      name: '鲸鱼海域',
      namekr: '이사나 해역',
      baseType: 'special',
      cost: '4',
      types: ['attack'],
      range: '3-5',
      damage: '3/1',
      text: '【常时】若你处于顺风状态，则此《攻击》获得+0/+2。\n【攻击后】若你处于逆风状态，则虚（2）→距，然后将此牌变为未使用状态。',
      textjp: '【常時】順風ならば、この《攻撃》は+0/+2となる。\n【攻撃後】逆風ならば、\nダスト→間合：2\nを行い、このカードを未使用に戻す。',
      textkr: '【상시】순풍이라면, 이 《공격》은 +0/+2된다.\n【공격시】역풍이라면,\n더스트→간격：2\n을 하고, 이 카드를 미사용으로 되돌린다.'
    },
    {
      id: '17-hatsumi-o-s-2',
      namejp: 'オヨギビ砲火',
      name: '鱼雷炮击',
      namekr: '오요기비 포화',
      baseType: 'special',
      cost: '2',
      types: ['attack'],
      range: '5-6',
      damage: '2/2',
      text: '【常时】每当此牌变为未使用状态时，你可以执行1次基本动作。\n----\n【即再起】对手的回合内，回合开始时距离与当前距离的差大于等于2。',
      textjp: '【常時】このカードが未使用に戻った時、基本動作を1回行ってもよい。\n----\n【即再起】相手のターンに現在の間合はターン開始時の間合から2以上近付く。',
      textkr: '【상시】이 카드가 미사용으로 되돌아갔을 때, 기본 동작을 1번 해도 좋다.\n----\n【즉재기】상대의 턴에 현재의 간격이 턴 개시 시의 간격보다 2이상 가까워진다.'
    },
    {
      id: '17-hatsumi-o-s-3',
      namejp: 'カラハリ灯台',
      name: '子午灯塔',
      namekr: '카라하리 등대',
      baseType: 'special',
      cost: '1',
      types: ['action'],
      text: '若你不处于逆风状态，则你畏缩。\n【使用后】达人距离增大1。\n【使用后】对手的回合内，每当对手从手牌使用非《攻击》的牌时，不结算该牌的效果，而改为将该牌置入弃牌区（但仍视为对手使用了该牌），然后将此牌变为未使用状态。',
      textjp: '逆風でないならば、あなたは畏縮する。\n【使用済】達人の間合は1大きくなる。\n【使用済】相手のターンに相手が《攻撃》でないカードを手札から使用したならば、それを解決する代わりに捨て札に置き、このカードを未使用に戻す。',
      textkr: '역풍이 아니라면 당신은 위축된다.\n【사용됨】달인의 간격이 1커진다.\n【사용됨】상대의 턴에 상대가 《공격》이 아닌 카드를 손패에서 사용했다면, 그것을 해결하는 대신에 버림패로 옮기고, 이 카드를 미사용으로 되돌린다.'
    },
    {
      id: '17-hatsumi-o-s-4',
      namejp: 'ミオビキ航路',
      name: '引水航道',
      namekr: '미오비키 항로',
      baseType: 'special',
      cost: '2',
      types: ['action'],
      text: '若你处于逆风状态，则对手畏缩，展示对手牌库顶的1张牌。若该牌为《攻击》牌，则将其置入弃牌区。\n【使用后】你的准备阶段开始时，若你处于逆风状态，则你可以使用此牌，而不需支付其费用。',
      textjp: '逆風ならば、相手を畏縮させ、相手の山札の上から1枚を公開する。それが《攻撃》カードならば捨て札にする。\n【使用済】あなたの開始フェイズの開始時に逆風ならば、このカードを消費を支払わずに使用してもよい。',
      textkr: '역풍이라면, 상대를 위축시키고 상대의 패산 가장 위에서 1장을 공개한다. 그것이 《공격》 카드라면 버림패로 한다.\n【사용됨】당신의 개시 페이즈의 개시 시에 역풍이라면, 이 카드를 코스트를 지불하지 않고 사용해도 좋다.'
    }]
  },
  {
    name: '信赖',
    namejp: '信賴',
    isSelect: false,
    pic: 'twiicon_sa_43.jpg',
    picq: 'sd_hatsumi_a1.png',
    changenormal: [{
      changeIndex: '4',
      id: '17-hatsumi-a1-n-4',
      name: '潜雷',
      namejp: '潜雷',
      types: ['enhance'],
      capacity: '2',
      text: '破绽\n【展开时】进行一次潜水。\n【破弃时】进行一次“攻击距离1-7 伤害-/1 不可被对应”的攻击。',
      textjp: '隙\n【展開時】潜水を行う。\n【破棄時】攻撃『適正距離1-7、-/1、対応不可』を行う。'
    }],
    changespecial: [{
      changeIndex: '1',
      id: '17-hatsumi-a1-s-1',
      name: '峡雾海域',
      namejp: 'サギリ海域',
      types: ['enhance', 'reaction'],
      capacity: '4',
      cost: '3',
      text: '【展开中】对手的回合内，若对手的《攻击》的攻击距离含有至少3个值，则该《攻击》失去除最大值与最小值以外的所有攻击距离。\n（例如3-5的攻击距离变为3,5）',
      textjp: '【展開中】相手のターン中、適正距離を3つ以上持つ相手の《攻撃》はその中から最小と最大の値を除いて全ての適正距離を失う。\n（例えば3-5ならば3,5になる）'
    }, {
      changeIndex: '4',
      id: '17-hatsumi-a1-s-4',
      name: '汪洋航道',
      namejp: 'ワダナカ航路',
      types: ['enhance'],
      capacity: '2',
      cost: '2',
      text: '【展开时】进行一次潜水，对手畏缩。\n【破弃时】若你处于顺风状态，则对敌装与敌命各造成1点伤害。\n----\n【再起】你处于逆风状态。',
      textjp: '【展開時】潜水を行い、相手を畏缩させる。\n【破棄時】順風ならば、相手のオーラとライフに1ダメージを与える。\n----\n【再起】逆風である。'
    }],
    changeExtra: [{
      id: '17-hatsumi-a1-di1',
      name: '潜水前进',
      namejp: '潜水前進',
      text: '本回合内，当前距离减小1，达人距离减小1。\n然后，若此牌因使用《攻击》牌触发，则立即进行一次距离检查。若当前距离不包含于攻击距离，则视为对手没有进行过该《攻击》，并将你的下个回合固定为顺风状态，若该《攻击》为通常牌《攻击》，则将该牌置入弃牌区；若由王牌生成，则将该牌变为使用后状态。失败的《攻击》不会进入对应步骤。',
      textjp: 'このターン中、現在の間合は1減少し、達人の間合は1小さくなる。\nその後、これを公開させた《攻撃》があるならば直ちに間合を判定する。それが外れたならば《攻撃》を失敗として解決せずに終了し、次のターンにあなたは順風となる。\n《攻撃》が通常札によるものならば捨て札に、切札よるものならば使用済になる。失敗した《攻撃》への対応はできない。'
    }, {
      id: '17-hatsumi-a1-di2',
      name: '潜水后退',
      namejp: '潜水後退',
      text: '本回合内，当前距离增大1，达人距离增大1。\n然后，若此牌因使用《攻击》牌触发，则立即进行一次距离检查。若当前距离不包含于攻击距离，则视为对手没有进行过该《攻击》，并将你的下个回合固定为顺风状态，若该《攻击》为通常牌《攻击》，则将该牌置入弃牌区；若由王牌生成，则将该牌变为使用后状态。失败的《攻击》不会进入对应步骤。',
      textjp: 'このターン中、現在の間合は1増加し、達人の間合は1大きくなる。\nその後、これを公開させた《攻撃》があるならば直ちに間合を判定する。それが外れたならば《攻撃》を失敗として解決せずに終了し、次のターンにあなたは順風となる。\n《攻撃》が通常札によるものならば捨て札に、切札よるものならば使用済になる。失敗した《攻撃》への対応はできない。'
    }]
  }]
},
{
  name: 'MIZUKI 水津城',
  namejp: 'ミズキ',
  namekr: '미즈키',
  nameen: 'MIZUKI',
  desc: '统率～兵舍内有4张牌（「盾兵」、「骑兵」和2张「枪兵」）。',
  descjp: '統率～兵舎に4枚のカード（「槍兵」  2枚「盾兵」「騎兵」）を持つ。',
  // girlInfo: '身高：146cm\n喜欢的东西：盤上遊戯、芸術鑑賞（？）、羊羹、みかん\n<b>--物語--</b>\n「槍兵、盾兵、前へ！　ここで参りますわ！」\n軍略と祖霊を象徴するメガミです。ユリナやサイネのような個人の武を貴ぶ武神ではなく、軍としての武や勝利を貴ぶ軍神であり、信仰する人々の層も異なっています。その権能は祖たる兵たちを呼び起こし、顕現させ共に戦うというものです。彼らを指揮する兜のみならず、付き従う兵員全てが彼女の象徴武器と言えるでしょう。\n元は人間にして山城の英雄・山城水津城でした。軍略の天才であった彼女は戦で戦果をあげ、その果てにメガミ・コダマへの挑戦に勝利してメガミの座へと至りました。\n現在はある理由によりコダマを自らの兵舎・大手門の中に匿っており、権能が混在した状態にあります。そして同じ理由で身を隠してもいるようです。',
  // girlInfojp: '身長：146cm\n好きなもの：盤上遊戯、芸術鑑賞（？）、羊羹、みかん\n<b>--物語--</b>\n「槍兵、盾兵、前へ！　ここで参りますわ！」\n軍略と祖霊を象徴するメガミです。ユリナやサイネのような個人の武を貴ぶ武神ではなく、軍としての武や勝利を貴ぶ軍神であり、信仰する人々の層も異なっています。その権能は祖たる兵たちを呼び起こし、顕現させ共に戦うというものです。彼らを指揮する兜のみならず、付き従う兵員全てが彼女の象徴武器と言えるでしょう。\n元は人間にして山城の英雄・山城水津城でした。軍略の天才であった彼女は戦で戦果をあげ、その果てにメガミ・コダマへの挑戦に勝利してメガミの座へと至りました。\n現在はある理由によりコダマを自らの兵舎・大手門の中に匿っており、権能が混在した状態にあります。そして同じ理由で身を隠してもいるようです。',
  list: [{
    name: '兜',
    namejp: '兜',
    namekr: '투구',
    nameen: 'ARMET',
    isSelect: false,
    pic: 'twiicon_sa_28.jpg',
    picq: 'sd_mizuki.png',
    normal: [{
      id: '18-mizuki-o-n-1',
      namejp: '陣頭',
      name: '头阵',
      namekr: '진두',
      baseType: 'normal',
      types: ['attack'],
      range: '1-2',
      damage: '1/1',
      text: '【攻击后】进行1次征兵。',
      textjp: '【攻撃後】徴兵を1回行う。',
      textkr: '【공격후】징병을 1번 한다.'
    },
    {
      id: '18-mizuki-o-n-2',
      namejp: '反攻',
      name: '反攻',
      namekr: '반공',
      baseType: 'normal',
      types: ['attack'],
      range: '2-3',
      damage: '1/1',
      text: '【常时】若上一回合内你进行过对应，则此《攻击》获得+2/+1。\n全力化（主要阶段，若你选择执行全力行动，则你可以如使用《全力》牌一样使用此牌。若如此做，则此牌额外获得以下效果）：【常时】此《攻击》获得+1/+1。',
      textjp: '【常時】あなたが直前のターンに対応しているならば、この《攻撃》は+2/+1となる。\n全力化：【常時】この《攻撃》は+1/+1となる。'
    },
    {
      id: '18-mizuki-o-n-3',
      namejp: '撃ち落とし',
      name: '击落',
      namekr: '쏘아떨구기',
      baseType: 'normal',
      types: ['attack', 'reaction'],
      range: '1-5',
      damage: '1/1',
      text: '【攻击后】不动～若本回合内当前距离的值没有发生过变化，则打消被对应的不具《全力》副类别且非王牌的《攻击》。（此牌视为菰珠的牌）',
      textjp: '【攻撃後】不動‐このターン中に現在の間合が変化していないならば、対応した《全力》でも切札でもない《攻撃》を打ち消す。\n（このカードはコダマのカードとして扱う）',
      textkr: '【공격후】부동―이 턴 중에 현재의 간격이 변화하지 않았다면, 대응한 《전력》도 비장패도 아닌 《공격》을 무효화한다.\n（이 카드는 코다마의 카드로 취급한다）'
    },
    {
      id: '18-mizuki-o-n-4',
      namejp: '号令',
      name: '号令',
      namekr: '호령',
      baseType: 'normal',
      types: ['action'],
      text: '进行1次征兵。\n若上一回合内你进行过对应，则获得1点集中力。',
      textjp: '徴兵を1回行う。\nあなたが直前のターンに対応しているならば、集中力を1得る。',
      textkr: '징병을 1번 한다.\n당신이 직전 턴에 대응했다면, 집중력을 1얻는다'
    },
    {
      id: '18-mizuki-o-n-5',
      namejp: '防壁',
      name: '防壁',
      namekr: '방벽',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '终端\n若此牌为本回合内你进行的第一次对应，则打消被对应的不具《全力》副类别且非王牌的《攻击》。',
      textjp: '終端\nこのカードがこのターンであなたが行う最初の対応ならば、対応した切札でも《全力》でもない《攻撃》を打ち消す。',
      textkr: '종단\n이 카드가 이 턴에서의 당신이 최초로 행하는 대응이라면, 대응한 비장패도 《전력》도 아닌 《공격》을 무효화한다.'
    },
    {
      id: '18-mizuki-o-n-6',
      namejp: '制圧前進',
      name: '压制前进',
      namekr: '제압전진',
      baseType: 'normal',
      types: ['action', 'fullpower'],
      text: '选择3次。你可以多次选择同一个选项：\n1.进行1次征兵；\n2.执行1次基本动作《前进》；\n3.执行1次基本动作《装附》。',
      textjp: '以下を３回選ぶ。同じものを複数回選んでもよい。\n・徴兵を１回行う。\n・基本動作《前進》を行う。\n・基本動作《纏い》を行う。'
    },
    {
      id: '18-mizuki-o-n-7',
      namejp: '戰場',
      name: '战场',
      namekr: '전장',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '3',
      text: '【展开中】不动～每回合内，每当你进行第一次非王牌的《攻击》时，若该回合内当前距离的值没有发生过变化，则该《攻击》获得+1/+1。（此牌视为菰珠的牌）',
      textjp: '【展開中】不動―あなたがこのターンで初めて切札でない《攻撃》を行った時、このターン中に現在の間合が変化していないならば、その《攻撃》は+1/+1となる。\n（このカードはコダマのカードとして扱う）',
      textkr: '【전개중】부동―당신이 이 턴에서 처음으로 비장패가 아닌 《공격》을 했을 때, 이 턴 동안 현재의 간격이 변화하지 않았다면, 그 《공격》은 +1/+1된다.\n（이 카드는 코다마의 카드로 취급한다）'
    }],
    special: [{
      id: '18-mizuki-o-s-1',
      namejp: '天主八龍閣',
      name: '天主八龙阁',
      namekr: '천주팔룡각',
      baseType: 'special',
      cost: '5',
      types: ['enhance', 'reaction'],
      capacity: '3',
      text: '终端\n【展开时】打消被对应的《攻击》。\n【展开中】你的兵员和其他女神的《攻击》获得+0/+1。',
      textjp: '終端\n【展開時】対応した《攻撃》を打ち消す。\n【展開中】あなたの他のメガミまたは兵員の《攻撃》は+0/+1となる。',
      textkr: '종단\n【전개시】대응한 《공격》을 무효화한다.\n【전개중】당신의 다른 여신 또는 병사의 《공격》은 +0/+1된다'
    },
    {
      id: '18-mizuki-o-s-2',
      namejp: '三重膝丸櫓',
      name: '三重膝丸橹',
      namekr: '삼중슬환노',
      baseType: 'special',
      cost: '2',
      types: ['attack'],
      range: '3-4',
      damage: '3/1',
      text: '【常时】若本回合内你进行过攻击，则你不能使用此牌。\n----\n【即再起】你使用具终端关键字的牌。（该牌结算前再起）',
      textjp: '【常時】あなたがこのターン中に攻撃しているならば、このカードは使用できない。\n----\n【即再起】あなたが終端を持つカートを使用する。（解決より前に再起する）',
      textkr: '【상시】당신이 이 턴 중에 공격했다면, 이 카드는 사용할 수 없다.\n----\n【즉재기】당신이 종단을 가진 카드를 사용했다.\n（해결하기 전에 재기한다）'
    },
    {
      id: '18-mizuki-o-s-3',
      namejp: '大手楯無門',
      name: '大手楯无门',
      namekr: '대수순무문',
      baseType: 'special',
      cost: '3',
      types: ['action'],
      text: '终端\n将你的1张手牌与追加牌区中的『斗神』以已征兵状态置于兵舍。进行1次征兵。\n【使用后】你从兵舍中使用的《攻击》牌生成的《攻击》获得+1/+0。你从兵舍中使用的具《对应》副类别的牌失去终端关键字。',
      textjp: '終端\n追加札の「闘神」と手札のカード1枚を選び、それらを兵舎に徴兵済で置く。徴兵を1回行う。\n【使用済】あなたが兵舎から使用した《攻撃》カードによる《攻撃》は+1/+0となる。あなたが兵舎から使用した《対応》カードは終端を失う。'
    },
    {
      id: '18-mizuki-o-s-4',
      namejp: '山城水津城の鬨の声',
      name: '山城水津城的喧天号角',
      namekr: '야마시로 미즈키의 함성',
      baseType: 'special',
      cost: '5',
      types: ['enhance', 'fullpower'],
      capacity: '5',
      text: '【展开中】你的原本具终端关键字的通常牌和兵员牌失去终端。\n【展开中】你的原本具《全力》副类别的通常牌失去《全力》副类别，并获得终端。',
      textjp: '【展開中】元々終端を持つあなたの通常札と兵員は終端を失う。\n【展開中】元々が《全力》であるあなたの通常札は《全力》を失い、終端を得る。',
      textkr: '【전개중】원래 종단을 가진 당신의 통상패와 병사는 종단을 잃는다.\n【전개중】원래 《전력》을 가진 당신의 통상패는 《전력》을 잃고, 종단을 얻는다.'
    }],
    extra: [
      {
        id: '18-mizuki-o-s-3-ex1',
        name: '斗神',
        namejp: '闘神',
        namekr: '투신',
        baseType: 'normal',
        types: ['attack'],
        range: '1-2',
        damage: '2/1',
        text: '【常时】不动～若本回合内当前距离的值没有发生过变化，则此《攻击》获得+0/+1。\n【攻击后】将此牌置入追加牌区。\n（此牌视为菰珠的牌）',
        textjp: '【常時】不動―このターン中に現在の間合が変化していないならば、この《攻撃》は+0/+1となる。\n【攻撃後】このカードを追加札に戻す。\n（このカードはコダマのカードとして扱う）',
        textkr: '【상시】부동―이 턴 동안 현재의 간격이 변화하지 않았다면, 이 《공격》은 +0/+1된다.\n【공격후】이 카드를 추가패로 되돌린다.\n（이 카드는 코다마의 카드로 취급한다.）',
        extraFrom: '18-mizuki-o-s-3'
      }, {
        id: '18-mizuki-o-t-1',
        name: '枪兵',
        namejp: '槍兵',
        namekr: '창병',
        baseType: 'soldier',
        types: ['attack'],
        range: '3',
        damage: '1/1',
        text: '终端\n【常时】若上一回合内你进行过对应，则此《攻击》获得+1/+0。',
        textjp: '終端\n【常時】あなたが直前のターンに対応しているならば、この《攻撃》は+1/+0となる。',
        textkr: '종단\n【상시】당신이 직전 턴에 대응했다면, 이 공격은 +1/+0된다.'
      },
      {
        id: '18-mizuki-o-t-1',
        name: '枪兵',
        namejp: '槍兵',
        namekr: '창병',
        baseType: 'soldier',
        types: ['attack'],
        range: '3',
        damage: '1/1',
        text: '终端\n【常时】若上一回合内你进行过对应，则此《攻击》获得+1/+0。',
        textjp: '終端\n【常時】あなたが直前のターンに対応しているならば、この《攻撃》は+1/+0となる。',
        textkr: '종단\n【상시】당신이 직전 턴에 대응했다면, 이 공격은 +1/+0된다.'
      },
      {
        id: '18-mizuki-o-t-2',
        name: '盾兵',
        namejp: '盾兵',
        namekr: '방패병',
        baseType: 'soldier',
        types: ['action', 'reaction'],
        text: '终端\n被对应的不具《全力》副类别的《攻击》获得-1/+0。',
        textjp: '終端\n対応した《全力》でない《攻撃》は-1/+0となる。',
        textkr: '종단\n대응한 《전력》이 아닌 《공격》은 -1/+0된다.'
      },
      {
        id: '18-mizuki-o-t-3',
        name: '骑兵',
        namejp: '騎兵',
        namekr: '기병',
        baseType: 'soldier',
        types: ['enhance'],
        capacity: '2',
        text: '终端\n【展开中】对手的《攻击》失去不可被对应。\n【破弃时】你获得1点集中力。',
        textjp: '終端\n【展開中】相手の《攻撃》は対応不可を失う。\n【破棄時】あなたは集中力を1得る。'
      }]
  }]
}, {
  name: 'MEGUMI 希',
  namejp: 'メグミ',
  desc: '异樱～土壤中有5个种子结晶',
  descjp: '異桜～土壌に種結晶を５つ持つ。',
  list: [{
    name: '梿枷',
    namejp: '唐棹',
    nameen: 'Flail',
    isSelect: false,
    pic: 'twiicon_sa_33.jpg',
    picq: 'sd_megumi.png',
    normal: [{
      id: '19-megumi-o-n-1',
      namejp: '空閃',
      name: '空闪',
      baseType: 'normal',
      types: ['attack'],
      range: '4-8',
      damage: '2/1',
      textjp: '【常時】あなたの土壌の種結晶が全て萌芽しているならば、この《攻撃》は +1/+1 となる。',
      text: '【常时】若你的土壤中的种子结晶已经全部萌芽，则此《攻击》获得+1/+1。'
    },
    {
      id: '19-megumi-o-n-2',
      namejp: '打擲',
      name: '打掷',
      baseType: 'normal',
      types: ['attack'],
      range: '4-5',
      damage: '2/1',
      textjp: '【常時】あなたの付与札に種結晶があるならば、この《攻撃》は +1/+1 となる。',
      text: '【常时】若你的《付与》牌上有种子结晶，则此《攻击》获得+1/+1。'
    },
    {
      id: '19-megumi-o-n-3',
      namejp: '殻打ち',
      name: '脱粒',
      baseType: 'normal',
      types: ['attack'],
      range: '3-5',
      damage: '2/1',
      textjp: '【攻撃後】このターンにあなたが次に使用する他のメガミの《付与》カードは生育２を得る。',
      text: '【攻击后】本回合内你使用的下一张其他女神的《付与》牌获得生长2。'
    },
    {
      id: '19-megumi-o-n-4',
      namejp: '棹穿ち',
      name: '穿竹',
      baseType: 'normal',
      types: ['attack', 'reaction'],
      range: '2-4',
      damage: '1/1',
      textjp: '【常時】この《攻撃》のダメージにより移動する桜花結晶は、ダストやフレアでなく間合に移動する。\n【攻撃後】あなたが付与札を出しているならば、このターンに相手が行う次の基本動作は効果を解決しない。',
      text: '【常时】若此《攻击》对对手造成了伤害，则不将因结算伤害移动的樱花结晶移至气或虚，而改为移至距。\n【攻击后】若你的付与区存在展开中的《付与》牌，则不结算本回合内对手执行的下一次基本动作的效果。'
    },
    {
      id: '19-megumi-o-n-5',
      namejp: '葦',
      name: '苇草',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '1',
      capacityGrowup: '1',
      textjp: '生育１\n【展開時】ダスト → 間合 :１。\n【展開中】現在の間合はX増加し、達人の間合はX大きくなる。Xはこの付与札の上の種結晶の個数に等しい。',
      text: '生长1\n【展开时】虚（1）→距。\n【展开中】当前的距离增大X，达人距离增大X。X等于这张《付与》牌上种子结晶的个数。'
    },
    {
      id: '19-megumi-o-n-6',
      namejp: '鳳仙花',
      name: '凤仙花',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '1',
      capacityGrowup: '2',
      textjp: '生育 2 隙\n【展開中】相手のメインフェイズの開始時に攻撃『適正距離3-5、2/1』を行う。あなたのメインフェイズの開始時に攻撃『適正距離1-3、2/1』を行う。\n【破棄時】相手を畏縮させる。',
      text: '生长2 破绽\n【展开中】对手的主要阶段开始时，进行一次“攻击距离3-5，伤害2/1”的攻击。你的主要阶段开始时，进行一次“攻击距离1-3，伤害2/1”的攻击。\n【破弃时】对手畏缩。'
    },
    {
      id: '19-megumi-o-n-7',
      namejp: '野茨',
      name: '野蔷薇',
      baseType: 'normal',
      types: ['enhance', 'fullpower'],
      capacity: '0',
      capacityGrowup: '2',
      textjp: '生育 2\n【展開時/展開中】展開時とあなたの終了フェイズに基本動作を1回行ってもよい。\n【展開中】相手が各ターンに初めて間合にある桜花結晶を動かした時、ダスト → 間合 :１。\n【展開中】相手のターンにこの付与札の上の桜花結晶は移動しない。',
      text: '生长2\n【展开时/展开中】当此《付与》牌展开时和你的结束阶段开始时，你可以执行1次基本动作。\n【展开中】每回合内，每当对手第一次将距中的樱花结晶移出距时，\n虚（1）→距\n【展开中】对手的回合内不能移除此牌上的樱花结晶。'
    }],
    special: [{
      id: '19-megumi-o-s-1',
      namejp: '因果律の根',
      name: '因果律之根',
      baseType: 'special',
      types: ['attack'],
      range: '3-7',
      damage: '1/1',
      cost: '1',
      textjp: '【攻撃後】あなたの土壌の種結晶を1つ萌芽させる。\n----\n【再起】あなたの土壌に萌芽した種結晶がない。',
      text: '【攻击后】将你的土壤中的1个种子结晶变为萌芽状态。\n----\n【再起】你的土壤中没有处于萌芽状态的种子结晶。'
    },
    {
      id: '19-megumi-o-s-2',
      namejp: '可能性の枝',
      name: '可能性之枝',
      baseType: 'special',
      types: ['attack', 'reaction'],
      range: '0-10',
      damage: '0/1',
      cost: '3',
      textjp: '【常時】Xはあなたの付与札にある種結晶の個数の合計に等しい。\n【常時】この〈攻撃》は +X/+0 となる。\n【攻撃後】対応した《攻撃》は -X/+0 となる。',
      text: '【常时】X等于置于你的展开中的《付与》牌上种子结晶的总数。\n【常时】此《攻击》获得+X/+0。\n【攻击后】被对应的《攻击》获得-X/+0。'
    },
    {
      id: '19-megumi-o-s-3',
      namejp: '結末の果実',
      name: '终结之果实',
      baseType: 'special',
      types: ['enhance'],
      capacity: '2',
      cost: '4',
      textjp: '【展開中】この付与札の上の桜花結晶はメインフェイズに移動しない。開始フェイズの処理であなたの他の付与札から桜花結晶がよダストへと送られるならば、それは代わりにこの付与札へと移動する。\n【展開中】この付与札の上の種結晶が5個になったターンの終了フェイズに、攻撃『適正距離5、5/5、不可避、【常時】この《攻撃》は打ち消されない』を行い、このカードの上の桜花結晶を全てダストに送る。',
      text: '【展开中】主要阶段内不能移除此牌上的樱花结晶。准备阶段移除所有《付与》牌上的樱花结晶时，若你的其他《付与》牌上的樱花结晶将要移至虚，则改为移至此牌上。\n【展开中】当此牌上的种子结晶的数目变为5时，于该回合的结束阶段开始时进行一次“攻击距离5，伤害5/5 , 不可避，【常时】此《攻击》不可被打消。”的攻击，然后将此牌上的所有樱花结晶移至虚。'
    },
    {
      id: '19-megumi-o-s-4',
      namejp: '瀧河希の掌',
      name: '泷河希之掌',
      baseType: 'special',
      types: ['enhance'],
      capacity: '0',
      cost: '3',
      capacityGrowup: '5',
      textjp: '生育 5\n【展開中】各ターンにあなたが初めて行う《オーラ》へのダメージが3以下の《攻撃》は +1/+1 となる。',
      text: '生长5\n【展开中】每回合内，每当你进行第一次对装伤害小于等于3的《攻击》时，该《攻击》获得+1/+1。'
    }]
  }]
},
{
  name: 'KANAWE 叶慧',
  namejp: 'カナヱ',
  desc: '神话～英雄传说从故事版图的白色剧幕开始。若你达成了构想，则将棋子向下一个剧幕移动一步。到达最终剧幕时，你赢得本局游戏。',
  descjp: '神語～物語ボードの白の幕から英雄譚は始まる。構想を達成すれば駒を次の幕へ進められ、終幕を迎えたらあなたは勝利する。',
  list: [{
    name: '面具',
    namejp: '仮面',
    isSelect: false,
    pic: 'twiicon_sa_34.jpg',
    picq: 'sd_kanawe.png',
    normal: [{
      id: '20-kanawe-o-n-1',
      name: '空想',
      namejp: '空想',
      baseType: 'normal',
      types: ['attack'],
      range: '0-10',
      damage: 'X/1',
      text: '【常时】X等于当前剧幕的值的一半（向上取整）。\n【攻击后】若当前剧幕的值为偶数，则\n距（1）⇔虚',
      textjp: '【常時】Xは現在の幕の値の半分（切り上げ）に等しい。\n【攻撃後】現在の幕の値が偶数ならば、間合↔ダスト：1。'
    },
    {
      id: '20-kanawe-o-n-2',
      name: '脚本化',
      namejp: '脚本化',
      baseType: 'normal',
      types: ['attack'],
      range: '2-8',
      damage: '0/0',
      text: '【攻击后】你可以从追加区准备1张构想牌。\n【常时】你的结束阶段开始时，若此牌位于弃牌区，则你可以将其置于牌库底。若如此做，则对手获得1点集中力。',
      textjp: '【攻撃後】追加札から構想カードを1枚準備してもよい。\n【常時】あなたの終了フェイズにこのカードを捨て札から山札の底に置いてもよい。そうした場合、相手は集中力を1得る。'
    },
    {
      id: '20-kanawe-o-n-3',
      name: '演出化',
      namejp: '演出化',
      baseType: 'normal',
      types: ['attack'],
      range: '2-3',
      damage: '2/1',
      text: '【常时】若当前剧幕的颜色为【紫】，则此《攻击》获得+0/+1。\n【攻击后】本回合内你不能达成构想。',
      textjp: '【常時】現在の幕の色が紫ならば、この《攻撃》は+0/+1となる。\n【攻撃後】あなたはこのターンに構想を進められない。'
    },
    {
      id: '20-kanawe-o-n-4',
      name: '断行',
      namejp: '断行',
      baseType: 'normal',
      types: ['action'],
      text: '你可以执行1次基本动作《装附》。然后你可以执行1次《装附》以外的基本动作。\n全力化：你可以从追加区或已达成区域准备1张构想牌。对手畏缩。',
      textjp: '基本動作《纏い》を1回行ってもよい。その後、《纏い》以外の基本動作を1回行ってもよい。\n全力化：追加札または達成済から構想カードを1枚準備してもよい。相手を畏縮させる。'
    },
    {
      id: '20-kanawe-o-n-5',
      name: '残光',
      namejp: '残光',
      baseType: 'normal',
      types: ['action'],
      text: '若当前剧幕的颜色为【紫】或【绿】，则查看对手手牌，从中选择1张置于对手的牌库底。对手获得1点集中力。',
      textjp: '現在の幕の色が紫または緑ならば、相手の手札を見てその中から1枚を選び、それを山札の底に置く。相手は集中力を1得る。'
    },
    {
      id: '20-kanawe-o-n-6',
      name: '即兴',
      namejp: '即興',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '你可以从手牌中使用1张其他女神的不具《全力》副类别的《攻击》牌。若此牌对应了一个《攻击》，则视为所使用的牌也对应了该《攻击》。然后若当前剧幕的颜色为【绿】且该牌位于弃牌区，则将该牌置入手牌。',
      textjp: '手札から他のメガミの全力でない《攻撃》カードを1枚使用してもよい。このカードが対応している《攻撃》があるならば、使用されたカードはそれに対応しているものと扱う。現在の幕の色が緑かつそのカードが捨て札にあるならば、そのカードを手札に戻す。'
    },
    {
      id: '20-kanawe-o-n-7',
      name: '封杀',
      namejp: '封殺',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '3',
      text: '【展开时】宣言1个牌名。\n【展开中】对手的回合内，对手不能使用具你所宣言的名称的王牌。若当前剧幕的颜色为【红】，则对手不能使用具你所宣言的名称的通常牌。\n【破弃时】你获得1点集中力。',
      textjp: '【展開時】カードの名前を1つ宣言する。\n【展開中】相手のターン中、相手は宣言された名前を持つ切札を使用できない。現在の幕の色が赤ならば、宣言された名前を持つ通常札も使用できない。\n【破棄時】あなたは集中力を1得る。'
    }],
    special: [
      {
        id: '20-kanawe-o-s-1',
        name: '疾书弗尽 尺璧寸阴',
        namejp: 'たまゆらふみ',
        baseType: 'special',
        cost: '1',
        types: ['action'],
        text: '你可以支付1点集中力。若如此做，则你可以从追加区或已达成区域准备1张构想牌。若以此法从已达成区域准备构想牌，则将此牌移出游戏。\n【使用后】对手的准备阶段开始时，若你上回合内构想牌上的樱花结晶没有前进，则将此牌变为未使用状态。',
        textjp: '集中力を1支払ってもよい。そうした場合、追加札または達成済から構想カードを1枚準備する。達成済から準備したらこのカードを取り除く。\n【使用済】相手の開始フェイズの開始時に、あなたが直前のターンに構想を進めていないならば、このカードを未使用に戻す。'
      },
      {
        id: '20-kanawe-o-s-2',
        name: '芳颜无常 星辉灯影',
        namejp: 'ほかげきらぼし',
        baseType: 'special',
        cost: 'X',
        types: ['action'],
        text: '【常时】X等于当前剧幕的值。\n若当前剧幕的颜色为【绿】、【红】、【紫】之一，则结算其对应的效果。\n----\n【即再起】进入下一个剧幕。',
        textjp: '【常時】Xは現在の幕の値に等しい。\n現在の幕の色が緑、赤、紫のいずれかならば、その効果を得る。\n----\n【即再起】次の幕へ向かう。'
      },
      {
        id: '20-kanawe-o-s-3',
        name: '良宵讵待 盛景久盈',
        namejp: 'あたらよちよに',
        baseType: 'special',
        cost: '4',
        types: ['attack', 'reaction'],
        range: '0-4',
        damage: '2/1',
        text: '【攻击后】打消被对应的非王牌的《攻击》。若被对应的《攻击》为通常牌，则将该牌置于牌库顶。',
        textjp: '【攻撃後】対応した切札でない《攻撃》を打ち消す。\nその《攻撃》が通常札ならば、そのカードを山札の上に置く。'
      },
      {
        id: '20-kanawe-o-s-4',
        name: '知音难觅 化境在心',
        namejp: 'はらからのあまつそら',
        baseType: 'special',
        cost: '2',
        types: ['action'],
        text: '你可以从手牌中展示1张通常牌并将其移出游戏。若如此做，则展示1张你眼前构筑时没有选用的通常牌，将其加入手牌。\n将此牌移出游戏，然后将1张你眼前构筑时没有选用的王牌以未使用状态加入王牌。',
        textjp: 'あなたの手札から通常札を1枚公開し、それを取り除いてもよい。そうした場合、眼前構築で選んでいないあなたの通常札1枚を公開し、それを手札に加える。\nこのカードを取り除き、眼前構築で選んでいないあなたの切札1枚を未使用で得る。'
      }],
    extra: [{
      id: '20-kanawe-o-p-1',
      name: '杀阵',
      namejp: '殺陣',
      text: '本回合内双方进行了至少2次《攻击》或对应。（达成次数：2次）\n\n--意志（卡牌背面）--\n本回合内双方进行了至少5次《攻击》或对应。（达成次数：1次）',
      textjp: 'このターンに《攻撃》か対応が合計2回以上を行われた。（達成回数：2）\n\n--試練--\nこのターンに《攻撃》か対応が合計5回以上を行われた。（達成回数：1）'
    }, {
      id: '20-kanawe-o-p-2',
      name: '樱飞沫',
      namejp: '桜飛沫',
      text: '本回合内有至少3个樱花结晶一次性移动到了付与区以外的区域。（达成次数：1次）\n\n--意志（卡牌背面）--\n本回合内有至少5个樱花结晶一次性移动到了其他区域。（达成次数：1次）',
      textjp: 'このターンに3個以上の桜花結晶が付与札以外の領域へ一度に移動した。（達成回数：1）\n\n--試練--\nこのターンに5個以上の桜花結晶が一度に移動した。（達成回数：1）'
    }, {
      id: '20-kanawe-o-p-3',
      name: '鼓动',
      namejp: '鼓動',
      text: '本回合内某一方命中的樱花结晶的数目发生了变化。（达成次数：2次）\n\n--意志（卡牌背面）--\n本回合内某一方命中的樱花结晶的数目一次性发生了大于等于2的变化。（达成次数：1次）',
      textjp: 'このターンにライフが変化した。（達成回数：2）\n\n--試練--\nこのターンにライフが一度に2以上変化した。（達成回数：1）'
    }, {
      id: '20-kanawe-o-p-4',
      name: '明转',
      namejp: '明転',
      text: '本回合内结算了箭头效果。（达成次数：2次）\n\n--意志（卡牌背面）--\n本回合内结算了至少2次箭头效果。（达成次数：2次）',
      textjp: 'このターンに矢印効果を解決した。（達成回数：2）\n\n--試練--\nこのターンに矢印効果を2回以上解決した。（達成回数：2）'
    }, {
      id: '20-kanawe-o-p-5',
      name: '战栗',
      namejp: '粒立て',
      text: '此构想并非本回合内准备，且本回合内使用了具《全力》副类别的牌。（达成次数：1次）\n\n--意志（卡牌背面）--\n此构想并非本回合内准备，且本回合内使用了具《全力》副类别的牌。（达成次数：2次）',
      textjp: 'このターンに準備されたのでなく、このターンに《全力》カードが使用された。（達成回数：1）\n\n--試練--\nこのターンに準備されたのでなく、このターンに《全力》カードが使用された。（達成回数：2）'
    }, {
      id: '20-kanawe-o-p-6',
      name: '定位',
      namejp: '位置取り',
      text: '当前距离与回合开始时距离之差的绝对值大于等于2，且当前距离小于等于8。（达成次数：2次）\n\n--意志（卡牌背面）--\n当前距离与回合开始时距离之差的绝对值大于等于5。（达成次数：1次）',
      textjp: '現在の間合がターン開始時の間合から2以上変化し、かつ8以下である。（達成回数：2）\n\n--試練--\n現在の間合がターン開始時の間合から5以上変化している。（達成回数：1）'
    }],
    girlBoard: [{
      id: 'Story Board',
      name: '【物语板块】',
      namejp: '【物語ボード】',
      text: '<div class="story-board"><div class="story-board__row story-board__row--0"><div class="story-board__item"><div class="txt"></div></div></div><div class="story-board__row story-board__row--1"><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div></div><div class="story-board__row story-board__row--2"><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div></div><div class="story-board__row story-board__row--3"><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div></div><div class="story-board__row story-board__row--4"><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div></div><div class="story-board__row story-board__row--5"><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div></div><div class="story-board__row story-board__row--6"><div class="story-board__item"><div class="txt"></div></div></div><div class="story-board__info"><p>Start：开始</p><p>红：对敌命造成1点伤害。</p><p>紫：你可以执行1次基本动作。</p><p>绿：从盖牌区中选择1张牌，将其置于你的牌库底。</p><p>金：你的由《攻击》牌（而非其效果文本）进行的《攻击》获得+0/+1。</p><p>End：特殊胜利</p></div></div>',
      textjp: '<div class="story-board"><div class="story-board__row story-board__row--0"><div class="story-board__item"><div class="txt"></div></div></div><div class="story-board__row story-board__row--1"><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div></div><div class="story-board__row story-board__row--2"><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div></div><div class="story-board__row story-board__row--3"><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div></div><div class="story-board__row story-board__row--4"><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div></div><div class="story-board__row story-board__row--5"><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div><div class="story-board__item"><div class="txt"></div></div></div><div class="story-board__row story-board__row--6"><div class="story-board__item"><div class="txt"></div></div></div></div>'
    }]
  }]
},
{
  name: 'KAMUWI 神居',
  namejp: 'カムヰ',
  desc: '禁忌～若你的禁忌槽的值大于等于16，则你输掉本局游戏。',
  descjp: '禁忌～あなたの禁忌ゲージが１６以上ならば、あなたは敗北する。',
  list: [{
    name: '剑',
    namejp: '剣',
    isSelect: false,
    pic: 'twiicon_sa_38.jpg',
    picq: 'sd_kamuwi.png',
    normal: [{
      id: '21-kamuwi-o-n-1',
      name: '红刃',
      namejp: '紅刃',
      baseType: 'normal',
      types: ['attack'],
      range: '3',
      damage: '3/1',
      text: '禁忌+1～【常时】此《攻击》获得+1/+1。\n----',
      textjp: '＜禁忌+1＞【常時】この《攻撃》は+1/+1となる。\n----',
      textkururu: [{
        if: '<i class="i-jinji">禁忌+1</i>',
        ctn: '【常时】此《攻击》获得+1/+1。'
      }],
      textkururujp: [{
        if: '<i class="i-jinji">禁忌+1</i>',
        ctn: '【常時】この《攻撃》は+1/+1となる。'
      }]
    }, {
      id: '21-kamuwi-o-n-2',
      name: '散华刃',
      namejp: '散華刃',
      baseType: 'normal',
      types: ['attack'],
      range: '3-4',
      damage: '3/1',
      text: '禁忌+1～【攻击后】若敌装中樱花结晶的数目小于等于4，则对敌装造成1点伤害。\n【攻击后】执行1次基本动作《装附》。\n----',
      textjp: '＜禁忌+1＞【攻撃後】相手のオーラが4以下ならば、相手のオーラに1ダメージを与える。\n【攻撃後】基本動作《纏い》を1回行う。\n----',
      textkururu: [{
        if: '<i class="i-jinji">禁忌+1</i>',
        ctn: '【攻击后】若敌装中樱花结晶的数目小于等于4，则对敌装造成1点伤害。\n【攻击后】执行1次基本动作《装附》。'
      }],
      textkururujp: [{
        if: '<i class="i-jinji">禁忌+1</i>',
        ctn: '【攻撃後】相手のオーラが4以下ならば、相手のオーラに1ダメージを与える。\n【攻撃後】基本動作《纏い》を1回行う。'
      }]
    }, {
      id: '21-kamuwi-o-n-3',
      name: '四剑乱刃',
      namejp: '四剣乱刃',
      baseType: 'normal',
      types: ['attack'],
      range: '2-4',
      damage: '2/1',
      text: '禁忌+1～全力化：【攻击后】进行3次“攻击距离2-4 伤害1/1”的攻击。\n----',
      textjp: '＜禁忌+1＞全力化：【攻撃後】攻撃『適正距離2-4、1/1』を3回行う。\n----',
      textkururu: [{
        if: '<i class="i-jinji">禁忌+1</i>',
        ctn: '全力化：【攻击后】进行3次“攻击距离2-4 伤害1/1”的攻击。'
      }],
      textkururujp: [{
        if: '<i class="i-jinji">禁忌+1</i>',
        ctn: '全力化：【攻撃後】攻撃『適正距離2-4、1/1』を3回行う。'
      }]
    }, {
      id: '21-kamuwi-o-n-4',
      name: '格杀',
      namejp: '斬り払い',
      baseType: 'normal',
      types: ['attack', 'reaction'],
      range: '1-4',
      damage: '1/1',
      text: '【常时】仅当进行对应时可以使用此牌。\n禁忌+2～【攻击后】打消被对应的《攻击》的伤害。若该《攻击》为王牌或具《全力》副类别，则禁忌槽的值增加2。\n----',
      textjp: '【常時】このカードは対応でしか使用できない\n----\n<禁忌+2>【攻撃後】対応した《攻撃》のダメージを打ち消す。その《攻撃》が《全力》または切札であるなら禁忌ゲージを2上げる。\n----',
      textkururu: [{
        ctn: '【常时】仅当进行对应时可以使用此牌。'
      }, {
        if: '<i class="i-jinji">禁忌+2</i>',
        ctn: '【攻击后】打消被对应的《攻击》的伤害。若该《攻击》为王牌或具《全力》副类别，则禁忌槽的值增加2。'
      }],
      textkururujp: [{
        ctn: '【常時】このカードは対応でしか使用できない'
      }, {
        if: '<i class="i-jinji">禁忌+2</i>',
        ctn: '【攻撃後】対応した《攻撃》のダメージを打ち消す。その《攻撃》が《全力》または切札であるなら禁忌ゲージを2上げる。'
      }]
    }, {
      id: '21-kamuwi-o-n-5',
      name: '织荆',
      namejp: '棘縫い',
      baseType: 'normal',
      types: ['action'],
      text: '根据当前距离结算以下效果。\n大于等于5……距（2）→虚\n大于等于2小于等于4……本回合内你进行的下一次其他女神的非王牌的《攻击》获得+1/+0与不可被对应（通常牌）。\n小于等于1……虚（2）→距。',
      textjp: '現在の間合に応じて以下を行う。\n5以上…間合→ダスト：2。\n2以上4以下…このターンにあなたが次に行う他のメガミによる切札でない《攻撃》は+1/+0となり、対応不可（通常札）を得る。\n1以下…ダスト→間合：２。'
    }, {
      id: '21-kamuwi-o-n-6',
      name: '血晶乱流',
      namejp: '血晶乱流',
      baseType: 'normal',
      types: ['action', 'fullpower'],
      text: '选择2项，按由上至下的顺序执行（不能选择同一项2次）：\n1.进行一次“攻击距离5-9 伤害4/1”的攻击；\n2.若当前距离大于等于5，则距（2）→虚\n3.进行一次“攻击距离2-4 伤害2/2”的攻击；\n4.虚（2）→自装',
      textjp: '以下から異なる2つを選び、上から順に行う。\n・攻撃『適正距離5-9、4/1』を行う。\n・現在の間合が5以上ならば、間合→ダスト:２。\n・攻撃『適正距離2-4、2/2』を行う。\n・ダスト→自オーラ：2。'
    }, {
      id: '21-kamuwi-o-n-7',
      name: '血飞沫',
      namejp: '血飛沫',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '2',
      text: '禁忌+1～【展开时】进行一次“攻击距离3 伤害2/2 不可被闪避”的攻击。\n----\n破绽\n【展开中】若任意数量的樱花结晶将被移动至敌装，则不将其移至敌装，而改为移至虚。若如此做，从此牌上移除1个樱花结晶。',
      textjp: '＜禁忌+1＞【展開時】攻撃『適正距離3、2/2、不可避』を行う。\n----\n隙\n【展開中】相手のオーラへと桜花結晶が移動するならば、それは代わりにダストへと移動する。そうした場合、このカードの上から桜花結晶を1つダストに送る。',
      textkururu: [{
        if: '<i class="i-jinji">禁忌+1</i>',
        ctn: '【展开时】进行一次“攻击距离3 伤害2/2 不可被闪避”的攻击。'
      }, {
        ctn: '破绽\n【展开中】若任意数量的樱花结晶将被移动至敌装，则不将其移至敌装，而改为移至虚。若如此做，从此牌上移除1个樱花结晶。'
      }],
      textkururujp: [{
        if: '<i class="i-jinji">禁忌+1</i>',
        ctn: '【展開時】攻撃『適正距離3、2/2、不可避』を行う。'
      }, {
        ctn: '隙\n【展開中】相手のオーラへと桜花結晶が移動するならば、それは代わりにダストへと移動する。そうした場合、このカードの上から桜花結晶を1つダストに送る。'
      }]
    }],
    special: [{
      id: '21-kamuwi-o-s-1',
      namejp: '灯',
      name: '灯',
      baseType: 'special',
      cost: '5',
      types: ['action'],
      text: '禁忌+3～将自气中的所有樱花结晶移至虚，对自命造成1点伤害。将『晓』从追加牌区以未使用状态加入王牌。\n----',
      textjp: '＜禁忌+3＞あなたのフレアにある桜花結晶すべてをダストに送り、あなたのライフに1ダメージを与える。\n追加札から「暁」を未使用で得る。\n----',
      textkururu: [{
        if: '<i class="i-jinji">禁忌+3</i>',
        ctn: '将自气中的所有樱花结晶移至虚，对自命造成1点伤害。将『晓』从追加牌区以未使用状态加入王牌。'
      }],
      textkururujp: [{
        if: '<i class="i-jinji">禁忌+3</i>',
        ctn: 'あなたのフレアにある桜花結晶すべてをダストに送り、あなたのライフに1ダメージを与える。\n追加札から「暁」を未使用で得る。'
      }]
    }, {
      id: '21-kamuwi-o-s-2',
      name: '阡',
      namejp: '阡',
      baseType: 'special',
      cost: '3',
      types: ['enhance'],
      capacity: '4',
      text: '禁忌+2～【展开时】进行一次“攻击距离3-4 伤害3/3 不可被对应（通常牌）”的攻击，对自命造成1点伤害。\n----\n【常时】若此牌上置有樱花结晶，则你不能因敌命中樱花结晶的数目降至0或叙述为“你赢得本局游戏”的牌的效果而赢得本局游戏。',
      textjp: '＜禁忌+2＞【展開時】攻撃『適正距離3-4、3/3、対応不可（通常札）』を行い、あなたのライフに1ダメージを与える。\n----\n【常時】このカードの上に桜花結晶が置かれているならば、あなたは勝利できない。',
      textkururu: [{
        if: '<i class="i-jinji">禁忌+2</i>',
        ctn: '【展开时】进行一次“攻击距离3-4 伤害3/3 不可被对应（通常牌）”的攻击，对自命造成1点伤害。'
      }, {
        ctn: '【常时】若此牌上置有樱花结晶，则你不能因敌命中樱花结晶的数目降至0或叙述为“你赢得本局游戏”的牌的效果而赢得本局游戏。'
      }],
      textkururujp: [{
        if: '<i class="i-jinji">禁忌+2</i>',
        ctn: '【展開時】攻撃『適正距離3-4、3/3、対応不可（通常札）』を行い、あなたのライフに1ダメージを与える。'
      }, {
        ctn: '【常時】このカードの上に桜花結晶が置かれているならば、あなたは勝利できない。'
      }]
    }, {
      id: '21-kamuwi-o-s-3',
      name: '尸',
      namejp: '尸',
      cost: '1',
      baseType: 'special',
      types: ['attack', 'reaction'],
      range: '0-6',
      damage: '0/0',
      text: '【攻击后】本回合内，对手下一次使用被对应的《攻击》的使用者的牌时，必须从手牌中弃置1张该女神的牌作为费用。\n----\n【即再起】你的禁忌槽的值变为6的倍数。',
      textjp: '【攻撃後】このターン中、このカードが対応した《攻撃》を行ったメガミのカードを相手が次に使用するならば、追加コストとして手札からそのメガミのカードを1枚を捨て札にしなくてはならない。\n----\n【即再起】あなたの禁忌ゲージが6の倍数になる。'
    }
    , {
      id: '21-kamuwi-o-s-4',
      name: '理',
      namejp: '理',
      cost: '3',
      baseType: 'special',
      types: ['action'],
      text: '【常时】仅当自命中的樱花结晶的数目小于等于6时可以使用此牌。\n虚（1）→自命\n【使用后】对手使用《行动》王牌时，必须从手牌中弃置1张具共通使用者的牌作为额外费用。',
      textjp: '【常時】あなたのライフが6以下でないと、このカードは使用できない。\nダスト→自ライフ：1。\n【使用済】相手が《行動》の切札を使用するならば、追加コストとして手札から同一のメガミのカード1枚を捨て札にしなくてはならない。'
    }],
    extra: [{
      id: '21-kamuwi-o-s-1-ex1',
      name: '晓',
      namejp: '暁',
      extraFrom: '21-kamuwi-o-s-1',
      baseType: 'special',
      cost: '6',
      types: ['attack'],
      range: '3-7',
      damage: '6/4',
      text: '超克\n【常时】若此《攻击》被通常牌对应，则不结算该牌，而改为将其置入弃牌区，此《攻击》得-1/+0；若被王牌对应，则不结算该牌，而改为将其变为使用后状态，此攻击得-1/-1。\n【攻击后】将此牌移出游戏。',
      textjp: '超克\n【常時】この《攻撃》が通常札に対応されたならば、それを解決する代わりに捨て札に置き、この《攻撃》を-1/+0する。切札に対応されたならば、それを解決する代わりに使用済にし、この《攻撃》を-1/-1する。\n【攻撃後】このカードを取り除く。'
    }]
  }]
},
{
  name: 'RENRI 恋离',
  namejp: 'レンリ',
  desc: '伪证～每当你由主要阶段的规则效果使用通常牌时，展示该牌前，你可以声称将要使用的牌为某种具有伪证关键字的牌以进行一次伪证，每种牌每回合限一次。若对手不进行反证，则该牌背面朝上视为所声称的牌使用，结算完毕后盖伏该牌。否则展示该牌，若该牌并非所声称的牌，则不使用该牌，而改为将其置入弃牌区；若该牌为所声称的牌，则对手承受1次焦躁伤害，你使用该牌。',
  descjp: '偽証～通常札を通常の方法で使うならば、偽証を持つ各カードとして1回ずつ偽証できる。反証されなければ偽証通り使用して伏せ札にする。反証され、偽物なら使用できず捨て札となる。本物なら相手は焦燥を受け、カードも使用する。',
  list: [{
    name: '衣',
    namejp: '衣',
    isSelect: false,
    pic: 'twiicon_sa_39.jpg',
    picq: 'sd_renri.png',
    normal: [{
      id: '22-renri-o-n-1',
      name: '荼酷谩言',
      namejp: '嘘突き',
      baseType: 'normal',
      types: ['attack'],
      range: '1-2',
      damage: '2/1',
      text: '伪证\n【常时】若此伪证未被反证，则你可以展示用于伪证的牌。若该牌并非此牌，则对手不能选择由装承受此《攻击》的伤害。若你展示了该牌，则结算完毕后，不将该牌置入盖牌区，而改为置入弃牌区。',
      textjp: '偽証\n【常時】この偽証が反証されなかったならば、このカードを公開してもよい。それが偽物だったならば、相手はオーラへのダメージを選べない。\n（公開したならば解決後に捨て札になる）'
    }, {
      id: '22-renri-o-n-2',
      name: '骛虚谝言',
      namejp: '都度討ち',
      baseType: 'normal',
      types: ['attack'],
      range: '3-5',
      damage: '2/1',
      text: '伪证\n【常时】若你的弃牌区与付与区的通常牌的张数之和大于等于3，则此《攻击》获得+1/+0。',
      textjp: '偽証\n【常時】あなたの捨て札と付与札に通常札が合計3枚以上あるならば、この《攻撃》は+1/+0となる。'
    }, {
      id: '22-renri-o-n-3',
      name: '涂污谗言',
      namejp: '玄塗り',
      baseType: 'normal',
      types: ['attack', 'reaction'],
      range: '1-5',
      damage: '1/2',
      text: '伪证（对应时不能进行伪证）\n【攻击后】若本回合内有樱花结晶移出虚，则被对应的《攻击》结算以下效果。\n若该《攻击》的对装伤害大于等于3则获得-1/+0，否则获得+0/-1。',
      textjp: '偽証（偽証は対応では行えない）\n【攻撃後】このターン中にダストから桜花結晶が移動しているならば、対応した《攻撃》に以下を行う。\nその《攻撃》はオーラへのダメージが3以上ならば-1/+0、そうでないならば+0/-1となる。'
    }, {
      id: '22-renri-o-n-4',
      name: '唆使',
      namejp: '煽り殺陣',
      baseType: 'normal',
      types: ['action'],
      text: '对手畏缩。\n若对手本回合内曾反证失败，则你可以从弃牌中选择1张具伪证关键字的牌置入手牌。',
      textjp: '相手を畏縮させる。\nこのターン中に相手が反証に失敗しているならば、あなたの捨て札にある偽証を持つカードを1枚を選び、手札に戻してもよい。'
    }, {
      id: '22-renri-o-n-5',
      name: '鹘鹜谖言',
      namejp: '雲喰い',
      baseType: 'normal',
      types: ['action'],
      text: '伪证\n若你的弃牌区与付与区中的通常牌的张数之和大于等于3，则对手盖伏1张手牌。若对手不能如此做，则对手畏缩。\n【常时】若此伪证被对手反证，且用于伪证的牌为此牌，则对手因反证失败受到的焦躁改为2次。',
      textjp: '偽証\nあなたの捨て札と付与札に通常札が合計３枚以上あるならば、相手は手札を1枚伏せ札にする。伏せ札にしようとした上で行えないならば、相手を畏縮させる。\n【常時】この偽証に反証されてこのカードが本物だったならば、相手は焦燥を1回でなく2回受ける。'
    }, {
      id: '22-renri-o-n-6',
      name: '辜毒谄言',
      namejp: '魚吊り',
      baseType: 'normal',
      types: ['action', 'reaction'],
      text: '伪证（对应时不能进行伪证）\n距（1）→虚',
      textjp: '偽証（偽証は対応では行えない）\n間合→ダスト：1。'
    }, {
      id: '22-renri-o-n-7',
      name: '蛊惑',
      namejp: '惹き騙り',
      baseType: 'normal',
      types: ['enhance'],
      capacity: '3',
      text: '【展开时/破弃时】若当前距离大于等于2，则距（1）→虚',
      textjp: '【展開時/破棄時】現在の間合が2以上ならば、間合→ダスト：1。'
    }],
    special: [{
      id: '22-renri-o-s-1',
      name: '谰戾淋漓',
      namejp: 'ルルララリ',
      cost: '4',
      baseType: 'special',
      types: ['attack'],
      range: '0-10',
      damage: '1/2',
      text: '【常时】若本回合内对手曾反证失败，则此攻击对敌装和敌命均造成伤害。\n【使用后】你的结束阶段开始时，对敌装造成1点伤害，然后将此牌变为未使用状态。',
      textjp: '【常時】この《攻撃》がダメージを与えるに際してこのターン中に相手が反証に失敗しているならば、相手は片方を選ぶのでわなく両方のダメージを受ける。\n【使用済】あなたの終了フェイズに相手のオーラに1ダメージを与え、このカードを未使用に戻す。'
    }, {
      id: '22-renri-o-s-2',
      name: '立睖凌厉',
      namejp: 'ラナラロミレリラ',
      cost: '4',
      baseType: 'special',
      types: ['action', 'reaction'],
      text: '【常时】仅当进行对应时可以使用此牌。\n检视对手的手牌，你可以从中选择1张其他女神的不具《全力》副类别的牌。若如此做，则你可以使用或盖伏该牌。所使用的牌视为对应了此牌对应的《攻击》。',
      textjp: '【常時】このカードは対応でしか使用できない。\n相手の手札を見て、《全力》でない他のメガミのカード1枚を選んでもよい。そうした場合、そのカードを使用するか伏せ札にする。使用されたカードはこのカードが対応している《攻撃》に対応しているものと扱う。'
    }, {
      id: '22-renri-o-s-3',
      name: '论理怜悧',
      namejp: 'オリレテラレル',
      cost: '2',
      baseType: 'special',
      types: ['action', 'reaction'],
      text: '从眼前构筑时未选用的具伪证关键字的通常牌中选择1张，展示之，然后使用该牌。若此牌对应了一个《攻击》，则视为该牌也对应了该《攻击》。然后将该牌移出游戏。\n----\n【再起】你的弃牌区与付与区中的通常牌的张数之和大于等于3。',
      textjp: '眼前構築で選んでいないあなたの通常札から偽証を持つ1枚を公開し、それを使用する。その後、それを取り除く。このカードが対応している《攻撃》があるならば、使用されたカードはそれに対応しているものと扱う。\n----\n【再起】あなたの捨て札と付与札に通常札が合計3枚以上ある。'
    }, {
      id: '22-renri-o-s-4',
      namejp: '夜山恋離のなれの果て',
      name: '夜山恋离的终幕',
      baseType: 'special',
      cost: '1',
      types: ['enhance'],
      capacity: '3',
      text: '终端\n【展开时】将『铭镌之衣』从追加牌区以未使用状态加入王牌。\n【展开中】仅当你的准备阶段移除所有《付与》牌上的樱花结晶时可以移除此牌上的樱花结晶。',
      textjp: '終端\n【展開時】追加札から「刻まれし衣」を未使用で得る。\n【展開中】この付与札の上の桜花結晶はあなたの開始フェイズの処理でしか移動しない。'
    }],
    extra: [{
      id: '22-renri-o-s-4-ex1',
      extraFrom: '22-renri-o-s-4',
      name: '铭镌之衣',
      namejp: '刻まれし衣',
      baseType: 'special',
      cost: 'X',
      types: ['variable'],
      text: '【常时】根据你的『夜山恋离的终幕』上的樱花结晶的数目，此牌成为以下牌的复制。\n大于等于3……『久远之花』\n2……『完全论破』\n1……『夙愿』\n0……『御剑桐子的巫女神乐』',
      textjp: '【常時】このカードはあなたの「夜山恋離のなれの果て」の上の桜花結晶の個数に応じて、以下のカードの複製となる。\n3以上…「久遠ノ花」\n2…「完全論破」\n1…「望我」\n0…「御劔桐子の巫女神楽」'
    }, {
      id: '22-kiriko-o-s-4',
      name: '御剑桐子的巫女神乐',
      namejp: '御劔桐子の巫女神楽',
      baseType: 'special',
      cost: '3',
      types: ['attack'],
      range: '2-3',
      damage: '3/2',
      text: '【使用后】若你由剑舞执行基本动作《装附》，则你可以选择不执行基本动作《装附》，而改为执行基本动作《聚气》。\n【使用后】每当你进行本回合内的第3次剑舞时，结算完毕后你可以使用此牌。（需要支付费用）',
      textjp: '【使用済】あなたが剣舞により基本動作《纏い》を行うならば、代わりに基本動作《宿し》を行ってもよい。\n【使用済】あなたがこのターンに3回目の剣舞を行った時、このカードを使用してもよい。（消費を支払う）'
    }]
  }]
}
]

//为了chrome插件输出需要数据
// Sakura.forEach(a=>{
//   a.list.forEach(b => {
//     if (b.normal) {
//       var a = [];
//       b.normal.map(item => {
//         a.push({
//           id: item.id,
//           name: item.name,
//           namejp: item.namejp,
//         })
//       })
//       b.normal = a
//     }
//     if (b.special) {
//       var a = [];
//       b.special.map(item => {
//         a.push({
//           id: item.id,
//           name: item.name,
//           namejp: item.namejp,
//         })
//       })
//       b.special = a
//     }
//     if (b.changenormal) {
//       var a = [];
//       b.changenormal.map(item => {
//         a.push({
//           id: item.id,
//           name: item.name,
//           namejp: item.namejp,
//         })
//       })
//       b.changenormal = a
//     }
//     if (b.changespecial) {
//       var a = [];
//       b.changespecial.map(item => {
//         a.push({
//           id: item.id,
//           name: item.name,
//           namejp: item.namejp,
//         })
//       })
//       b.changespecial = a
//     }
//     if (b.extra) {
//       var a = [];
//       b.extra.map(item => {
//         a.push({
//           id: item.id,
//           name: item.name,
//           namejp: item.namejp,
//         })
//       })
//       b.extra = a
//     }
//     if (b.changeExtra) {
//       var a = [];
//       b.changeExtra.map(item => {
//         a.push({
//           id: item.id,
//           name: item.name,
//           namejp: item.namejp,
//         })
//       })
//       b.changeExtra = a
//     }
//     if (b.poison) {
//       var a = [];
//       b.poison.map(item => {
//         a.push({
//           id: item.id,
//           name: item.name,
//           namejp: item.namejp,
//         })
//       })
//       b.poison = a
//     }
//     if (b.transform) {
//       var a = [];
//       b.transform.map(item => {
//         a.push({
//           id: item.id,
//           name: item.name,
//           namejp: item.namejp,
//         })
//       })
//       b.transform = a
//     }
//     if (b.changeTransform) {
//       var a = [];
//       b.changeTransform.map(item => {
//         a.push({
//           id: item.id,
//           name: item.name,
//           namejp: item.namejp,
//         })
//       })
//       b.changeTransform = a
//     }
//   })
// })
// console.log(Sakura)

export default Sakura
// window.sakuraData = Sakura;