export default [

  {
    'date': '2026-06-07',
    'author': '可爱的北岸',
    'name': '伞锤大魔像',
    'desc': '双黄cos大魔像。纯开伞标准构筑，非常适配新版无常其心，无常大地碎的配合非常强，粘在脸上很多pick对这玩意没啥办法。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=5+0,7+0&girlscard1=0,2,3,5+1,2&girlscard2=0,1,2+2'
  },
  {
    'date': '2026-06-07',
    'author': '可爱的北岸',
    'name': '铳骑走A',
    'desc': '凶弹 零时 狂想 ae ob 黑盒 随便选，整体考虑到油量的花费抉择we和stc。再演铳的后退能力大幅度增强，麦林手感相当之好。满集中的情况下，铳本家2距离脱3后退4后跳5麦林6可以直接衔接到速射，所以零时是可以进连段的，采用比新幕会多一些，相应领域就不厉害了。也因此在后退的过程中可以把中距刀甩出来。这里配合3-7的bs更是随便退，一边退一边甩ae难以想象有多爽。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=2+0,10+0&girlscard1=0,1,2,4,5+0,1&girlscard2=0,1+0'
  },
  {
    'date': '2026-06-07',
    'author': '组卡器Bot',
    'name': '26-06完全战上位-拒毒（试练）',
    'desc': '拒毒試で優勝 //x.com/Zico_furuyoni/status/2063548853924897139',
    'decklink': '//sdrice.name/random/?ver=res1&lang=jp&isShow=1&girls=1+2,14+1&girlscard1=0,2,3,6+0,2&girlscard2=1,4,5+0'
  },
  {
    'date': '2026-06-08',
    'author': '横浜MYGO！',
    'name': '新时代铳镰',
    'desc': '开着神奇小鹿冰被的时候随便吃什么攻击都能绝唱，实质绝对防御',
    'decklink': '//sdrice.name/random/?ver=res1&lang=jp&isShow=1&girls=1+2,14+1&girlscard1=0,1,2,6+0,2&girlscard2=0,1,5+0'
  },
  {
    'date': '2026-06-08',
    'author': 'Reinhard',
    'name': '忍毒',
    'desc': '版本更新替换了幽默斩首，暗器成为非常优秀的6装对应以及全力装压下毒手段，有效避免了毒针打不中的难题。然后再演更新的忍的2刀距离更加友好且和飞苦无更好适配。分身可以拿去盖毒雾打11叠1赚ap差。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=4+0,8+0&girlscard1=0,1,2+3&girlscard2=0,2,3,4+0,2'
  },
  {
    'date': '2026-06-08',
    'author': 'Reinhard',
    'name': '毒爪',
    'desc': '新的缠毒给了1/2人很好的斩杀手段，爪比较适配这一套思路，基本就是前期站2用兽爪压血，无脑跑风轴，斩杀轮缠毒开启后风轴2刀22+霞毒一刀22配合4手（风雷爪此时也是22）',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=8+0,11+0&girlscard1=0,2,3,4,5+1,2&girlscard2=0,1+2'
  },
  {
    'date': '2026-06-08',
    'author': '秦雨',
    'name': '雪橇车',
    'desc': '两个增加了攻击距离的女神一拍即合，成为新时代的阴间pick。主思路是7距开始、11ae、21骑动、雪刃、寒雪、前进1或者后退1、11ae、冻僵，打完5/7距对面2甲3冻，下回合可以33感谢炮打血，这一套打中就赢了一半了。上述思路只需要2王牌位+4通常牌，其他卡位非常灵活多变，比如针对一些减伤的对应，带霜之棘，就有32/42骑动和44感谢炮；针对爪这种近距离，带倒车退；针对橇、伞这张单卡攻击收益高的，带ts；针对刀这种大切，带变身下气，就算防你的naga，也能变抽牌斩杀。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=10+0,14+0&girlscard1=0,1,3+0&girlscard2=0,1,2,5+0,2'
  },
  {
    'date': '2026-06-08',
    'author': '可爱的北岸',
    'name': '伞橇闭',
    'desc': '往后走的时候，预演拒引总是能打出装，这时候冻一冻对手不好前进。别的没了。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=5+0,14+0&girlscard1=0,1,2,4+0,3&girlscard2=0,2,5+2'
  },
  {
    'date': '2026-06-08',
    'author': '晓夜神香',
    'name': '刀扇（再演起源环境）',
    'desc': '卡位非常灵活，无穷之风、诗舞甚至身法都不是必带卡。这套是全输出，核心要义是假装自己有浦/花，注意藏好信息，保证自己拥有战略先手权的情况下才能发挥最大威力。注：环境为再演起源。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=0+0,3+0&girlscard1=0,1,4+0&girlscard2=0,2,3,6+1,2'
  },
  {
    'date': '2026-06-08',
    'author': '小朋',
    'name': '忍薙',
    'desc': '分身术投入之后，再演的忍薙真正意义上摆脱了对全力的依赖，中盘对于一些控制卡组的立回丝滑程度比之前好了很多。自然卡位是有摇摆的。和老版本差别不大，对近战的圈域。以及全力的无音和斩乱仍然是可选向。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=1+0,4+0&girlscard1=0,1,2,3+0,2&girlscard2=0,2,4+3'
  },
  {
    'date': '2026-06-09',
    'author': '秦雨',
    'name': '嗷呜忍',
    'desc': '最强的天雷轴我能想到的只有忍和铳的天雷了，其他天雷的轴至少弱两个梯度了。现在只有o将的环境天雷还是很有压制力的，等a将全开放之后也会泯然众人矣吧。对比新幕把兽爪的卡位给到了分身术，算是小加强。卡位上是锁死的，钢丝诱导影菱配合虚鱼，分身牌效最高，斩乱配合洗牌诱导钢丝打命（对面能防住斩乱我建议带个风雷击打长盘或者换beat），疾跑拉距，狗叫打雷，壬曼加速启动，天雷就不用说了。打法基本上是公式化，前2t狗叫+为3t准备，3t壬曼虚鱼，其他忍的牌能打多少打多少，能往前走几步就尽量走，手里留斩乱，3t结束是打一张钢丝是4雷，4t洗牌诱导钢丝斩乱7雷，5t壬曼8雷，6t狗叫16雷，洗牌诱导影菱18雷。前4t基本上是没什么问题，5t能抽到狗叫直接打也是可以的，6t能打完一套保证设置都是全的。算伤害时务必多思考，手里留不留诱导，钢丝影菱打不打，吃不吃焦躁保设置，对面伤害和对应有多少，算明白才能提高天雷的胜率。',
    'decklink': 'sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=4+0,11+0&girlscard1=0,1,2,3,5+2,3&girlscard2=3,5+1'
  },
  {
    'date': '2026-06-09',
    'author': '零望',
    'name': '标准对砍薙橇',
    'desc': '六红+绝零/冻僵 看对面资源选 穷选绝零 富选冻僵 个人实际操作感觉冻僵效果好一点 可配合寒雪雪刃冻满 距离合适伤害足够 偏新手卡组',
    'decklink': 'sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=1+0,14+0&girlscard1=0,1,2+0&girlscard2=0,1,2,5+0,2'
  },
  {
    'date': '2026-06-09',
    'author': 'Reinhard',
    'name': '爪橇天雷轴',
    'desc': '可替换组件非常多，如回旋换橇的俩对应/带风雷击兽爪抢乌龟流的血等，核心思路是依靠反复再起飞雪快速刷槽，常见再起手段有飞雪冻僵再起飞雪/飞雪雪刃飞雪。这套天雷优势在有寒霜提供的额外+1+1以及可以前置铺垫冻僵让对面无法叠装防御。S9的时候拿这套上过线上赛4强，再演虽然回旋削弱但是橇增强了，仍是一套可玩的思路',
    'decklink': 'sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=11+0,14+0&girlscard1=5+1,3&girlscard2=0,1,2,4,5,6+2'
  },
  {
    'date': '2026-06-09',
    'author': '貉耳萌',
    'name': '铳车（橇）',
    'desc': '目前再演起源环境玩下来非常公式又强力的pick。80%的情况下不用改一张牌。第一波起手调度很重要。事先想好自己要再几t打（一般情况下是先手3t爆发或者后手2t爆发），然后根据你要爆发的回合来调度自己的手牌。举例：比如我要在3t爆发、那我就把手上的速射和爆弹反冲给洗到牌库底，或者只洗爆弹反冲，留一个速射在手上。调度上来的后跳/we都是可以在1/2t给你盖掉的，然后在你不想打爆发的回合也可以甩一个射击，无论是打对面装给你装付，还是打命直接停都可以。然后在你的爆发回合，你的手牌要保证是：bs、爆弹反冲、速射、回燃（也可以是射击）。然后因为你前两回合有聚气机会、这里只要有2气，你就可以ae和凶弹起手，这两张牌你甚至可以在5距离打，所以一巡你基本上一定可以打出来一套。然后两张王牌红打完还给你凑了连火，可以回燃bs接速射，先把32都甩了，最后打爆弹，然后11可以不甩，或者是回燃buffae，这些都要看情况选择。一般你这一套打完起码是可以退到7距并且给对面上个畏缩，对面装量应该在0或1左右，然后你停一个回合，下下个回合准备拿牌库斩杀。这时候如果你在3距及以下，就狂想把射击盖了；如果你在4距然后你的气足够打3个ae的话，注意算一下自己的ap足不足够前进we然后再退到自己需要的距离，如果可以就盖射击，不行就盖we；5距及以上的距离，就把we盖了留射击。这一套车铳打两波基本上是一定能把人打死的。然后在ban人方面，像是书/毒这两个铳怕的一般都得上ban位，然后因为我这套车橇没有铳抗性，我也会选择把铳ban掉。总的来说车铳还是比较简单的，如果不知道steam环境该玩什么强力pick的话，我先推荐一下车铳。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=2+0,10+0&girlscard1=0,1,2,4,5+0,2&girlscard2=0,1+0'
  },
  {
    'date': '2026-06-10',
    'author': '借栗打栗',
    'name': '络唐',
    'desc': '传统老轴，尽管魔能改三气对开局的单纳模组有一定的影响，但是对后续的循环不产生影响，且再演的改动目前不影响其他卡，目前这个轴还是可以使用的。懒得写了，看这个吧（https://www.bilibili.com/opus/526891014329105614）此外，七三开局不适用于这个版本，请自动忽略',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=9+0,18+0&girlscard1=2,5,6+0,2&girlscard2=1,2,3,5+0'
  },
  {
    'date': '2026-06-10',
    'author': '借栗打栗',
    'name': '络唐',
    'desc': '大魔像轴，同样的问题，三气会对单纳模组有一定的影响，影响相对较小，但是对后续的循环不产生影响，且再演的改动目前不影响其他卡，目前这个轴还是可以使用的。懒得写了，看这个吧（https://www.bilibili.com/opus/484340412547314185）此外，七三开局不适用于这个版本，请自动忽略（对的，我就是在复自黏贴）',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=9+0,18+0&girlscard1=1,2,3,5,6+0,1&girlscard2=3,6+0'
  },
  {
    'date': '2026-06-10',
    'author': 'sanity',
    'name': '再演无敌铳忍',
    'desc': '打远程换针对牌（例如完爆），调度思路：1.回燃或者反冲控底，2t后跳装填全打，盖牌盖诱导。2.装填后跳全去底，2t正常打一波。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=2+0,4+0&girlscard1=0,1,2,4,5,6+2,3&girlscard2=5+3'
  }
]