export default [
  {
    'date': '2022-01-12',
    'author': '多肉葡萄',
    'name': '21-11武汉完全上位-古恐',
    'desc': '气魄梳流，风晴连打。前期快速开出八重樱削血，4-5血左右开气焰，花晴梳流全部都是2血。',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=0+1,3+2&girlscard1=4,6+2&girlscard2=0,1,3,5,6+0,2'
  },
  {
    'date': '2022-01-17',
    'author': '组卡器BOT',
    'name': '21-12日本上位-书信',
    'desc': '矢向完全戦通常選択で優勝しましたーサイネ間に合って良かったー選出：書信1回戦：書剣○2回戦：傘衣○3回戦：書面○',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=6+0,16+1&girlscard1=2,3,4,5+0,3&girlscard2=0,1,3+1'
  },
  {
    'date': '2022-01-19',
    'author': '衰神',
    'name': 'TF一波流-台北茲大散櫻賽冠軍牌組',
    'desc': '造花燒光、對手攻擊通通血接，4~5血TF抽二，決死7手牌一套打死。',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=0+1,10+0&girlscard1=0,1,2+0&girlscard2=0,1,4,5+0,3'
  },
  {
    'date': '2022-01-19',
    'author': '衰神',
    'name': '21-04薙毒beat-巫鏡杯台灣區冠軍牌組',
    'desc': '只要攻擊牌都能打中就會贏',
    'decklink': '//sdrice.name/random.html?ver=S6-2&lang=cn&isShow=1&girls=1+0,8+0&girlscard1=0,1,2,3+0&girlscard2=0,1,2+0,2'
  },
  {
    'date': '2022-01-19',
    'author': '组卡器BOT',
    'name': '22-01日本上位-信棹',
    'desc': 'ババーン杯優勝しましたー(書)信棹-恐傘(面)(書)信棹-銃嵐(面)(書)信棹-(銃)扇剣書信棹-銃面剣シンラ……？知らない子ですね……エキシビションマッチの様子はあかさきチャンネルをご覧ください',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=jp&isShow=1&girls=16+1,18+0&girlscard1=0,1,2,3+1,2,3&girlscard2=3,4,6+'
  },
  {
    'date': '2022-01-20',
    'author': '组卡器BOT',
    'name': '22-01日本完全上位-伞面',
    'desc': '1/16 新公式大会 秋葉原イエサブ 完全戦三拾一捨 使用メガミ 恐傘仮 〇鏡剣(嵐) 〇刀剣(扇) 〇社絆(剣) 〇扇騎(剣) (こちらは全試合傘仮) で優勝しました！',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=5+0,19+0&girlscard1=4,5+3&girlscard2=0,1,3,4,6+0,1'
  },
  {
    'date': '2022-01-21',
    'author': '组卡器BOT',
    'name': '21-12韩国起源上位',
    'desc': '12/12 韓国ソウル定期大会、１２月のシーズン７の会ー起源戦 扇忍鏡で優勝しました。 形式 : 起源戦 三拾一捨 選択 : 扇忍鏡 ◯ 1回戦 扇鏡(忍) vs 忍鏡(銃) ◯ 2回戦 扇忍(鏡) vs 忍櫂(銃)',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=3+0,4+0&girlscard1=1,3,6+0,1,2&girlscard2=0,1,2,4+'
  },
  {
    'date': '2022-01-21',
    'author': '组卡器BOT',
    'name': '21-11韩国完全上位',
    'desc': '2021年11月20日 今日の韓国ソウルふるよに完全戰大会（ゲムマ秋の記念大会）で炎忍鏡で優勝しました。 1回戦 ○忍鏡(炎)vs嵐鏡(面) 2回戦 不戦勝 3回戦 ○鏡炎(忍)vs薙古(書)',
    'decklink': '//sdrice.name/random.html?ver=S6-2&lang=cn&isShow=1&girls=2+1,15+0&girlscard1=1,4,5+1&girlscard2=0,1,3,5+0,1'
  },
  {
    'date': '2022-01-21',
    'author': '组卡器BOT',
    'name': '21-11日本起源上位',
    'desc': 'らみぃふるよに平日大会 起源戦通常選択 刀忍で出場 VS騎橇 勝ち VS薙鏡 勝ち',
    'decklink': '//sdrice.name/random.html?ver=S6-2&lang=cn&isShow=1&girls=0+0,4+0&girlscard1=0,1,2+0,1,3&girlscard2=0,1,2,4+'
  },
  {
    'date': '2022-01-21',
    'author': '组卡器BOT',
    'name': '21-11日本完全上位',
    'desc': '11月30日らみぃふるよに平日大会 完全戦三拾一捨 炎忍嵐で出場 炎嵐VS傘鎚(銃) 勝ち 忍嵐VS薙騎(毒) 勝ち',
    'decklink': '//sdrice.name/random.html?ver=S6-2&lang=jp&isShow=1&girls=4+0,11+1&girlscard1=0,1,4+1&girlscard2=1,2,3,5+0,2'
  },
  {
    'date': '2022-01-21',
    'author': 'Reinhard',
    'name': '21-12武汉完全上位-古金',
    'desc': '最后一轮对手是忍伞，考虑到开伞威胁放弃了炉火选择了超反动，针对对手ap压制带了浮舟保证生存消耗不处于劣势。打铁压乱打，斩杀点有对手回合对应爆沙雷接55不可对应乱打，或者大山脉拉弃牌堆乱打完成直斩。',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=0+1,7+1&girlscard1=0,1,2,3,5+2&girlscard2=1,3+0,3'
  },
  {
    'date': '2022-01-21',
    'author': 'Rabadon',
    'name': '21-12北京完全上位-古兜（通常）',
    'desc': '近距离对砍，打不过最后靠「天主八龙阁」+「天音摇波的底力」结束游戏。「压制前进」可以看情况换「号令」或者「头阵」。',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=0+1,17+0&girlscard1=0,1,5+0,3&girlscard2=1,2,5,6+0'
  },
  {
    'date': '2022-01-21',
    'author': 'Rabadon',
    'name': '21-12北京完全上位-古兜',
    'desc': '因为对阵的是铳橇，所以决定收虚托疲劳，看最后有没有机会用「反攻」结束游戏。',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=0+1,17+0&girlscard1=5+1,2&girlscard2=1,2,3,4,5,6+0'
  },
  {
    'date': '2022-01-21',
    'author': 'Rabadon',
    'name': '21-12北京完全上位-恐兜',
    'desc': '极致的烫血，利用「战场」和「天主八龙阁」的buff给「畏掠」和「梳流」直接-/2，同样「悠久之雪」和「久远之花」偶尔也能吃到buff。',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=3+2,17+0&girlscard1=0,1,3,5,6+0,1&girlscard2=1,6+0'
  },
  {
    'date': '2022-01-21',
    'author': 'Rabadon',
    'name': '21-12北京完全上位-古恐（近战）',
    'desc': '常规的近战卡组，主恐可以带来更广的应对策略。combo有「畏掠」+「月影落」以及「暴沙雷」+「天音摇波的底力」。',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=0+1,3+2&girlscard1=4,5+0,3&girlscard2=0,1,3,5,6+0'
  },
  {
    'date': '2022-01-21',
    'author': 'BarbaraYang',
    'name': '22-01北京完全上位-琵琶镜',
    'desc': '常规情况下牌局早期可以适当卖血并在关键回合开启二重奏，利用双叶镜保护二重奏，下回合打出大量输出。此卡组为对阵古刀经书的非常规卡组，选择携带寄花以及镜之恶魔逼迫对方不断拉装完成斩杀。',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=1+1,15+0&girlscard1=0+1&girlscard2=0,1,2,3,4,6+0,2'
  },
  {
    'date': '2022-01-21',
    'author': 'Rabadon',
    'name': '21-12北京完全上位-古恐（远程）',
    'desc': '古恐的远程轴，利用「寄徒之八重樱」的效果配合「浮舟宿」的高效拉装，面对对手装压低的时候完全是暴打。',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=0+1,3+2&girlscard1=5+2&girlscard2=0,1,3,4,5,6+1,2'
  },
  {
    'date': '2022-01-21',
    'author': '小朋',
    'name': '21-12济南起源上位-铳扇（对铳薙）',
    'desc': '梳流特化铳扇，anti薙铳的卡组，思路是对面想铳对射，但铳扇方进4主打梳流（梳流回顶，后跳抽梳流继续打梳流），雅击/诗舞对付八面斩，同时风舞台卡距离不给铳薙后退机会',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=2+0,3+0&girlscard1=3,4+0,1&girlscard2=0,1,3,5,6+0'
  },
  {
    'date': '2022-01-21',
    'author': '郝二',
    'name': '21-12武汉起源上位-爪铳',
    'desc': '当时对手是书镜，铳起不到优势时，转换思路卡近距离打雷',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=2+0,11+0&girlscard1=0,5+0,1&girlscard2=0,3,4,5,6+1'
  },
  {
    'date': '2022-01-21',
    'author': 'xu992',
    'name': '21-08全国online完全上位-拒绝炎',
    'desc': '炎天卡组，所有牌都是为了能炎死对面，由于决赛打的唐络，有穿竹和kururu所以正常打红基本上打不穿对面，所以只能打炎天，顺便带了果果偷鸡（确实偷到了）。这套装压相当高，所有牌都是21，冲音晶也能硬刮一装，让对面不得不后退，而且由于是拒绝的关系，建议在手里攥死一张牌不漏，这样对面是不敢空装的，并且能够很好的帮炎天磨掉很多血。斩杀的核心是遗响壁和绝唱绝华，遗响壁是绝唱绝华必中的关键，多出来的一装给了绝唱绝华巨大的发挥空间，如此完美的斩杀居然只要6气。',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=1+2,2+1&girlscard1=0,2,3,4,5,6+2,3&girlscard2=1+1'
  },
  {
    'date': '2022-01-21',
    'author': '小朋',
    'name': '21-12济南起源上位-铳镰（对铳薙/镜薙）',
    'desc': 'anti镜/薙特化防御卡组（终末与虚伪二卡均能针对镜2爪连打/以及薙八面斩二连）',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=2+0,12+0&girlscard1=0,1,2,4+2&girlscard2=0,1,5+1,2'
  },
  {
    'date': '2022-01-21',
    'author': 'xu992',
    'name': '21-08全国online完全上位-拒绝炎（随便砍砍版）',
    'desc': '不得不说回燃里斩确实很爽，随便砍砍。',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=1+2,2+1&girlscard1=0,1,2,5,6+0,2&girlscard2=1,5+1'
  },
  {
    'date': '2022-01-21',
    'author': 'xu992',
    'name': '21-08全国online完全上位-炎经',
    'desc': '真正的女神往往只需要最为简单的构筑，9经圣典卡组，外挂个炎天恶心恶心对面。',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=2+1,6+1&girlscard1=+1&girlscard2=0,1,2,3,4,5,6+0,2'
  },
  {
    'date': '2022-01-21',
    'author': 'xu992',
    'name': '21-08全国online完全上位-拒绝经',
    'desc': '真正的女神往往只需要最为朴实的辅助，8经圣典卡组，识破极大的增强了经薄弱的防御面，外挂个绝唱绝华恶心恶心对面，让对面不敢打你。',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=1+2,6+1&girlscard1=3+2&girlscard2=1,2,3,4,5,6+0,2'
  },
  {
    'date': '2022-01-21',
    'author': '郝二',
    'name': '21-12武汉起源上位-伞铳',
    'desc': '对手是近距离组合，且前进手段弱时，常规的主铳思路。需要注意的是，要预判自己结缘的轮次，提前开伞，结缘就可以一卡退2。',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=2+0,5+0&girlscard1=0,1,2,4,5+0,3&girlscard2=2,6+0'
  },
  {
    'date': '2022-01-21',
    'author': 'pin',
    'name': '21-11昆明完全上位-薙勾',
    'desc': '比赛时候勾玉没削弱，独自醒来cost没有提高的前提下是通过闪樱的消耗，等3/2闪樱的时候可以在4距离打爆发，现在情况是独自醒来的气增多，所以薙勾的切构筑会放弃独自醒来可能换成此旗，卡组冲音视对手可换成薙刀斩',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=1+0,13+1&girlscard1=0,2,5+0&girlscard2=0,1,3,5+0,2'
  },
  {
    'date': '2022-01-24',
    'author': '耗子没吃饱',
    'name': '22-01武汉起源上位-薙书',
    'desc': '',
    'decklink': '//sdrice.name/random.html?ver=chS6-2&lang=cn&isShow=1&girls=1+0,6+0&girlscard1=0,1,2,6+0,2,3&girlscard2=0,1,3+'
  },
  {
    'date': '2022-02-14',
    'author': '组卡器BOT',
    'name': '22-02韩国起源上位-络骑',
    'desc': '今日の韓国ソウル大会、起源戦優勝しました！ くるるで優勝...！ １回戦 勝 扇騎(絡)  vs 薙棹(書) 2 回戦 勝 騎絡(扇)  vs 薙棹(書)',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=9+0,10+0&girlscard1=0,2,3,5,6+0,2,3&girlscard2=0,1+'
  },
  {
    'date': '2022-02-14',
    'author': '组卡器BOT',
    'name': '22-02韩国完全上位-伞镜',
    'desc': '韓国2022年初のふるよに大会 完全戦 傘鏡面 鏡面(傘) O vs 薙鏡(劍) 傘鏡(面) O vs 拒絶 花 (扇)',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=5+0,15+0&girlscard1=0,2,3+1&girlscard2=0,1,3,4+0,2'
  },
  {
    'date': '2022-02-14',
    'author': '暗昏千鸟',
    'name': '2.12-2.13 16人组网战冠军——毒薙剑（毒剑部分）',
    'desc': '对战记录:薙剑（毒）胜镰铳（剑），毒薙（剑）胜岚剑（面），毒剑（薙）胜刀书（恐），毒薙（剑）胜铳剑（面）。本套毒剑舍弃毒针改用毒雾+灭灯 减少了遁术回合连段伤害的亏损，可以把遁术比较可靠的康给一闪/居合 同时卡住对面煽动，没带缠毒是觉得对面不敢打反驳流 而对面也被我预判到，只敢通常beat对a，自然不是毒剑对手',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=8+0,20+0&girlscard1=0,2,4+0&girlscard2=0,1,2,6+1,2'
  },
  {
    'date': '2022-02-14',
    'author': '暗昏千鸟',
    'name': '2.12-2.13 16人组网战冠军——毒薙剑（薙剑部分）',
    'desc': '对战记录:薙剑（毒）胜镰铳（剑），毒薙（剑）胜岚剑（面），毒剑（薙）胜刀书（恐），毒薙（剑）胜铳剑（面）本套为对抗镰铳的构筑，王牌在剑内战中可以考虑投入灯（不过当时我不敢）对抗镰铳思路先拉距离 以尸+碎冰拦第一波 攻击完后以无音壁架第二波 最后理压制灰灭/狂想即可',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=1+0,20+0&girlscard1=0,1,6+2&girlscard2=0,1,4,6+2,3'
  },
  {
    'date': '2022-02-14',
    'author': '暗昏千鸟',
    'name': '2.12-2.13 16人组网战冠军——毒薙剑（毒薙部分）',
    'desc': '对战记录:薙剑（毒）胜镰铳（剑），毒薙（剑）胜岚剑（面），毒剑（薙）胜刀书（恐），毒薙（剑）胜铳剑（面）。冠军争夺战对阵铳剑 以3毒套件压制对手铳侧辅助的发挥（回燃后跳狂想）以无音壁延后对手爆发回合，最终过一尸斩杀铳剑。打岚剑则更偏极限爆发，使用霞毒+碎冰+律动的组合进行斩杀（响鸣也吃理，故不携带），碎冰用来逼阡/资源立回有显著效益',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=1+0,8+0&girlscard1=0,2,6+0,2&girlscard2=0,1,2,4+0'
  },
  {
    'date': '2022-02-27',
    'author': '暗昏千鸟',
    'name': '2/27日“新生せし英雄”杯网战32人组冠军——绊信剑（绊信部分）',
    'desc': '对战记录：绊信（剑）胜（薙）剑面；绊信（剑）胜面恐（薙）；（绊）信剑胜薙剑（铳）；绊信（剑）胜伞剑（面）；绊剑（信）胜岚面（剑）。说实话，打完比赛发现还是毒更好（悲），绊也就起了一个让对面去择防绊毒导致操作变形的作用，这套是毒掩护潜水，利用逆风水雷球/奋迅入1绊毒斩杀的思路，切换为纯中距打法的话奋迅换为油伞，绊毒换为霞毒/海域都可，开潜雷回合不用特地照顾，开新航道的时候可以丢毒针/灭灯掩护顺风（照顾给潜雷也可）顺风后1命1装在毒体系下约等于2命，非常凶悍。',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=8+1,16+1&girlscard1=0,1,2,5+0,3&girlscard2=0,1,3+3'
  },
  {
    'date': '2022-02-27',
    'author': '暗昏千鸟',
    'name': '2/27日“新生せし英雄”杯网战32人组冠军——绊信剑（信剑部分）',
    'desc': '对战记录：绊信（剑）胜（薙）剑面；绊信（剑）胜面恐（薙）；（绊）信剑胜薙剑（铳）；绊信（剑）胜伞剑（面）；绊剑（信）胜岚面（剑）。不得不说，潜水的强度，非常之高，对面薙剑都没有什么好的破潜水手段，着实是赚足了价值（总不能带冲音晶圈域之类的破把，而刀基本上都有被潜水躲避的风险），刀吃完潜水还要吃尸卡连段，而海域也成功打了伤害+干扰对面蓄爆节奏，并且造了一次对面4装给散华吃到优质价值，速度降低下我携带的血晶乱流和全力四剑拉了不小的ap差距，最终在对面没开律动之前斩杀对手',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=16+1,20+0&girlscard1=0,3+3&girlscard2=0,1,2,5,6+1,2'
  },
  {
    'date': '2022-02-27',
    'author': '暗昏千鸟',
    'name': '2/27日“新生せし英雄”杯网战32人组冠军——绊信剑（绊剑部分）',
    'desc': '对战记录：绊信（剑）胜（薙）剑面；绊信（剑）胜面恐（薙）；（绊）信剑胜薙剑（铳）；绊信（剑）胜伞剑（面）；绊剑（信）胜岚面（剑）。绊少数的好处就是对面要防绊毒，而不用像毒剑那样早早交阡入连段给对面更多的总气量（反正不败北，就往死里卖）。这把对面的组合被绊信双meta，最终只能留给我绊剑，而我果断挑防御较弱打点略慢的岚面捏。对面为了防止一直暴露火力，自己3装去了一距，被我绊毒入4后奋迅红刃（吃可惜夜）+散华+血沫入6杀死比赛。绊剑基本上优势就在于绊毒，但劣势是奋迅真的菜，油伞也贼菜。如果想以类似阵容参与比赛的话，还是换毒信剑比较好。言归正传，绊剑思路与毒剑类似，也需要靠毒针+灭灯+尸干扰对面的打点和爆发，通过模型和毒干扰来赚卡差赚资源差赢下游戏，不带绊毒的话奋迅换四剑，绊毒换阡即可',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=8+1,20+0&girlscard1=0,1,2,5+0,3&girlscard2=0,1,6+2'
  },
  {
    'date': '2022-03-07',
    'author': '组卡器BOT',
    'name': '22-03日本起源上位-铳衣',
    'desc': '柏木「ふるよに」の会（起源戦大会）で優勝しましたー初道連れやったー選出：銃衣1回戦：vs薙毒2回戦：vs刀衣',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=jp&isShow=1&girls=2+0,21+0&girlscard1=0,3,4,5+0,1&girlscard2=0,1,4+2'
  },
  {
    'date': '2022-03-07',
    'author': '组卡器BOT',
    'name': '22-02日本完全上位-镰橇（铳）',
    'desc': '2/26 静岡らみぃ完全戦3拾1捨 銃鎌橇にてタロット獲得いたしましたので報告します',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=jp&isShow=1&girls=12+0,14+0&girlscard1=1,3,4+2&girlscard2=0,2,5,6+2,3'
  },
  {
    'date': '2022-03-07',
    'author': '组卡器BOT',
    'name': '22-02日本完全上位-铳镰（剑）',
    'desc': 'さいたまふるよに第31回大会完全戦3-1で優勝しましたー選出：銃鎌剣1回戦：銃剣（鎌）vs古傘（書）2回戦：鎌剣（銃）vs信棹（書）3回戦：銃鎌（剣）vs面剣（扇）',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=jp&isShow=1&girls=2+0,12+0&girlscard1=1,2,4,5+0,1&girlscard2=0,1,4+1'
  },
  {
    'date': '2022-03-18',
    'author': '组卡器BOT',
    'name': '22-03韩国完全上位-忍剑（扇）',
    'desc': '3/13 韓国ふるよに春を迎える決闘ー完全戦 扇忍剣で優勝しました。 形式 : 完全戦 三拾一捨 選択 : 扇忍剣 ◯ 1回戦 忍剣(扇) vs 爪衣(忍) ◯ 2回戦 忍剣(扇) vs 恐傘(仮面)',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=4+0,20+0&girlscard1=0,1,3,4+1&girlscard2=0,1,5+1,3'
  },
  {
    'date': '2022-04-05',
    'author': '组卡器BOT',
    'name': '22-03日本起源上位-铳骑',
    'desc': 'らみぃふるよに起源戦 銃騎使用 vs刀棹 ○ 先行ロアからの次ターンフルバ、その後も連撃決めつつヴァミで逃げ回って勝ち‼️ vs忍爪 ○ 間合い離しても近付かれる方が早いと踏んで同じ土俵で戦う事を選ぶ 終盤、敢えてライフダメージ受けて次ターンにクリゼロとバクドラ＆エッジ決めて勝ち',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=2+0,10+0&girlscard1=0,5+0,1&girlscard2=0,1,2,5,6+1'
  },
  {
    'date': '2022-04-06',
    'author': '组卡器BOT',
    'name': '22-04日本完全上位-兜面（剑）',
    'desc': '本日の娯楽屋での完全戦3-1は兜面剣で優勝しました！！初トコヨタロット！嬉しい！！',
    'decklink': '//sdrice.name/random.html?ver=S7&lang=cn&isShow=1&girls=17+0,19+0&girlscard1=2,4,5,6+0&girlscard2=0,1,3+2,3'
  },
  {
    'date': '2022-04-27',
    'author': '组卡器BOT',
    'name': '22-04日本完全上位-刀岚（面）',
    'desc': '刀嵐面で面納めぽい',
    'decklink': '//sdrice.name/random/?ver=S7&lang=cn&isShow=1&girls=0+0,11+1&girlscard1=1,2,4+1&girlscard2=0,1,2,5+0,2'
  },
  {
    'date': '2022-05-04',
    'author': '暗昏千鸟',
    'name': '5/3日“徒桜団円楽しい”杯网战32人组冠军——绊剑心（绊剑部分）',
    'desc': '对战记录：（绊）剑心胜（兜）忍恐；绊剑（心）胜（镰）剑心；绊心（剑）胜（橇）剑心；绊剑（心）胜（兜）拒心；绊心（剑）胜（镰）拒心。本套绊剑其实与本人在2.27日偷取上位的绊剑思路类似，不同的是由于心的大量泛滥，绊毒的收益愈发高涨，甚至可以做到otk的妙处，下面来简单介绍一下绊剑/绊心otk大部分常规心的打法。大部分心卡组开完神作渡后4手5装带浦结束——缠毒展开防浦+遁术拆1装（有条件可以吃神作渡把自己轰到0装）飞3-4，散华刃/问答入1血拆1装（问答盖3，下个对方回合0牌库，就当入1了），前进2-3到2距（4手下可以盖1卡做基本动作），奋迅进1，绊毒入8，一共9点斩杀。实际上这一套入5-7也可决胜，上文所叙述仅为展示本套连段对心伤害上限。ban位要给特殊补装手（旗络等）可康绊毒的女神（兜橇等），如果对方没有选择心，则可以使用本人2.27日上位的绊剑构筑，该构筑解析见组卡广场中本人投稿的另一副绊剑内容即可。需要注意的是，阡即使有一点副作用，但实操中依旧不影响本组合的强度，不如说自入1血反而可以瞬间预备一个尸/激进构筑追加一个霞毒，节奏更加流畅。不过毕竟千影的操作水平与构筑需要针对对手的成分更大，而目前7-2试玩环境以心当道，故开发组合时如何对抗心是重中之重',
    'decklink': '//sdrice.name/random/?ver=S7-2&lang=cn&isShow=1&girls=8+1,20+0&girlscard1=0,1,2,5+1,3&girlscard2=0,1,6+2'
  },
  {
    'date': '2022-05-04',
    'author': '暗昏千鸟',
    'name': '5/3日“徒桜団円楽しい”杯网战32人组冠军——绊剑心（剑心部分）',
    'desc': '对战记录：（绊）剑心胜（兜）忍恐；绊剑（心）胜（镰）剑心；绊心（剑）胜（橇）剑心；绊剑（心）胜（兜）拒心；绊心（剑）胜（镰）拒心。以目前本人S7-2对战情况来看，心是毫无争议的版本答案中的答案，爆炸的模型，超级强大的适应性，攻守资源兼备的特点，让其的模型与其他女神拉开了不只一个档次。虽然刀侧通常质量低下，但另一柱基本都能弥补。而在本次个人参加的网上比赛中，心的占比更是来到了窒息的31/32。说回正文，由于超级强悍的通常伤害，导致这个组合根本不需要阡来输出，加上格杀解除禁止，即使需要4禁忌的cost也依旧对于剑心来说是加强而非削弱（原来没有现在有那肯定是buff），而切位直接选择终极赖皮——神作渡+2对应/针对切即可，对于剑心来说就是理+浦。气魄面对不需要的对手可以切换成一闪，根据需要可以带織荊。总而言之3-4t打一套，下t抽2，再下t神作渡，神座渡后6通常斩杀即可。最大对手是镰，终末/虚伪对剑心压制都非常严重，必须ban。其他的对手如绊/拒可能也需要注意（不过其实都是内战，互相ban心得了）',
    'decklink': '//sdrice.name/random/?ver=S7-2&lang=cn&isShow=1&girls=0+2,20+0&girlscard1=2,4,6+0,1&girlscard2=0,1,2,6+2'
  },
  {
    'date': '2022-05-04',
    'author': '暗昏千鸟',
    'name': '5/3日“徒桜団円楽しい”杯网战32人组冠军——绊剑心（绊心部分）',
    'desc': '对战记录：（绊）剑心胜（兜）忍恐；绊剑（心）胜（镰）剑心；绊心（剑）胜（橇）剑心；绊剑（心）胜（兜）拒心；绊心（剑）胜（镰）拒心。非心内战的话，缠毒绊毒换灭灯霞毒浦波澜三选二，奋迅换一闪，本构筑为心内战专属。otk心思路依旧是对方神作渡t开缠毒（缠毒拆自己装，减少自己退的距离），遁术拆1装，问答一起聚气，前进2，奋迅进1，绊毒入8 结束。通常beat来说，则依旧是超级上位版刀毒，毒本身有大量的高装命比单卡/强拆装遁术等，触发阿吽可以说非常稳定且简单，以毒针+灭灯来覆盖对手抽牌阶段也较为频繁，霞毒和灭灯可以更积极使用，毕竟神作渡会将这两切都回收完毕，即便遇到超级大乌龟打不死（其实基本不存在），也可以再来一个灭灯+毒针，再次封死对手靠抽牌反打的机会，又或者毒针+浦，也可以减少对方2个反打频率。老样子，心最大的敌人还是镰，其次是拒这种能卡阶段的，橇的绝对零度或许能制造点麻烦，其他的女神组合很难与同等水平的心x进行对抗。（靠绊偷鸡也行，不过毕竟成功率不太稳）',
    'decklink': '//sdrice.name/random/?ver=S7-2&lang=cn&isShow=1&girls=0+2,8+1&girlscard1=1,2,6+0&girlscard2=0,1,2,5+1,3'
  },
  {
    'date': '2022-05-15',
    'author': '组卡器BOT',
    'name': '22-05日本完全上位-旗橇（友）',
    'desc': '福山ふるよに交流会　完全戦優勝しました。 1戦目　不戦勝 2戦目　旗橇(友)-扇嵐(剣)　win 3戦目　旗橇(友)-薙扇(魂)　win 序盤リソース奪いながら殴り、終盤レンジロック気味に動き勝利。',
    'decklink': '//sdrice.name/random/?ver=S7-2&lang=jp&isShow=1&girls=13+0,14+0&girlscard1=0,2+&girlscard2=1,2,3,4,5+0,2,3'
  },
  {
    'date': '2022-05-16',
    'author': '组卡器BOT',
    'name': '22-05日本完全上位-毒魂（橇）-信条特胜',
    'desc': '2回生きる道を決めて久しぶりの優勝！ヤツハはおうちに帰さない！！！',
    'decklink': '//sdrice.name/random/?ver=S7-2&lang=jp&isShow=1&girls=8+0,15+2&girlscard1=2,4,5,6+0,3&girlscard2=4,5,6+0'
  },
  {
    'date': '2022-06-08',
    'author': '暗昏千鸟',
    'name': '7/4“命運を接ぐ剣”杯网战32人组冠军毒薙镰（毒薙部分）',
    'desc': '对战记录：毒镰（薙）胜剑拒（心），毒薙（镰）胜旗花（镰），镰薙（毒）胜铳心（薙），毒镰（薙）胜心兜（书）。经典的中距beat之王，今日回归忠实的散樱代（不是）。言归正传，这次选用细音小姐的原因是自以为能针对心的刀/与心搭配相性不错的唐等在练习过程中作为对手的出现频率较高，那么这次就选择了纯粹的中距king,在目前版本中，石突效果要比薙刀斩好很多，卡手率更低，也能作为遁术的替补后退使用，本卡组带了终焉纯粹是为了压制镜花的以旗之名，毕竟我有自信对面不用这卡通常beat打不过我。而遁术将对面守护灵式对应阻碍开花也大幅减缓了对面的运作效率。当然，通常思路还是老老实实律动',
    'decklink': '//sdrice.name/random/?ver=S7-2&lang=cn&isShow=1&girls=1+0,8+0&girlscard1=0,2,3+2,3&girlscard2=0,1,2,4+2'
  },
  {
    'date': '2022-06-08',
    'author': '暗昏千鸟',
    'name': '8/4“命運を接ぐ剣”杯网战32人组冠军毒薙镰（薙镰部分）',
    'desc': '对战记录：毒镰（薙）胜剑拒（心），毒薙（镰）胜旗花（镰），镰薙（毒）胜铳心（薙），毒镰（薙）胜心兜（书）。依旧是常规构筑，由于圆月超级强化，导致相性非常不错，投入收割/终末/无音壁阻碍对方心神作渡的展开与问答阿訇连段，携带碎冰对付速射麦林的连招，如果需要更强进攻性，碎冰可以换灰灭。实战中，铳心毫无还手之力',
    'decklink': '//sdrice.name/random/?ver=S7-2&lang=cn&isShow=1&girls=1+0,12+0&girlscard1=0,2,6+0,3&girlscard2=0,1,2,4+2'
  },
  {
    'date': '2022-11-20',
    'author': '暗昏千鸟',
    'name': '11/20日“新生せし英雄2”杯网战32人组冠军——毒锯橇（毒锯部分）',
    'desc': '对战记录：毒锯（橇）胜算唐（锯），橇锯（毒）胜战炎（锯），毒橇（锯）胜铳锯（锤），毒橇（锯）胜桨铳（锯），毒橇（锯）胜算络（锯）思路其实挺简单的....用裂伤/毒的卡基本动作限制对方装上限，然后乱拳揍死就完事了，抗战铁屑遁术甚至可以强削4装，3个1/2随便入命，2个2/2一个2/1都只能命吃，斩杀线高的离谱，毒本身可以压制对面的对应端，导致对方无法对我方的斩杀做出有效阻抗，并且遁术也可以一定程度上反制锯的展开，下毒也可以变相遏制锯的蓄爆，配合黑铠有更多机会去反攻',
    'decklink': '//sdrice.name/random/?ver=S8&lang=cn&isShow=1&girls=8+0,23+0&girlscard1=0,1,2+2&girlscard2=1,2,3,6+0,1'
  },
  {
    'date': '2022-11-20',
    'author': '暗昏千鸟',
    'name': '12/20日“新生せし英雄2”杯网战32人组冠军——毒锯橇（毒橇部分）',
    'desc': '对战记录：毒锯（橇）胜算唐（锯），橇锯（毒）胜战炎（锯），毒橇（锯）胜铳锯（锤），毒橇（锯）胜桨铳（锯），毒橇（锯）胜算络（锯） 毒橇也是老朋友了，强度不用多说什么的。思路也是用绝对零度封锁对面装上限，毒封锁对方蓄爆，然后用大刀击杀对手就可以。需要注意的是，目前环境锯和算很多，对算的话可以考虑蹑足抢一个2t毒针干扰，单毒雾干扰的话很难阻拦对面花呗的展开',
    'decklink': '//sdrice.name/random/?ver=S8&lang=cn&isShow=1&girls=8+0,14+0&girlscard1=0,1,2,4+2&girlscard2=1,2,4+0,1'
  },
  {
    'date': '2022-12-20',
    'author': '暗昏千鸟',
    'name': '13/20日“新生せし英雄2”杯网战32人组冠军——毒锯橇（橇锯部分）',
    'desc': '对战记录：毒锯（橇）胜算唐（锯），橇锯（毒）胜战炎（锯），毒橇（锯）胜铳锯（锤），毒橇（锯）胜桨铳（锯），毒橇（锯）胜算络（锯）橇和锯相性也非常好，甚至可以达成裂伤把装打空然后全力化绝对零度的梦幻combo，而由于这过于便宜的裂伤机制，导致这个步骤很容易，本身冰雨的斩杀线或者霜风/深渊的阻抗在内战/针对算盘展开方面都有不小的作用。顺便吐槽一下，这环境不就是ban锯打2p么',
    'decklink': '//sdrice.name/random/?ver=S8&lang=cn&isShow=1&girls=14+0,23+0&girlscard1=1,2,4+3&girlscard2=1,2,3,5+0,1'
  },
  {
    'date': '2026-02-22',
    'author': '组卡器BOT',
    'name': '26-02韩国8人完全战上位-弓枪过去（书）',
    'desc': '//x.com/furu_s_eta/status/2025161472364732619',
    'decklink': '//sdrice.name/random/?ver=S10-2&lang=cn&isShow=1&girls=24+0,25+0&girlscard1=0,3,5+&girlscard2=0,3,5,6+0,1,2'
  },
  {
    'date': '2026-02-22',
    'author': '组卡器BOT',
    'name': '26-02韩国起源战上位-铳笛（琵琶）',
    'desc': '//x.com/Furu_S_etA/status/2023009299296145454/',
    'decklink': '//sdrice.name/random/?ver=S10-2&lang=cn&isShow=1&girls=2+0,3+1&girlscard1=0,1,2,4+0&girlscard2=0,2,6+0,3'
  },
  {
    'date': '2026-06-07',
    'author': '可爱的北岸',
    'name': '伞锤大魔像',
    'desc': '双黄cos大魔像。纯开伞标准构筑，非常适配新版无常其心，无常大地碎的配合非常强，粘在脸上很多pick对这玩意没啥办法。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=5+0,7+0&girlscard1=0,2,3,5+1,2&girlscard2=0,1,2+2'
  },
  {
    'date': '2026-06-07',
    'author': '可爱的北岸',
    'name': '铳骑走A',
    'desc': '凶弹 零时 狂想 ae ob 黑盒 随便选，整体考虑到油量的花费抉择we和stc。再演铳的后退能力大幅度增强，麦林手感相当之好。满集中的情况下，铳本家2距离脱3后退4后跳5麦林6可以直接衔接到速射，所以零时是可以进连段的，采用比新幕会多一些，相应领域就不厉害了。也因此在后退的过程中可以把中距刀甩出来。这里配合3-7的bs更是随便退，一边退一边甩ae难以想象有多爽。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=2+0,10+0&girlscard1=0,1,2,4,5+0,1&girlscard2=0,1+0'
  },
  {
    'date': '2026-06-07',
    'author': '组卡器BOT',
    'name': '26-06日本完全战上位-拒毒（试练）',
    'desc': '拒毒試で優勝 //x.com/Zico_furuyoni/status/2063548853924897139',
    'decklink': '//sdrice.name/random/?ver=res1&lang=jp&isShow=1&girls=1+2,14+1&girlscard1=0,2,3,6+0,2&girlscard2=1,4,5+0'
  },
  {
    'date': '2026-06-08',
    'author': '横浜MYGO！',
    'name': '新时代铳镰',
    'desc': '开着神奇小鹿冰被的时候随便吃什么攻击都能绝唱，实质绝对防御',
    'decklink': '//sdrice.name/random/?ver=res1&lang=jp&isShow=1&girls=1+2,14+1&girlscard1=0,1,2,6+0,2&girlscard2=0,1,5+0'
  },
  {
    'date': '2026-06-08',
    'author': 'Reinhard',
    'name': '忍毒',
    'desc': '版本更新替换了幽默斩首，暗器成为非常优秀的6装对应以及全力装压下毒手段，有效避免了毒针打不中的难题。然后再演更新的忍的2刀距离更加友好且和飞苦无更好适配。分身可以拿去盖毒雾打11叠1赚ap差。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=4+0,8+0&girlscard1=0,1,2+3&girlscard2=0,2,3,4+0,2'
  },
  {
    'date': '2026-06-08',
    'author': 'Reinhard',
    'name': '毒爪',
    'desc': '新的缠毒给了1/2人很好的斩杀手段，爪比较适配这一套思路，基本就是前期站2用兽爪压血，无脑跑风轴，斩杀轮缠毒开启后风轴2刀22+霞毒一刀22配合4手（风雷爪此时也是22）',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=8+0,11+0&girlscard1=0,2,3,4,5+1,2&girlscard2=0,1+2'
  },
  {
    'date': '2026-06-08',
    'author': '秦雨',
    'name': '雪橇车',
    'desc': '两个增加了攻击距离的女神一拍即合，成为新时代的阴间pick。主思路是7距开始、11ae、21骑动、雪刃、寒雪、前进1或者后退1、11ae、冻僵，打完5/7距对面2甲3冻，下回合可以33感谢炮打血，这一套打中就赢了一半了。上述思路只需要2王牌位+4通常牌，其他卡位非常灵活多变，比如针对一些减伤的对应，带霜之棘，就有32/42骑动和44感谢炮；针对爪这种近距离，带倒车退；针对橇、伞这张单卡攻击收益高的，带ts；针对刀这种大切，带变身下气，就算防你的naga，也能变抽牌斩杀。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=10+0,14+0&girlscard1=0,1,3+0&girlscard2=0,1,2,5+0,2'
  },
  {
    'date': '2026-06-08',
    'author': '可爱的北岸',
    'name': '伞橇闭',
    'desc': '往后走的时候，预演拒引总是能打出装，这时候冻一冻对手不好前进。别的没了。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=5+0,14+0&girlscard1=0,1,2,4+0,3&girlscard2=0,2,5+2'
  },
  {
    'date': '2026-06-08',
    'author': '晓夜神香',
    'name': '刀扇（再演起源环境）',
    'desc': '卡位非常灵活，无穷之风、诗舞甚至身法都不是必带卡。这套是全输出，核心要义是假装自己有浦/花，注意藏好信息，保证自己拥有战略先手权的情况下才能发挥最大威力。注：环境为再演起源。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=0+0,3+0&girlscard1=0,1,4+0&girlscard2=0,2,3,6+1,2'
  },
  {
    'date': '2026-06-08',
    'author': '小朋',
    'name': '忍薙',
    'desc': '分身术投入之后，再演的忍薙真正意义上摆脱了对全力的依赖，中盘对于一些控制卡组的立回丝滑程度比之前好了很多。自然卡位是有摇摆的。和老版本差别不大，对近战的圈域。以及全力的无音和斩乱仍然是可选向。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=1+0,4+0&girlscard1=0,1,2,3+0,2&girlscard2=0,2,4+3'
  },
  {
    'date': '2026-06-09',
    'author': '秦雨',
    'name': '嗷呜忍',
    'desc': '最强的天雷轴我能想到的只有忍和铳的天雷了，其他天雷的轴至少弱两个梯度了。现在只有o将的环境天雷还是很有压制力的，等a将全开放之后也会泯然众人矣吧。对比新幕把兽爪的卡位给到了分身术，算是小加强。卡位上是锁死的，钢丝诱导影菱配合虚鱼，分身牌效最高，斩乱配合洗牌诱导钢丝打命（对面能防住斩乱我建议带个风雷击打长盘或者换beat），疾跑拉距，狗叫打雷，壬曼加速启动，天雷就不用说了。打法基本上是公式化，前2t狗叫+为3t准备，3t壬曼虚鱼，其他忍的牌能打多少打多少，能往前走几步就尽量走，手里留斩乱，3t结束是打一张钢丝是4雷，4t洗牌诱导钢丝斩乱7雷，5t壬曼8雷，6t狗叫16雷，洗牌诱导影菱18雷。前4t基本上是没什么问题，5t能抽到狗叫直接打也是可以的，6t能打完一套保证设置都是全的。算伤害时务必多思考，手里留不留诱导，钢丝影菱打不打，吃不吃焦躁保设置，对面伤害和对应有多少，算明白才能提高天雷的胜率。',
    'decklink': 'sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=4+0,11+0&girlscard1=0,1,2,3,5+2,3&girlscard2=3,5+1'
  },
  {
    'date': '2026-06-09',
    'author': '零望',
    'name': '标准对砍薙橇',
    'desc': '六红+绝零/冻僵 看对面资源选 穷选绝零 富选冻僵 个人实际操作感觉冻僵效果好一点 可配合寒雪雪刃冻满 距离合适伤害足够 偏新手卡组',
    'decklink': 'sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=1+0,14+0&girlscard1=0,1,2+0&girlscard2=0,1,2,5+0,2'
  },
  {
    'date': '2026-06-09',
    'author': 'Reinhard',
    'name': '爪橇天雷轴',
    'desc': '可替换组件非常多，如回旋换橇的俩对应/带风雷击兽爪抢乌龟流的血等，核心思路是依靠反复再起飞雪快速刷槽，常见再起手段有飞雪冻僵再起飞雪/飞雪雪刃飞雪。这套天雷优势在有寒霜提供的额外+1+1以及可以前置铺垫冻僵让对面无法叠装防御。S9的时候拿这套上过线上赛4强，再演虽然回旋削弱但是橇增强了，仍是一套可玩的思路',
    'decklink': 'sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=11+0,14+0&girlscard1=5+1,3&girlscard2=0,1,2,4,5,6+2'
  },
  {
    'date': '2026-06-09',
    'author': '貉耳萌',
    'name': '铳车（橇）',
    'desc': '目前再演起源环境玩下来非常公式又强力的pick。80%的情况下不用改一张牌。第一波起手调度很重要。事先想好自己要再几t打（一般情况下是先手3t爆发或者后手2t爆发），然后根据你要爆发的回合来调度自己的手牌。举例：比如我要在3t爆发、那我就把手上的速射和爆弹反冲给洗到牌库底，或者只洗爆弹反冲，留一个速射在手上。调度上来的后跳/we都是可以在1/2t给你盖掉的，然后在你不想打爆发的回合也可以甩一个射击，无论是打对面装给你装付，还是打命直接停都可以。然后在你的爆发回合，你的手牌要保证是：bs、爆弹反冲、速射、回燃（也可以是射击）。然后因为你前两回合有聚气机会、这里只要有2气，你就可以ae和凶弹起手，这两张牌你甚至可以在5距离打，所以一巡你基本上一定可以打出来一套。然后两张王牌红打完还给你凑了连火，可以回燃bs接速射，先把32都甩了，最后打爆弹，然后11可以不甩，或者是回燃buffae，这些都要看情况选择。一般你这一套打完起码是可以退到7距并且给对面上个畏缩，对面装量应该在0或1左右，然后你停一个回合，下下个回合准备拿牌库斩杀。这时候如果你在3距及以下，就狂想把射击盖了；如果你在4距然后你的气足够打3个ae的话，注意算一下自己的ap足不足够前进we然后再退到自己需要的距离，如果可以就盖射击，不行就盖we；5距及以上的距离，就把we盖了留射击。这一套车铳打两波基本上是一定能把人打死的。然后在ban人方面，像是书/毒这两个铳怕的一般都得上ban位，然后因为我这套车橇没有铳抗性，我也会选择把铳ban掉。总的来说车铳还是比较简单的，如果不知道steam环境该玩什么强力pick的话，我先推荐一下车铳。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=2+0,10+0&girlscard1=0,1,2,4,5+0,2&girlscard2=0,1+0'
  },
  {
    'date': '2026-06-10',
    'author': '借栗打栗',
    'name': '络唐',
    'desc': '传统老轴，尽管魔能改三气对开局的单纳模组有一定的影响，但是对后续的循环不产生影响，且再演的改动目前不影响其他卡，目前这个轴还是可以使用的。懒得写了，看这个吧（//www.bilibili.com/opus/526891014329105614）此外，七三开局不适用于这个版本，请自动忽略',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=9+0,18+0&girlscard1=2,5,6+0,2&girlscard2=1,2,3,5+0'
  },
  {
    'date': '2026-06-10',
    'author': '借栗打栗',
    'name': '络唐',
    'desc': '大魔像轴，同样的问题，三气会对单纳模组有一定的影响，影响相对较小，但是对后续的循环不产生影响，且再演的改动目前不影响其他卡，目前这个轴还是可以使用的。懒得写了，看这个吧（//www.bilibili.com/opus/484340412547314185）此外，七三开局不适用于这个版本，请自动忽略（对的，我就是在复自黏贴）',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=9+0,18+0&girlscard1=1,2,3,5,6+0,1&girlscard2=3,6+0'
  },
  {
    'date': '2026-06-10',
    'author': 'sanity',
    'name': '再演无敌铳忍',
    'desc': '打远程换针对牌（例如完爆），调度思路：1.回燃或者反冲控底，2t后跳装填全打，盖牌盖诱导。2.装填后跳全去底，2t正常打一波。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=2+0,4+0&girlscard1=0,1,2,4,5,6+2,3&girlscard2=5+3'
  },
  {
    'date': '2026-06-11',
    'author': '晓夜神香',
    'name': '再演起源--刀爪气焰天雷（娱乐）',
    'desc': '仅在再演起源环境测试。娱乐卡组强度有限，谨慎参考！整体思路是尽力刷雷，气焰+决死+天雷收尾。1巡跑步进去，可以预见吼叫1雷+斩身法气合斩一闪4雷=5雷，翻倍1次+气焰=11雷=>6刀22斩8，根据对手的对应考虑斩杀时机。这个轴弱点很多。首先是连拍全力导致装付困难，我们如果要刷6雷触发吼叫2ap特效比较看2巡牌序；其次是气焰可能由于对手的连续装压而无法出手，面对忍毒橇等高压pick的时候不如红七公对砍；由于卡组存在核心卡牌吼叫，因此遇到牌库干扰或完全论破/神涉装置：枢式会比较难受。（你也不想连续3巡被立论盖吼叫吧）。优点还是有的，气焰天雷斩杀计算方便，斩杀上限高，不太吃对应。组卡时可以计算对手的最高防御手段，并根据这个防御考虑具体构筑与打法。例如面对忍薙，考虑对手有碎冰+冲音晶，可以5装吃3刀22+减1命伤，此时11雷气焰可以斩5；但是考虑到薙有律动的高斩杀，我们应该考虑提高气焰的斩杀线而不是提前用通常牌蹭血送气，因此更可能2t多刷1雷，打6*2+1=13雷气焰斩7。总而言之，算好双方斩杀的情况下，只要死不掉，刷槽卖血越快越好。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=0+0,11+0&girlscard1=0,1,4,5,6+1&girlscard2=3,5+1,3'
  },
  {
    'date': '2026-06-11',
    'author': '秦雨',
    'name': '再演有敌铳忍',
    'desc': '当无敌忍铳倒下时，有敌忍铳就要站出来了。泛用率和强度肯定不如无敌忍铳，通过有敌忍铳我想传递的是要学会变轴，特定的构筑在特定的情况下是有奇效的，对面在构筑时带的针对远程和铳的牌会因为变轴而变成废件。王牌方面零时能打中必带，壬曼1气增加斩杀资源，其他时候可以虚鱼+狂想+凶弹，后跳滤抽+退3，回燃不好出手可以换射击，装作远程铳cos4-10的梳流，诱导可以配合虚鱼，忍的三红收益很高都带上，全力可以摆烂打，爆弹也是可选项。（tips：提一嘴新幕这个思路也是很好用的）',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=2+0,4+0&girlscard1=4,5+1,2&girlscard2=0,1,2,3,5+3'
  },
  {
    'date': '2026-06-12',
    'author': '零望',
    'name': '标准毒橇',
    'desc': '标准毒橇组法，冻结和下毒的干扰相辅相成。1t前进，2t毒雾雪刃，3t飞苦无寒雪冻僵剑舞（可再接霞毒寒雪毒针）公式开局。当气溢出时，霞毒可以主动打。注意不要和对手对爆，站在安全距离>输出。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=8+0,14+0&girlscard1=0,1,2,4+2&girlscard2=0,2,5+0,2'
  },
  {
    'date': '2026-06-16',
    'author': '借栗打栗',
    'name': '传统忍伞',
    'desc': '太传统了，传统到和22年的忍伞一样（伞飞转太强了，这就加入伞飞转），壬蔓和纷扬组合进行每回合的持续输出，用预演和回合结束的开闭伞在刷新纷扬的同时保持每回合的闭伞状态，拒引用来调整距离，忍步钢丝作为重铸时的连招，能够在调整距离的同时补充伤害。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=4+0,5+0&girlscard1=0,4+3&girlscard2=0,1,2,4,5+0,3'
  },
  {
    'date': '2026-06-16',
    'author': '水魔雾心',
    'name': '公式偷大刀唐橇',
    'desc': '之前投稿注重一个创新，不过再演了多投点给新人看吧。公式偷大刀的唐橇，靠剑舞和打掷两个32底座吃霜茨43加掌54，有寒雪雪刃冻僵很容易确认到大刀入命。伤害构成的例子如43剑舞-3,54打掷-4,52枝-2加上洗牌1。公式构筑并不精巧，请随意根据对局更换组件。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=14+0,18+0&girlscard1=0,2,5,6+2&girlscard2=1,3,4+1,3'
  },
  {
    'date': '2026-06-17',
    'author': '水魔雾心',
    'name': '立缠绊66书绊',
    'desc': '超绝核心combo反论奋迅缠毒绊毒打6不可能不玩，其他可选输出还有反立接红，实在不吃这套核心combo的也可以左转完论反驳遁术论破反论立论-4祈祷能赢。哦对了神秘小tip：反驳缠毒是先代入缠毒然后反驳交换',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=6+0,8+1&girlscard1=0,1,2,6+2&girlscard2=1,3,5+1,3'
  },
  {
    'date': '2026-06-17',
    'author': '借栗打栗',
    'name': '络爪打铁轴',
    'desc': '非常传统的工业化打铁轴，建议复制风雷击（从卡面上来讲2/2的风雷击已经和兽爪相当，只需要第二轮洗牌后就可以四槽，复制流转爪会卡牌库，效率一般），风雷槽方面效率尚可，每次洗牌稳定模块化+魔能+工业化三槽，还有枢噜噜和反射可以辅助叠槽，4槽的风雷击就已经可以用了，后续叠的越多伤害越高，还可以在后期再起风雷击联动魔能，整体不需要后退，整体保持前进节奏，搭配疾风步维持稳定输出区间1-2。注：这套轴有一个替换卡，风雷智和反射是可以互换的，但是再演中的风雷智没有涨一槽的效果，此外，也不会叠到12槽，触发不了洗牌选项。只有一集中和4槽的捞卡效果，目前不清楚新版风雷智是否比反射效果更好。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=9+0,11+0&girlscard1=2,5,6+0,2&girlscard2=0,1,2,3+0'
  },
  {
    'date': '2026-07-15',
    'author': 'Lee',
    'name': '面剑双红刃',
    'desc': '绿幕2，核心出装是剑的红刃散华四剑和面的断行即兴天空，其他的都需要根据对局调整：对面只有1张通常牌对应（比如算法）带残光，把对应弹走然后红刃爽砍；对爆带格杀/尸/可惜夜，神居大人在线表演4禁忌接月影落；对面很能锁就不要带血晶，带空想/跑步/理。丝滑小连招即兴红刃入4，洗牌再即兴红刃入8，洗牌1血，红幕1血，原地抬走。以上是理想情况，实战中看对面血低时可以不再继续砍，转头开任务走红幕开始烫，双红刃禁忌用得很快，要速战速决。这套是在面剑多轴中提到的绿幕玩法，充分体现了面剑老同事的卡组契合性与灵活度。',
    'decklink': '//sdrice.name/random/?ver=S10-2&lang=cn&isShow=1&girls=19+0,20+0&girlscard1=3,4,5+0,3&girlscard2=0,1,2,5+2'
  },
  {
    'date': '2026-07-15',
    'author': 'Lee',
    'name': '面过',
    'desc': '红幕4，任务：明转、鼓动、灵活位。伤害构成：洗牌红幕4，诅咒1，共鸣2-3，王牌2-3，全是躲不掉的直伤随便烫烫就似了。王牌灵活调整，面的S1、过的S2S3视对局情况换入。',
    'decklink': '//sdrice.name/random/?ver=S10-2&lang=cn&isShow=1&girls=19+0,25+0&girlscard1=0,1,3+1,2&girlscard2=0,1,2,3+0'
  },
  {
    'date': '2026-07-15',
    'author': 'Lee',
    'name': '伞面',
    'desc': '紫幕5，任务：明转、鼓动、大杀阵。伤害构成：洗牌红幕4，空想1，藏针2，王牌3。脚本化可以调整牌库弥补伞的留2手问题，天空可以换进演出化惩罚装吃3/1，也可以带可惜夜保命。伞飞转的存在让伞成为面极佳的队友，可以合伞正常打纷扬loop，也可以变轴开伞锁0折磨中远距，还可以去金幕4请对面吃3/2的雪、4/6的灯。',
    'decklink': '//sdrice.name/random/?ver=S10-2&lang=cn&isShow=1&girls=5+0,19+0&girlscard1=0,1,2,4+0,3&girlscard2=0,1,3+3'
  },
  {
    'date': '2026-07-15',
    'author': '晓夜神香',
    'name': '战岚-再演完全环境',
    'desc': '普通平砍战岚。新的阵风祭天仪给战岚提速很多，可以早开持续给装和命压力，有机会回手手里剑的时候可以喊1雷给压力。分身术很容易骗到命，因此时机合适的时候可以不盖牌。战岚强势点在于兼具了岚的爆发、手里剑的持续补牌以及的钢丝+大岚额外装压，因此可以大大方方盖掉不关键的牌回手手里剑保持资源的获取，我们可以靠自己的牌保持5盖伏的节奏，额外提供一巡1次的补牌机会。可换卡牌很多，核心牌是暴风手里剑钢丝阵风祭天仪。可以换入兽爪鸢影突袭神代枝甚至忍步。不过个人认为现在这个通常牌的伤害量比较舒适，如果想带神代枝的话1t动作比较僵硬。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=4+1,11+1&girlscard1=0,1,2,5+2&girlscard2=1,2,5+0,2'
  },
  {
    'date': '2026-07-21',
    'author': '组卡器BOT',
    'name': '26-07日本完全战上位-心书（梿枷）',
    'desc': '午後完全戦 心棹書，//x.com/amamori3882/status/2078759642969378892',
    'decklink': '//sdrice.name/random/?ver=res1&lang=jp&isShow=1&girls=0+2,6+0&girlscard1=1,2,6+0,1&girlscard2=0,1,2,3+0'
  },
  {
    'date': '2026-07-22',
    'author': '组卡器BOT',
    'name': '26-07日本完全战上位-古刀铳',
    'desc': '//x.com/hilmleb/status/2079765445155188949',
    'decklink': '//sdrice.name/random/?ver=res1&lang=jp&isShow=1&girls=0+1,2+0&girlscard1=1,4,6+1&girlscard2=0,1,2,4+0,2'
  },
  {
    'date': '2026-07-21',
    'author': '河上一月',
    'name': '伞络锁0灯',
    'desc': '复制拒引控进0距，让对面立回消耗大，然后有一手灯和回收灯，对面不敢轻易装吃，（但似乎怕康？），复返其身可以换魔能吸收，当然无常其心也可行（。必要时可以伞络构筑雪轴打魔能吸收。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=5+0,9+0&girlscard1=0,2,5+1,3&girlscard2=1,2,4,5+2'
  },
  {
    'date': '2026-07-22',
    'author': '晓夜神香',
    'name': '刀忍-再演环境',
    'desc': '平砍卡组，中近对砍时火力充足，害怕锁距。身法、诱导、浦、壬蔓是可换卡位。除开对手卡近的情况，一般不考虑携带忍步降低伤害浓度。卡组有较高的命伤确认能力：斩入1较为稳定；分身术21威胁大，配合洗牌钢丝也能高概率入1。于是伤害构成是2洗牌+斩2+分身/影菱2，终局依赖钢丝一闪月影落高斩杀补充4命伤。补充：注意利用身法躲避部分对应。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=0+0,4+0&girlscard1=0,1,4+0,1&girlscard2=0,1,2,5+3'
  },
  {
    'date': '2026-07-22',
    'author': 'ima',
    'name': '伞未',
    'desc': '核心思路是锁0-1距收虚。「拒/引」是主要的拉距手段，在开伞状态下可以从2进0，命运”脱逃”辅助拉距。「星空包覆」、「虚幻意志」、「神枪·弥永」是主要收虚卡，注意「星空包覆」需要其他女神的牌作为前置。「挥枪」、「怪枪」、「谛观」确保共鸣次数，方便再起「神枪」和后期多次共鸣命运"歆羨"。最后一张卡「藏针/含针」，弥补输出的同时便于达成「星空包覆」的前置，可以根据需要换成「伞飞转」或「闪回/潜进」，「挥舞/突刺」是全力卡不太适合。「决舍·期冀」拉距康+收虚，「明灭如灯」作为1:1气血比的斩杀王牌，可以让我们更有底气地去血吃前期的伤害，防止场上的虚太多收不完，根据需要可以换成同样是斩杀性质的「造物诺伦神·万劫缠迫」。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=5+0,25+2&girlscard1=0,2+1&girlscard2=0,1,2,3,5+0,1'
  },
  {
    'date': '2026-07-28',
    'author': 'hs',
    'name': '络锤-绝望的一锤（娱乐阵容）',
    'desc': '思路：复制钟纯挨揍撑到牌到气够，先预控一下牌库，保证下回合加速回收和足量的齿轮，本回合先开模块化，下回合开始后退敲钟再后退，大山脉开钟再后退，加速回收大山脉开钟再后退，然后使用绝望的大天空（也许绝望的是我们），被卡中间后退资源充足可以大山脉开完直接大天空，再加速回收加伤大天空，打出绝望的第二锤。因为锤有紫豆了（代价呢？）所以不刚需krr了，多了一点可选性，大地碎裂可以任换。（注：大山脉可以强掀豆，不怕回收没有豆）。因为钟被砍了，记得防王牌康！！！双方游戏体验可能都不好，个人或者好友间娱乐向。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=7+0,9+0&girlscard1=2,3,5,6+0,3&girlscard2=1,4,5+2'
  },
  {
    'date': '2026-08-11',
    'author': 'hs',
    'name': '炎锯',
    'desc': '再演环境下，炎的通常牌近战能力获得了一定提升，该阵容核心是使用锯子的高效装压压制。回燃红莲进行斩杀。其中爆弹、火炎流可以看情况切换成完爆、装弹、彻底抗战、锯斩、铁屑缠身。猩红狂想可以换凶弹或者炎天、死地。杀意、回燃可以提高红莲的斩杀能力（无对应情况对面不能挂一点裂伤），面对王牌强康（比如久远之花）的可以走炎天亦或带死地抢气。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=2+1,23+0&girlscard1=1,2,4,5+2&girlscard2=1,2,4+0,1'
  },
  {
    'date': '2026-08-14',
    'author': 'hs',
    'name': '扇爪天雷',
    'desc': '前期梳流和风晴多刮两下，中间大狗叫把雷槽刷起，把控好天雷的伤害斩杀。爪的红看个人喜好带配合无穷风入血（这里原来写鸟的，不过已经变3/1了，变一直伤，也还能接受），对面卡近就可以带脱兔，无穷风千岁鸟可换常世月、圆环。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=3+0,11+0&girlscard1=0,2,5,6+1,2&girlscard2=0,1,5+1'
  },
  {
    'date': '2026-08-14',
    'author': 'hs',
    'name': '忍锯',
    'desc': '裂伤和斩击乱舞有组合效果，同时搭配设置可以起到一个很高的起爆能力。红牌压制力都很强。对面锁远可以带拉距，虚鱼可以换死地或熊介之类。感觉没什么思路可以讲，找机会用红莲来逼对面血吃，平时斩击偷刀（有康也可以带，我们偷一刀也够了。）尽量把能康红莲的角色Ban了。我们的对砍能力很强，对面还得与我们的熊介、死地进行博弈（',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=4+0,23+0&girlscard1=0,1,3,5+2&girlscard2=1,2,5+0,1'
  },
  {
    'date': '2026-08-15',
    'author': 'hs',
    'name': '试锯',
    'desc': '非常恐怖的进攻能力，光可再起的2气青莲+刀锋就让敌人难以承受。通常牌借王牌威吓入血，冰被可以保命同时再起青莲、刀锋。铁屑缠身、彻底抗战、死地都是可选项',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=14+1,23+0&girlscard1=0,1,5,6+0&girlscard2=1,2,4+0,1'
  },
  {
    'date': '2026-08-16',
    'author': 'CapCat',
    'name': '友算',
    'desc': '作为北岸套里为数不多勉强能玩的卡组，岁岁觉得有必要把它流传下去：1t直金，2t算法贷款，接大魔像链接（打近战尤其记得先开大魔像，这样就有虚装附），3t大龙卷入2，大魔像入2，直金什么时候回收看情况。4t能买命就买，后面的回合就是有大龙卷开大龙卷，有大魔像开大魔像。伤害上，大龙卷4，大魔像4（所以注意深层链接上的樱花要够）买命0~1，洗牌1~2；调度上，算法必须在前五张，大龙卷尽量在最后两张；bp上，铳弓这种会盖掉直金的不能留。投机可以换回收利用凑豆，还可以回收深层链接加樱花。',
    'decklink': '//sdrice.name/random/?ver=res1&lang=cn&isShow=1&girls=9+2,22+0&girlscard1=2,3,5+1,3&girlscard2=3,4,5,6+2'
  },
  {
    'date': '2026-08-16',
    'author': '秦雨',
    'name': '忍桨（广义忍铳）',
    'desc': '（我说2气鲸鱼强度特别高）。1t调度优先把水流/水雷球/强酸盖了，方便后续唤潮回牌，2t壬曼航道唤潮，看对面会不会给你逆风，会给就5装过，不给逆风就唤潮下自己1装4装过，3t顺风回水雷球+水流连打，逆风打个强酸过了。整体打法就是牌不要吝啬该盖就盖，尽可能保持满装不要吃血太多伤害，靠唤潮+航道去拉资源差，让对面给不了逆风的时候一套入血。打近距离可以用逆风的航道+鲸鱼可以把人锁在5-6；打中距离海啸就换成诱导前拉，思路变成锁7或者找机会进2，对面要给逆风需要离脱打你。如果是再演可以带上分身加伤害。',
    'decklink': '//sdrice.name/random/?ver=S10-2&lang=cn&isShow=1&girls=4+0,16+0&girlscard1=0,3+3&girlscard2=0,1,2,3,6+0,3'
  }
]
