export const QADATA = [{
  name: '规则常见FAQ',
  namejp: 'ルールへのFAQ',
  id: 'faqbasic',
  navShort: '规则',
  navShortjp: 'ルール',
  list: [{
    name: '游戏流程',
    list: [{
      author: '星之所在',
      'q': '截止到6扩的结算一张卡牌的顺序？',
      'a': '费用/cost→禁忌/伪证→反驳→使用计数器/使用效果→灯塔/晓→潜水→结算卡牌'
    },
    {
      author: 'EN',
      'q': '截止到6扩的距离变化结算顺序？',
      'a': '变更距离→追加距离→去除距离→距离扩大→距离缩小。'
    },
    {
      author: 'EN',
      'q': '截止到6扩的攻击结算顺序？',
      'a': '带入数值→替换数值→乘法计算→除法计算→加减法→规则修正'
    },
    {
      'q': '付与牌破弃结算顺序？',
      'a': '由当前回合玩家选择结算顺序。'
    },
    {
      'q': '回合结束时点由谁结算顺序？',
      'a': '回合结束的时候的伞开闭、大魔像、再起、幕的推进都是同一时点，由当前回合玩家选择结算顺序。'
    }]
  },
  {
    name: '基本动作相关',
    namejp: '基本動作について',
    list: [{
      'qjp': 'オーラに5つの桜花結晶が置かれています。基本動作により前進できますか？',
      'ajp': 'いいえ、できません。'
    },
    {
      'qjp': '基本動作のコスト(手札か集中力)を支払って、桜花結晶の動かない「基本動作」を選ぶことはできますか？　例えば私のオーラが0のときに宿しは行えますか？',
      'ajp': 'いいえ、できません。'
    },
    {
      'qjp': '相手のボードの間合にある桜花結晶を動かすことはできますか？　また、間合の私側の飛び石に空きがない時でも、離脱や後退を行うことはできますか？',
      'ajp': 'どちらもできます。間合に置かれている桜花結晶は個数しか参照せず、どの飛び石におかれているかは意味を持ちません。'
    }]
  },
  {
    name: '卡相关',
    namejp: 'カードについて',
    list: [{
      'qjp': '使用済みの切札は捨て札になりますか？',
      'ajp': 'いいえ、使用した切札は捨て札にはならず使用済の切札として表向きのままになります。'
    },
    {
      'qjp': 'メインフェイズに私の《攻撃》カードに対して対応が行われ《攻撃》が失敗しました。このとき同一ターンに《全力》カードを使用することはできますか？',
      'ajp': 'いいえ、できません。他にカードを使用しているためすでに標準行動を選んでいます。そこから全力行動に変更することはできません。'
    },
    {
      'qjp': '間合が合っていない《攻撃》カードや効果を解決できない《行動》カードを使用することはできますか？',
      'ajp': '《攻撃》カードは使用できません。《攻撃》カードは間合が合っていない場合、使用できなくなります。一方、《行動》カードなどで「跳ね兎」にように条件のあるものについては効果が解決されませんが使用することができます。ただし遠心や燃焼については使用条件であるため、その条件を満たしていないとそれらのカードは使用できません。'
    },
    {
      'qjp': '《対応》を持つカードを、対応でなく私のメインフェイズに使うことはできますか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    },
    {
      'qjp': '「詩舞」や「誘導」などの効果を選択することができるカードは、効果を解決できないものを選んで使用する事はできますか？　それとも強制的に解決できるものを選ぶことになりますか？',
      'ajp': '選択する効果を選ぶ際に制限はありません。そのため選んだ結果何も起こらないとしても選ぶことはできます。たとえば「詩舞」を使用した時にあなたのオーラがなくてフレアがあったとしても、「オーラ→間合」の効果を選ぶことができます。'
    },
    {
      'qjp': '「砂風塵」のように無作為に選ぶ必要がある場合には、どのように解決を行えばよいでしょうか？',
      'ajp': '何かしらの方法(ダイス、裏向きの手札やメガミタロットを選ぶなど)を用いてください。'
    },
    {
      'qjp': 'カードが＜使用中＞に移動する場合、どのプレイヤーに紐付けられた＜使用中＞に移動するのでしょうか？',
      'ajp': 'そのカードを使用するプレイヤーの＜使用中＞に移動します。「引用」で相手のカードを使用する場合、「引用」を使用したプレイヤーの＜使用中＞に移動することになります。'
    }]
  },
  {
    name: '攻击卡、对应卡相关',
    namejp: '《攻撃》、《対応》について',
    list: [{
      'qjp': '打ち消された《攻撃》の【攻撃後】効果は解決されますか？',
      'ajp': '《攻撃》が打ち消された場合、【攻撃後】効果は解決されません。《攻撃》のダメージが打ち消された場合は【攻撃後】効果は解決します。'
    },
    {
      'qjp': '私のターンにカードの効果により相手の《攻撃》が生成されました。それに対して対応できますか？',
      'ajp': 'はい、可能です。対応は相手のターンにしか行えないというルールはありません。'
    },
    {
      'qjp': '《攻撃》《対応》のカードは間合が合ってないと使えませんか？',
      'ajp': 'はい、その通りです。《対応》はあくまで、相手の攻撃に割り込んで使用できる権利があるというだけであり、カードの使用条件は他のカードと変わりません。'
    },
    {
      'qjp': '《攻撃》《対応》のカードを対応で使用した場合、攻撃によるダメージも相手に与えられますか？',
      'ajp': 'はい、与えられます。《対応》はあくまで、相手の攻撃に割り込んで使用できる権利があるというだけであり、カードの解決手順は他のカードと変わりません。'
    },
    {
      'qjp': '《攻撃》《対応》のカードを対応で使用された場合、これに対応はできますか？',
      'ajp': '《攻撃》に対応して使用した《攻撃》にさらに対応することはできません。また1つの《攻撃》に複数枚の対応カードを使用することもできません。'
    }]
  },
  {
    name: '付与卡相关',
    namejp: '《付与》について',
    list: [{
      'qjp': '私のオーラとダストの桜花結晶が納の数よりも少ない場合、《付与》カードは使用できますか？',
      'ajp': '使用できます。付与を使用するとき、オーラとダストの桜花結晶の合計が納の数未満である場合、可能な限り付与の上に桜花結晶を乗せます。例えばダストに2つ、オーラに1つ桜花結晶があるときに「論破」を使用した場合、「論破」には3つの桜花結晶が乗ることになります。'
    },
    {
      'qjp': 'ダストならびに私のオーラに一切の桜花結晶がない場合、《付与》のカードを使用できますか？　使用できるならば、どのような処理になりますか？',
      'ajp': 'はい、可能です。その場合、カードを出し、その【展開時】効果をまず解決します。その後、直ちに捨て札になり、その【破棄時】効果を解決します。'
    },
    {
      'qjp': '切札の《付与》カードを使用する場合、消費として支払ったフレアの桜花結晶をその付与札の上に置くことができますか？',
      'ajp': 'はい、可能です。先に消費としてフレアをダストへと送り、その後に付与札の解決手順として納の数だけダスト（またはあなたのオーラ）の桜花結晶をカードへと置きます。'
    }]
  },
  {
    name: '开始阶段相关',
    namejp: '開始フェイズについて',
    list: [{
      'qjp': '付与札の上に桜花結晶がまだ残っている状態で山札の再構成を行った場合、再構成はどのように行われますか？',
      'ajp': '付与札の上に桜花結晶がある場合、付与札はそのまま残り、捨て札、伏せ札、残りの山札を混ぜて切りなおします。'
    },
    {
      'qjp': '開始フェイズでカードを引くとき、山札にカードが残っている状態でカードを引かないことを選択することはできますか？',
      'ajp': 'いいえ、できません。山札にカードがある場合カードを必ず引く必要があり、あえて引かないことを選択することはできません。'
    },
    {
      'qjp': '山札が1枚の状態で残りの1枚を引いてから山札の再構成を行うことはできますか？',
      'ajp': 'いいえ、できません。ターン開始時における山札の再構成はカードを2枚引く前に行います。従って、山札の残り1枚を引く場合は残る1枚分の焦燥を受ける必要があります。'
    },
    {
      'qjp': '山札が0枚の時にカードを2枚引きます。焦燥はライフに1点、オーラに1点と言ったように分割して受けることができますか？',
      'ajp': 'はい、可能です。焦燥は1枚1枚別に解決します。'
    },
    {
      'qjp': '捨て札や伏せ札がなくても再構成はできますか？',
      'ajp': '捨て札や伏せ札がなくても山札の再構成を行うことはできます。同様に山札がないときに再構成を行わないこともできます（ただし第1ターンのみ開始フェイズの処理を飛ばすため、山札の再構成を行うこ とはできません。'
    }]
  },
  {
    name: '其它',
    namejp: 'その他',
    list: [{
      'qjp': '開始フェイズ以外でカードを引く際に山札が0枚でした。焦燥は発生しますか？',
      'ajp': '発生します。山札が0枚の時にカードを引く効果が発生した場合、フェイズによらず焦燥が発生しダメージを受けます。'
    },
    {
      'qjp': '同時に複数の効果が発生する場合、どの順で解決しますか？　（例えば、複数の付与札が同時に捨て札になる場合、その【破棄時】効果をどの順で解決するかなど）',
      'ajp': '現在ターンを進行中のプレイヤーが、好きな順で解決します。'
    },
    {
      'qjp': '相手のオーラに1つの桜花結晶が置かれています。その時、攻撃により相手に2/-のダメージが与えられました。どうなりますか？',
      'ajp': '相手のオーラにある1つの桜花結晶をダストに送ってください。十分な桜花結晶がない場合は、行える限りのことを行います。'
    },
    {
      'qjp': '伏せ札にした私のカードの表を見ることはできますか？',
      'ajp': 'できます。あなたの伏せ札はそのカードを随時確認することができます。「立論」などの相手のカードの効果で伏せ札になったカードについても内容を確認することができます。'
    },
    {
      'qjp': '一方のプレイヤーが先手を、もう一方が後手を希望している場合でも、先手後手は無作為に決めなくてはなりませんか？',
      'ajp': 'はい、ルールにおいては無作為に選ぶ必要があり、大会ではそのように裁定します（カジュアルプレイでは自由にしても問題のないルールだと考えます）。'
    }]
  }]
},
{
  name: '关键词相关的FAQ',
  namejp: 'キーワード効果へのFAQ',
  id: 'faqkw',
  navShort: '关键词',
  navShortjp: 'キーワード',
  list: [{
    name: '畏缩',
    namejp: '畏縮',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': '畏縮はプレイヤーの状態です。',
        'a': '畏缩是玩家的一种状态。'
      },
      {
        'ajp': '畏縮状態のプレイヤーが集中力を得る場合、集中力を得られずに代わりに畏縮状態でなくなります。',
        'a': '处于畏缩状态的玩家获得集中力时，不获得集中力，而改为解除畏缩状态。'
      },
      {
        'ajp': '畏縮状態の際に再び畏縮させられたとしても、二重に畏縮状態になることはありません。',
        'a': '若处于畏缩状态时再次畏缩，玩家并不会获得两个畏缩状态。'
      }]
    },
    {
      'qjp': '畏縮しており、集中力が2です。この状態で集中力を得る処理をした場合どうなりますか？',
      'ajp': '畏縮状態ではなくなります。',
      'q': '处于畏缩状态时，自己的集中力为2。此时获得集中力会解除畏缩吗？',
      'a': '会。'
    }]
  },
  {
    name: '破绽',
    namejp: '隙',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': '隙は《付与》が持つ特性で、隙のある行動をとることを表します。',
        'a': '破绽是《付与》牌具有的特性，表示玩家进行了一个有破绽的动作。'
      },
      {
        'ajp': 'その付与札の展開中にあなたが再構成以外の方法でライフへと1以上のダメージを受けた場合、その付与札に置かれた桜花結晶は全て＜ダスト＞に送られ、その付与札は伏せ札になります。この際、捨て札とならないため、その【破棄時】効果は発生しません。',
        'a': '该付与牌展开中时，若玩家因重铸牌库之外的任意效果受到1点及以上的命伤，则立即将该牌上的樱花结晶全部置入〈虚〉，并将该牌盖伏。此时因为该牌没有进入弃牌区，所以不结算其破弃时效果。'
      }]
    }]
  },
  {
    name: '超克',
    namejp: '超克',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': '超克は《攻撃》の持つ特性です。',
        'a': '超克是《攻击》具有的特性。'
      },
      {
        'ajp': '《攻撃》のオーラへのダメージは5が最大です。しかし、超克を持つ《攻撃》はそれを無視し、6以上のダメージとなることができます。',
        'a': '《攻击》的对装伤害最大为5。但是，具超克关键字的《攻击》无视这一限制，其对装伤害可以超过5。'
      }]
    }]
  },
  {
    name: '距离扩大（近X）/距离扩大（远X）',
    namejp: '距離拡大(近X)・距離拡大(遠X)',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': 'この修正は《攻撃》カードと《攻撃》の適正距離を増やします。',
        'a': '该修正增加《攻击》牌和《攻击》的攻击距离。'
      },
      {
        'ajp': '距離拡大(近X)の場合は元の適正距離の最も小さい値から見て、より小さい値をX個追加します。(遠X)の場合は最も大きい値から見て、より大きい値をX個追加します。',
        'a': '结算距离扩大（近X）时，取原攻击距离的最小值，然后将恰小于该值的X个连续整数加入该攻击的攻击距离。结算距离扩大（远X）时，取原攻击距离的最大值，然后将恰大于该值的X个连续整数加入该攻击的攻击距离。'
      },
      {
        'ajp': '例：「仕掛け番傘」(適正距離4)は距離拡大(近2)と距離拡大(遠2)を得ると適正距離2-6になります。',
        'a': '例：「机关油纸伞」（攻击距离4）受到距离扩大（近2、远2）的修正后攻击距离变为2-6。'
      }]
    },
    {
      'qjp': '「追い風」を展開中に「Alpha-Edge」を使用しました。「Alpha-Edge」の適正距離はどうなりますか？',
      'q': '「追轻风」展开中时使用「Alpha-Edge」，「Alpha-Edge」的攻击距离变为几？',
      'ajp': '「追い風」によって距離拡大(遠1)を得るため、1,3,5,7-8になります。',
      'a': '受到「追轻风」距离扩大（远1）的修正后应变为1,3,5,7-8。'
    },
    {
      'qjp': '適正距離を持たない《攻撃》に距離拡大を適用した場合、適正距離は追加されますか？',
      'q': '不具有攻击距离的《攻击》受到距离扩大修正后，会获得攻击距离吗？',
      'ajp': '追加されません。',
      'a': '不会。'
    }]
  },
  {
    name: '距离缩小（近X）/距离缩小（远X）',
    namejp: '距離縮小(近X)・距離縮小(遠X)',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': 'この修正は《攻撃》カードと《攻撃》の適正距離を減らします。',
        'a': '该修正移除《攻击》牌和《攻击》的攻击距离。'
      },
      {
        'ajp': '距離縮小(近X)の場合は元の適正距離の最も小さい値から見て、最も小さい値からその値より(X-1)だけ大きい値までのX個を削除します。(遠X)の場合は最も大きい値からその値より(X-1)だけ小さい値までのX個を削除します。',
        'a': '结算距离缩小（近X）时，取原攻击距离的最小值，然后将该值与比该值大（X-1）的数之间的所有整数从该攻击的攻击距离中移除。结算距离缩小（远X）时，取原攻击距离的最大值，然后将该值与比该值小（X-1）的数之间的所有整数从该攻击的攻击距离中移除。'
      },
      {
        'ajp': '例：間合0で使用された「ゆらりび」に対応して「虚偽」を使用した場合、「ゆらりび」による《攻撃》は距離縮小(近1)を得て適正距離0を失うため、この《攻撃》は失敗します。',
        'a': '例：使用「虚伪」对应0距离使用的「明灭如灯」时，「明灭如灯」生成的《攻击》受到距离缩小（近1）的修正而失去攻击距离0，《攻击》被闪避。'
      }]
    },
    {
      'qjp': '距離縮小と距離拡大が同時に適用された場合どのように解決しますか？',
      'q': '距离扩大与距离缩小的效果同时有效，如何结算？',
      'ajp': '距離拡大をすべて先に適用し、その後距離縮小をすべて適用します。',
      'a': '先结算所有距离扩大效果，再结算所有距离缩小效果。'
    }]
  },
  {
    namejp: '対応不可',
    name: '不可被对应',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': '対応不可は《攻撃》の持つ特性です。',
        'a': '不可被对应是《攻击》具有的特性。'
      },
      {
        'ajp': '対応不可を持つ《攻撃》に対応を行うことはできません。',
        'a': '具不可被对应关键字的《攻击》对手不能进行对应。'
      }]
    }]
  },
  {
    namejp: '対応不可（〇〇）',
    name: '不可被对应（X）',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': '対応不可（〇〇）は《攻撃》が持つ特性です。',
        'a': '不可被对应（X）是《攻击》具有的特性。'
      },
      {
        'ajp': '対応不可（〇〇）を持つ《攻撃》には括弧内の条件を満たすカードで対応を行うことができません。',
        'a': '具不可被对应（X）关键字的《攻击》对手不能使用满足括号内条件的牌进行对应。'
      }]
    },
    {
      'qjp': '対応不可（通常札）の《攻撃》に対して「鳶影」を使用しました。伏せ札にあるカードを使用できますか？',
      'q': '使用「鸢影」对应了不可被对应（通常牌）的《攻击》，可以使用盖牌区的牌吗？',
      'ajp': '使用できます。あくまで対応不可（通常札）は対応によるカードの使用において通常札の使用を禁止しています。「鳶影」のカード効果によって通常札を使用することは禁止されていません。',
      'a': '可以。不可被对应（通常牌）只禁止因进行对应而使用通常牌，但不会禁止因「鸢影」的效果使用通常牌。'
    }]
  },
  {
    namejp: '対応不可を失う',
    name: '失去对应不可关键字',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': '『対応不可を失う』と記述された効果は、該当する《攻撃》から対応不可および対応不可（〇〇）を失わせます。それらを複数持っているならば、その全てを失わせます。'
      }]
    },
    {
      'qjp': '1つの《攻撃》に『対応不可を得る』効果と『対応不可を失う』効果が同時に適用された場合、その《攻撃》に対応を行えますか？',
      'ajp': '対応を行えます。'
    }]
  },
  {
    namejp: '不可避',
    name: '不可避',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': '不可避は《攻撃》の持つ特性です。これを持つ《攻撃》は相手が対応を行った後で、2回目の間合の確認を行いません。',
        'a': '不可避是《攻击》具有的特性。具此特性的《攻击》在对手进行对应后不会再次确认当前距离是否在攻击距离内。'
      }]
    },
    {
      'qjp': '不可避を持つ《攻撃》が対応によって適正距離がなくなっても当たりますか？',
      'q': '具不可避关键字的《攻击》被对应后失去了所有攻击距离，还会击中吗？',
      'ajp': '当たります。不可避を持つ《攻撃》は対応によるカードの使用の後に間合のチェックを行いません。そのため適正距離がなくなったとしても《攻撃》は成功します。',
      'a': '还会击中。具不可避关键字的《攻击》不会在对手对应后进行第二次距离检查，所以即便失去了攻击距离攻击仍然成功。'
    },
    {
      'qjp': 'では不可避を持つ《攻撃》は適正距離がない状態でも使えますか？',
      'q': '那么可以在攻击距离不存在时进行具不可避关键字的《攻击》吗？',
      'ajp': 'いいえ、できません。不可避はあくまでも対応の後に間合の再確認を行わないだけであり、最初に《攻撃》を行う際には現在の間合と適正距離があっているかを確認します。',
      'a': '不可以。不可避关键字只是不进行第二次距离检查，但进行《攻击》仍然要求当前距离在攻击距离内。'
    }]
  },
  {
    namejp: '打ち消されない',
    name: '不可被打消',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': '打ち消されないは《攻撃》の持つ効果です。'
      },
      {
        'ajp': '打ち消されない《攻撃》は『《攻撃》を打ち消す』に類する効果を受けません。'
      }]
    },
    {
      'qjp': '打ち消されない《攻撃》に《対応》することはできますか？',
      'ajp': 'はい、できます。'
    },
    {
      'qjp': '打ち消されない《攻撃》への《対応》により、適正距離を外れた場合、どうなりますか？',
      'ajp': 'その《攻撃》は失敗します。適正距離による《攻撃》の失敗は打ち消しではありません。'
    },
    {
      'qjp': '「りふれくた」の【展開中】に、このターンの2回目の《攻撃》として打ち消されない《攻撃》を行った場合どうなりますか？',
      'ajp': 'その《攻撃》は打ち消されません。3回目として行う《攻撃》も「りふれくた」によっては打ち消されません。'
    },
    {
      'qjp': '打ち消されない《攻撃》に「反論」で対応し、ダメージを打ち消すことはできますか？',
      'ajp': 'いいえ、できません。打ち消されない《攻撃》はそのダメージや【攻撃後】効果も打ち消されません。'
    }]
  },
  {
    namejp: '終端',
    name: '终端',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': '終端はカードの持つ特性です。あるプレイヤーがこれを持つカードを解決し終えたならば、そのプレイヤーはそのターンの間、カードの使用と基本動作が行えなくなります。',
        'a': '终端是牌具有的特性。若一名玩家使用了具终端关键字的牌，则该牌结算完毕后当回合结束前该玩家不能使用牌或执行基本动作。'
      }]
    },
    {
      'qjp': 'メインフェイズに終端を持つカードを使用しました。その後、終了フェイズに「びっぐごーれむ」による再構成の後、「いんだすとりあ」が再起しました。この時「どれーんでびる」は使用できますか？',
      'q': '主要阶段使用了具终端关键字的牌，然后结束阶段触发「大魔像」效果洗牌后触发「复自黏贴」效果再起。此时可以使用「魔能吸收」吗？',
      'ajp': 'できません。終端によるカードの使用禁止はターン終了時まで継続します。',
      'a': '不可以。终端关键字禁止使用牌的限制持续至回合结束为止。'
    },
    {
      'qjp': '「もじゅるー」の展開中に、終端を持つ《行動》カードを使用した時、「もじゅるー」の【展開中】効果によって基本動作を行えますか？',
      'q': '「模块化」展开中时，使用具终端关键字的《行动》牌后可以触发「模块化」的【展开中】效果执行基本动作吗？',
      'ajp': 'できません。',
      'a': '不可以。'
    },
    {
      'qjp': '「陽の音」の展開中に、終端を持つ対応カードを使用した時、「陽の音」の【展開中】効果は解決されますか。',
      'q': '「阳之音」展开中时，使用具终端关键字的对应牌，「阳之音」的【展开中】效果会结算吗？',
      'ajp': 'はい。基本動作やカードの使用ではないため解決されます。',
      'a': '会。因为该效果既不是使用牌也不是执行基本动作所以照常结算。'
    },
    {
      'qjp': '「びっぐごーれむ」が使用済の時、「りげいなー」から「八葉鏡の向こう側」を使用しました。この時「びっぐごーれむ」の【使用済】効果によって基本動作を行えますか？',
      'q': '「大魔像」处于使用后状态时，因「回嗖利用」效果使用「彼世深渊」。此时可以触发「大魔像」的【使用后】效果执行基本动作吗？',
      'ajp': 'できません。「八葉鏡の向こう側」が終端を持つため、その後に基本動作を行うことはできません。',
      'a': '不可以。因为「彼世深渊」具有终端关键字，所以这张牌结算完毕后不能执行基本动作。'
    },
    {
      'qjp': '私が相手のターンに終端を持つカードを相手の《攻撃》への対応で使用した場合、相手はそれ以降カードの使用と基本動作が行えなくなりますか？',
      'q': '我在对手回合使用具终端关键字的牌对应了对手的《攻击》。对手是否本回合内不能使用牌或执行基本动作？',
      'ajp': 'いいえ、終端による制限は、そのカードを使用したあなたに適用されます。',
      'a': '不是，终端的限制只对使用具终端关键字的牌的玩家有效。'
    }]
  },
  {
    namejp: '全力化',
    name: '全力化',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': '全力化は効果が持つ情報です。全力化を持つカードをメインフェイズの全力行動にて使用した場合のみ、その効果が有効になります。',
        'a': '全力化是效果具有的信息。仅当自己在自己回合主要阶段因执行全力行动使用具全力化关键字的牌时，具全力化关键字的效果才会生效。'
      }]
    },
    {
      'qjp': '全力化を持つカードを全力行動で使用した場合、《全力》カードを使用したことになりますか？',
      'q': '因执行全力行动使用具全力化关键字的牌时，是否视为自己使用了《全力》牌？',
      'ajp': 'いいえ、なりません。全力化はカードのサブタイプに影響を与えません。',
      'a': '不会。全力化关键字不会影响牌的副类别。'
    },
    {
      'qjp': '全力化を持つ《攻撃》カードを全力行動で使用した場合、生成される《攻撃》は《全力》ですか？',
      'q': '因执行全力行动使用具全力化关键字的《攻击》牌时，生成的《攻击》是否具有《全力》副类别？',
      'ajp': 'いいえ、《全力》でない《攻撃》です。',
      'a': '不具有。'
    },
    {
      'qjp': 'カードを使用する効果で全力化を持つカードを使用した時、全力化の効果を得ることはできますか？',
      'q': '因其他牌的效果使用具全力化关键字的牌时，可以获得全力化效果吗？',
      'ajp': 'いいえ、効果による使用では全力化の効果は得られません。',
      'a': '不可以，因其他效果使用的牌不会获得全力化效果。'
    }]
  },
  {
    namejp: 'この効果が重複したら相殺する',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': 'このように記述されている効果が2つ以上同時に有効になっているなら、それらは全て有効でなくなります。',
        'a': '若游戏中存在2个或更多具此关键字的相同效果，则这些效果均无效。'
      }]
    }]
  },
  {
    namejp: '追加コスト',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': '追加コストは何らかの効果によって、カードの使用に際して発生するようになります。'
      },
      {
        'ajp': '追加コストが課せられているカードを使用する際、その追加コストが支払えないならばそのカードは使用できません。'
      },
      {
        'ajp': '追加コストの支払いは消費によるフレアの支払いと同じタイミングで行われます。'
      }]
    },
    {
      'qjp': '「消費によるフレアの支払いと同じタイミング」ならば消費を持たない通常札の使用には追加コストを支払わなくても良いですか？',
      'ajp': 'いいえ、支払います。'
    },
    {
      'qjp': '複数種類のコストが課せられたカードを使用しようとしましたが一部のコストが足りませんでした。他の一部のコストだけ支払うことは可能ですか？',
      'ajp': 'いいえ、できません。複数種類のコストが課せられている場合まずそれらすべての支払いが可能かどうかを確認し、可能であった場合のみすべて一度に支払われます。使用できない場合でも一部のコストのみ支払うといったことはできません。'
    },
    {
      type: 'subdesc',
      sublist: [{
        'ajp': '「引用」などに代表されるカードの効果によって別のカードを使用する効果のことです。'
      }]
    }
    ]
  },
  {
    namejp: 'カードを使用する効果',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': 'こちらでは対応を持たないものについてのFAQを掲載しています。対応を持つものに関しては、対応でカードを使用する効果へのFAQもご覧ください。'
      }]
    },
    {
      'qjp': 'この種の効果を持つ切札であるカードによって通常札の《攻撃》カードを使用しました。行われる《攻撃》の分類は何になりますか？',
      'ajp': '通常札になります。'
    },
    {
      'qjp': '間合が合っていない《攻撃》カードを選び、使用することはできますか？',
      'ajp': '使用には至りませんが選ぶことは可能です。総合ルールの処理に従うと、その使用は不正とされ、カードは差し戻されますので一切の効果を得られません（カードを使用した枚数にも数えません）。'
    },
    {
      'qjp': 'この種の効果で相手の「梳流し」を使用した場合、カードはどうなりますか？',
      'ajp': '通常通り【攻撃後】効果が発生し、集中力が2であるならば持ち主（この場合は相手）の山札の一番上に戻ります。'
    },
    {
      'qjp': 'この種の効果で相手の《付与》カードを使用した場合どうなりますか？',
      'ajp': 'あなたの付与札となります。それが破棄されるとき、相手の捨て札や切札へ使用済にして動かします。'
    },
    {
      'qjp': 'この種の効果で相手の「いんだすとりあ」を使用した場合、「でゅーぷりぎあ」を山札の底に加えられますか？',
      'ajp': 'あなたがクルルを宿しており、追加札に「でゅーぷりぎあ」があるならば可能です。そうでないなら加えられません。'
    },
    {
      'qjp': '私がシンラとユキヒを使用しており、傘は開いています。相手はユキヒを使用しており、傘が閉じています。この種の効果で相手の「しこみばり/ふくみばり」を使用する場合、どちらの効果が解決されますか？',
      'ajp': '「しこみばり」が解決されます。ユキヒのカードはすべて、持ち主の傘カードを参照します。'
    },
    {
      'qjp': 'この種の効果で遠心を持つカードを選択した場合、そのカードを使用することはできますか？',
      'ajp': 'この種の効果を使用したプレイヤーが遠心の条件を満たしていれば使用することができます。'
    },
    {
      'qjp': 'サリヤを宿していないプレイヤーがこの種の効果でサリヤを宿しているプレイヤーの手札にある燃焼や騎動を持つカードを選んだ場合、どのような処理になりますか？',
      'ajp': 'まずサリヤを宿していない場合マシンが存在しません。そのため燃焼を持つカードは使用ができません。騎動については行えないため何も発生しません。相手のカードを使用した場合は基本的にはこの種の効果を使用したプレイヤーの領域を参照することになります。'
    },
    {
      'qjp': '「弛緩毒」を展開中のプレイヤーがこの種の効果で《攻撃》カードを選択し、使用することはできますか？',
      'ajp': '選択することはできますが、使用はできません。「弛緩毒」の効果によって《攻撃》カードの使用は禁止されています。'
    }]
  },
  {
    namejp: '対応でカードを使用する効果',
    list: [{
      type: 'subdesc',
      sublist: [{
        'ajp': '「鳶影」などに代表される対応カードの効果によってカードを使用する効果のことです。カードを使用する効果へのFAQもご覧ください。'
      },
      {
        'ajp': '「このカードが対応している場合、使用したカードもそれに対応しているものと扱う」という効果を持ち、こちらではそれについてのFAQを掲載しています。'
      }]
    },
    {
      'qjp': '私が行った攻撃に対して、相手がこの種の効果を持つカードで対応し、《攻撃》カードを使用してきました。それに対して対応は行えますか？',
      'ajp': 'ルール上は可能です。しかしこの種の効果は使用したカードについても対応しているものと扱う記述を持ちます。対応している《攻撃》に対応することはできません。'
    },
    {
      'qjp': 'オーラが1以下の状態でこの効果を持つカードから「八方振り」を使用しました。【攻撃後】効果によって発生する攻撃に対応できますか？',
      'ajp': 'はい、できます。'
    },
    {
      'qjp': '《攻撃》に対応してこの効果を持つカードから「氷の音」や「真言」を使用した際に、『対応として使用したならば』の条件は満たせますか？',
      'ajp': 'いいえ、満たせません。カードの効果により対応していると扱われていたとしても、対応で使用してはいません。'
    },
    {
      'qjp': '対応でしか使用できないカードを、対応として使用されたこの効果を持つカードの効果によって使用することはできますか？',
      'ajp': 'いいえ、できません。'
    }]
  }]
},
{
  name: 'YURINA 摇波',
  list: [{
    'name': '「斬」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「一閃」',
    'list': [{
      'qjp': 'ライフが4の時に「一閃」を使用し、それの対応で攻撃を使用されてライフにダメージが入りライフが3になりました。その後「一閃」のダメージは+1/+0されますか？',
      'ajp': 'されます。「一閃」のダメージを解決するときにライフが3以下になっているため、+1/+0の効果を受けます。'
    }]
  },
  {
    'name': '「柄打ち」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「居合」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「気迫」',
    'list': [{
      'ajp': '距離拡大(近X)・距離拡大(遠X)、対応不可（〇〇）へのFAQもご覧ください。'
    }]
  },
  {
    'name': '「圧気」',
    'list': [{
      'qjp': 'ダストならびに私のオーラに一切の桜花結晶がない時に使用した場合、【破棄時】効果をすぐに得ることは可能ですか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    },
    {
      'qjp': '【破棄時】効果で発生した攻撃への対応は可能ですか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    }]
  },
  {
    'name': '「気炎万丈」',
    'list': [{
      'ajp': '超克へのFAQもご覧ください。',
      'a': '请参阅超克关键词相关的FAQ。'
    },
    {
      'qjp': '「律動弧戟」、「Beta-Edge」など、効果によって発生する攻撃も「気炎万丈」の効果を受けますか？',
      'ajp': '効果によって発生した《攻撃》についてもそのカードがユリナのカードでないならば、「気炎万丈」の効果を受けます。'
    },
    {
      'qjp': 'アナザー版のユリナの《攻撃》は「気炎万丈」の効果を受けますか？',
      'ajp': 'アナザー版のユリナについてもユリナのカードなので「気炎万丈」の効果は受けません。'
    }]
  },
  {
    'name': '「月影落」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「浦波嵐」',
    'list': [{
      'ajp': '終端へのFAQもご覧ください。',
      'a': '请参阅终端关键词相关的FAQ。'
    },
    {
      'qjp': '対応した攻撃のオーラへのダメージが0となり、ダメージを受けなかった場合、その攻撃の【攻撃後】効果は誘発しますか？',
      'ajp': 'はい、します。《攻撃》そのものは失敗していません。'
    }]
  },
  {
    'name': '「浮舟宿」',
    'list': [{
      'qjp': 'ライフが3から2になったときに未使用に戻りますか？',
      'ajp': '戻りません。ライフが3以下の状態から変化していないため即再起の条件を満たしません。'
    }]
  },
  {
    'name': '「天音揺波の底力」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「乱打」',
    'list': [{
      'qjp': '対応によってライフが3以下になりましたが、どうなりますか？',
      'ajp': 'ダメージが+0/+2され、2/3になります。また対応不可を持ちますが、すでに対応されているため特に意味はありません。'
    }]
  },
  {
    'name': '「癇癪玉」',
    'list': [{
      'qjp': '相手が自身のターンに「癇癪玉」を使用しました。私は次のターン集中力を得られますか？',
      'ajp': 'はい。開始フェイズは、集中力の獲得→付与札から桜花結晶を落とすという順で行われます。そのため集中力を得る時は「癇癪玉」は破棄されていません。その後「癇癪玉」が破棄されて畏縮するため、それ以降に集中力を得る代わりに畏縮が解除されます。'
    }]
  },
  {
    'name': '「不完全浦波嵐」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「問答」',
    'list': [
      {
        'qjp': '【攻撃後】効果で選べる基本動作が無い場合どうなりますか？',
        'ajp': 'あなたも相手も基本動作を行いません。'
      },
      {
        'qjp': '【攻撃後】効果で追加基本動作を選択できますか？',
        'ajp': 'できます。その場合相手は同じ追加基本動作を選択可能な状態ならその基本動作を行えます。'
      },
      {
        'qjp': '【攻撃後】効果で宿しを行うことを選び、凍結を解除しました。相手はどうなりますか？',
        'ajp': '凍結していないならば、通常の基本動作《宿し》を行います。'
      }
    ]
  },
  {
    'name': '「阿吽」',
    'list': [
      {
        'qjp': 'ダストが0です。【展開時】効果で上の効果を選択して宿しを行えますか？',
        'ajp': '行えます。'
      },
      {
        'qjp': '「阿吽」を展開中に、相手が《攻撃》のダメージを「無音壁」の上の桜花結晶で受けました。【展開中】効果は発生しますか？',
        'ajp': 'はい、相手のオーラが《攻撃》により変化したため発生します。'
      },
      {
        'qjp': '「浦波嵐」のダメージによってこのカードの【展開中】効果が発生しました。上の効果で基本動作を行えますか？',
        'ajp': 'できます。「浦波嵐」の《攻撃》の解決が終了した際に「阿吽」の効果が入れ子解決によって処理されます。このときまだ「浦波嵐」のカードとしての解決は終了していませんので終端は適用されていません。'
      }
    ]
  },
  {
    'name': '「神座渡」',
    'list': [
      {
        'qjp': '「風魔纏廻」が使用済でフレアが3つある状態でこのカードを使用しました。どうなりますか？',
        'ajp': '消費として支払われるフレアは2つですが、ダメージや【攻撃後】効果のXは3として解決されます。'
      }
    ]
  }
  ]
},
{
  name: 'SAINE 细音',
  list: [{
    'name': '「八方振り」',
    'list': [{
      'qjp': 'オーラに桜花結晶が1つある状態で使用しましたが、相手の対応によりオーラに桜花結晶が1つ加えられました。【攻撃後】効果により《攻撃》は発生しますか？',
      'ajp': 'いいえ。【攻撃後】効果を解決する時点で、八相の条件を満たしていないため《攻撃》は発生しません。'
    },
    {
      'qjp': 'では逆に、オーラに桜花結晶が2つ以上ある状態で使用し、相手の対応によりオーラの桜花結晶が1つ以下になりました。【攻撃後】効果により《攻撃》は発生しますか？',
      'ajp': 'はい、発生します。'
    }]
  },
  {
    'name': '「薙斬り」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「石突」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「見切り」',
    'list': [{
      'qjp': 'オーラが1以下の時、相手の行った対応不可を持つ《攻撃》に「見切り」を使用することはできますか？',
      'ajp': '対応不可に対しては「見切り」でも割り込むことはできません。「見切り」はオーラが1以下のときに《対応》を持つものとして扱う効果であるため、他の《対応》カードと同様に処理します。'
    }]
  },
  {
    'name': '「圏域」',
    'list': [{
      'qjp': '間合に空きがないとき、このカードから桜花結晶が移動するならどうなりますか？',
      'ajp': '移動せずカードの上にとどまります。'
    }]
  },
  {
    'name': '「衝音晶」',
    'list': [{
      'qjp': '相手が「叛旗の纏毒」を展開していた場合、【破棄時】効果はどうなりますか？',
      'ajp': '攻撃は打ち消されますが、ダストから間合への桜花結晶の移動はそのまま行われます。'
    }]
  },
  {
    'name': '「無音壁」',
    'list': [{
      'qjp': 'オーラに桜花結晶が1つ、「無音壁」の上に桜花結晶が2つあります。与えられた3/1のダメージをオーラで受けることを選べますか？',
      'ajp': 'はい、可能です。そしてオーラの桜花結晶と「無音壁」の上の桜花結晶は全てダストへと送られ、「無音壁」は捨て札になります。'
    }]
  },
  {
    'name': '「律動弧戟」',
    'list': [{
      'qjp': 'それぞれの《攻撃》は「雅打ち」により打ち消せますか？',
      'ajp': 'はい、可能です。行動カードの効果により生成された《攻撃》は切札ではありません。'
    },
    {
      'qjp': '「律動弧戟」の《攻撃》に対応で「浦波嵐」を使用した場合、その効果を受けるのはどの《攻撃》になりますか？',
      'ajp': 'どの《攻撃》に対応するかをあなたが選び、その《攻撃》が効果を受けます。例えば、最初の《攻撃》に対応して「浦波嵐」を使用した場合は、その影響を受けるのは最初の《攻撃》のみとなります。'
    },
    {
      'qjp': 'では「律動弧戟」の2回目や3回目の《攻撃》に対応で「浦波嵐」を使用することはできますか？',
      'ajp': 'はい、できます。それぞれの《攻撃》に対して対応を行うことができます。'
    },
    {
      'qjp': '「律動弧戟」を適正距離外(間合1や6)で使用した場合すべての《攻撃》が失敗しますが、その《攻撃》に対して対応を行うことはできますか？',
      'ajp': 'いいえ、できません。『攻撃を行う』と記述された効果による《攻撃》の適正距離が現在の間合とあっていない場合、その《攻撃》は不正なものとして消去されます。そのため対応するタイミングはありません。'
    }]
  },
  {
    'name': '「響鳴共振」',
    'list': [{
      'qjp': '相手の「無音壁」にある桜花結晶によって消費は少なくなりますか？',
      'ajp': '消費は少なくなりません。「無音壁」にある桜花結晶はオーラではないため「響鳴共振」の消費には影響しません。'
    }]
  },
  {
    'name': '「音無砕氷」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「氷雨細音の果ての果て」',
    'list': [{
      'qjp': '「鳶影」の効果によって使用された「鋼糸」に対応して「氷雨細音の果ての果て」を使用することはできますか？',
      'ajp': 'いいえ、できません。「氷雨細音の果ての果て」は切札の《攻撃》カードにのみ対応できます。「鳶影」から使用した《攻撃》は切札ではないため使用することができません。'
    },
    {
      'qjp': '「氷雨細音の果ての果て」は「律動弧戟」の効果で発生する《攻撃》や「熊介」の【攻撃後】効果による《攻撃》に対応で使用することはできますか？',
      'ajp': 'いいえ、できません。「律動弧戟」の効果で発生する《攻撃》や「熊介」の【攻撃後】効果による《攻撃》は切札ではないため「氷雨細音の果ての果て」を使用することができません。'
    }]
  },
  {
    'name': '「氷の音」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「伴奏」',
    'list': [{
      'qjp': '「伴奏」を展開中に相手のターン最初の《攻撃》に対応して他のメガミの切札を使用した場合、ダメージは-1/+0されますか？',
      'ajp': 'されます。元の《攻撃》のダメージを受ける際には他のメガミの切札が1枚以上使用済となって条件を満たすため、ダメージ減少の効果が適用されます。'
    }]
  },
  {
    'name': '「二重奏：弾奏氷瞑」',
    'list': [{
      'ajp': '終端へのFAQもご覧ください。',
      'a': '请参阅终端关键词相关的FAQ。'
    }]
  },
  {
    'name': '「裏斬り」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「遺響壁」',
    'list': [{
      'qjp': '「遺響壁」の展開中に《攻撃》を行ったところ、それへの対応によって「遺響壁」が破棄されました。「遺響壁」の【破棄時】効果は今行っている《攻撃》に影響しますか？',
      'ajp': 'しません。このターンあなたが次に《攻撃》を行う際に適用されます。'
    }]
  },
  {
    'name': '「絶唱絶華」',
    'list': [{
      'ajp': '終端へのFAQもご覧ください。',
      'a': '请参阅终端关键词相关的FAQ。'
    },
    {
      'qjp': '「フルバースト」や「クリムゾンゼロ」に「絶唱絶華」で対応した場合、どうなりますか？',
      'ajp': '『両方のダメージを受ける』はオーラとライフ両方のダメージを選んだものと扱うため、《攻撃》の解決後にオーラが0なら現在のフェイズが終了されます。'
    },
    {
      'qjp': 'オーラが0の時に「浦波嵐」に「絶唱絶華」で対応した場合、どうなりますか？',
      'ajp': 'オーラへのダメージが選ばれ、《攻撃》の解決後にオーラが0であるため、現在のフェイズが終了されます。'
    },
    {
      'qjp': 'オーラが2以下の時に「寄花」の【破棄時】による《攻撃》に「絶唱絶華」で対応し、オーラダメージを選んだ場合、どうなりますか？',
      'ajp': '《攻撃》のダメージを解決した時点でオーラが0でなくても、【攻撃後】効果の解決後にオーラが0なら現在のフェイズが終了されます。'
    }]
  }]
},
{
  name: 'HIMIKA 绯弥香',
  list: [{
    name: '连火特性相关的FAQ',
    namejp: '連火全般へのFAQ',
    list: [{
      'qjp': '手札を1枚伏せ札にして、基本動作を行いました。それはカードを使用した枚数に含まれますか？',
      'ajp': 'いいえ、含まれません。'
    },
    {
      'qjp': '山札を再構成するに際して、設置を持つカードを使用しました。それはカードを使用した枚数に含まれますか？',
      'ajp': 'はい、含まれます。'
    },
    {
      'qjp': '使用した《攻撃》カードによる攻撃が打ち消されました。それはカードを使用した枚数に含まれますか？',
      'ajp': 'はい、含まれます。'
    },
    {
      'qjp': 'カードを使用する効果を持つカードでカードを使用した場合、合計で2枚分のカードを使用したと数えますか？',
      'ajp': 'はい、数えます。'
    },
    {
      'qjp': '連火を持つカードを3枚目（例えば、「シュート」「バックステップ」「ラピッドファイア」の順で使う）に使用すれば、連火の効果を得られるということでよいですか？',
      'ajp': 'はい、その通りです。'
    },
    {
      'qjp': '「どれーんでびる」の【使用済】効果を使用した場合、連火の使用されたカードの枚数として数えられますか？',
      'ajp': 'はい、連火の使用枚数として数えられます。'
    },
    {
      'qjp': '「分身の術」でヒミカの連火の効果があるカードを使用した場合、連火の効果は発動しますか？',
      'ajp': '事前に他のカードは使っていなかったと仮定します。その場合は、2回目の使用時には連火が発動します。「分身の術」が1枚目、「分身の術」により伏せ札から使用したカードが2枚目、「分身の術」により再度カードを使用した時は3枚目となるため連火の条件を満たします。'
    }]
  },
  {
    'name': '「シュート」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「ラピッドファイア」',
    'list': [{
      'ajp': '連火全般へのFAQもご覧ください。',
      'a': '请参阅[连火]特性相关的FAQ。'
    }]
  },
  {
    'name': '「マグナムカノン」',
    'list': [{
      'qjp': '私のライフが1のときに「マグナムカノン」を使用し相手のライフを0にした場合、勝敗はどのようになりますか？',
      'ajp': '「マグナムカノン」のダメージにより相手のライフが0になった瞬間に勝敗判定となり勝利します。これは【攻撃後】効果の解決前に行われるためあなたのライフが0になることはありません。'
    }]
  },
  {
    'name': '「フルバースト」',
    'list': [{
      'qjp': '相手のオーラが1、ライフが4の時に「フルバースト」を使用しました。この場合、相手へのダメージはどのようになるのでしょうか？',
      'ajp': 'オーラへのダメージ、ライフへのダメージはそれぞれ別々に処理されます。そのためこの場合は相手のオーラが0、ライフが3になります。'
    }]
  },
  {
    'name': '「バックステップ」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「バックドラフト」',
    'list': [{
      'ajp': '連火全般へのFAQもご覧ください。',
      'a': '请参阅[连火]特性相关的FAQ。'
    },
    {
      'qjp': '連火を満たした「バックドラフト」の次に灰塵を満たしていない状態で「円月」を使用しました。その対応でダストが12以上になり、灰塵を満たした場合、「円月」のダメージはどうなりますか。',
      'ajp': 'オーラへのダメージが「-」になったため、「バックドラフト」のダメージ修正は消え、-/2になります。'
    },
    {
      'qjp': '連火を満たした「バックドラフト」の次にオーラへのダメージが「-」である他のメガミの《攻撃》を行い、その次にさらに他のメガミの《攻撃》を行った場合、それに「バックドラフト」のダメージ修正は適用されますか。',
      'ajp': 'はい、されます。'
    }]
  },
  {
    'name': '「スモーク」',
    'list': [{
      'qjp': '「スモーク」が使用されている間、前進は行えますか？',
      'ajp': 'できます。「スモーク」はあくまでカードの矢印効果による間合からの桜花結晶の移動を禁止しているだけです。基本動作による前進は禁止されていません。'
    },
    {
      'qjp': '「スモーク」が使用されている間、「バックステップ」などで間合に桜花結晶を移動させることはできますか？',
      'ajp': 'できます。「スモーク」は間合からの桜花結晶の移動を禁止しているだけであり、間合への移動は禁止していません。'
    }]
  },
  {
    'name': '「レッドバレット」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「クリムゾンゼロ」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「スカーレットイマジン」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「ヴァーミリオンフィールド」',
    'list': [{
      'ajp': '連火全般へのFAQもご覧ください。',
      'a': '请参阅[连火]特性相关的FAQ。'
    }]
  },
  {
    'name': '「火炎流」',
    'list': [{
      'ajp': '連火全般へのFAQもご覧ください。',
      'a': '请参阅[连火]特性相关的FAQ。'
    }]
  },
  {
    'name': '「殺意」',
    'list': [{
      'qjp': '毒が手札にある場合、効果はありますか？',
      'ajp': '手札にカードがあるため、使用しても特に効果はありません。'
    }]
  },
  {
    'name': '「炎天・紅緋弥香」',
    'list': [{
      'qjp': '超克を持ちませんが、間合0でのダメージはどのようになりますか？',
      'ajp': '5/8になります。超克を持たない場合、オーラダメージのみ上限を持ちます。ライフダメージは超克を持たなくても6以上になります。'
    }]
  }]
},
{
  name: 'TOKOYO 常世',
  list: [{
    'name': '「梳流し」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「雅打ち」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「跳ね兎」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「詩舞」',
    'list': [{
      'qjp': 'オーラに一切の桜花結晶がない時に、オーラから間合に動かす方の効果を選択できますか？',
      'ajp': 'はい、可能です。その場合、処理としては何も起こらないことになります。もちろん、もう一方の選択肢についても同様のことが言えます。'
    }]
  },
  {
    'name': '「要返し」',
    'list': [{
      'qjp': '捨て札から1枚と伏せ札から1枚選んで戻すことはできますか？',
      'ajp': 'はい、できます。'
    },
    {
      'qjp': '「要返し」で山札の底に置くカードの順番は相手に分かるように戻す必要はありますか？',
      'ajp': 'いいえ、どの順番で戻したかを相手に明示する必要はありません。'
    },
    {
      'qjp': '相手の伏せ札や捨て札を山札に戻せますか？',
      'ajp': 'いいえ、できません。'
    }]
  },
  {
    'name': '「風舞台」',
    'list': [{
      'qjp': '「風舞台」を展開中に相手の《攻撃》をオーラで受け風舞台の破棄時に間合へ移動させるオーラがない場合はどのような扱いになりますか？',
      'ajp': 'その場合、何も起こりません。桜花結晶の移動は可能な限り行います。オーラがない場合は移動させる桜花結晶が存在しないため、間合への移動は行われません。オーラが1つしかない場合は、オーラから間合に1つだけ移動させることになります。'
    },
    {
      'qjp': '2つの【破棄時】を解決する順番は選べますか？',
      'ajp': 'いいえ、1枚のカードのテキストは必ず上から順に解決されます。'
    }]
  },
  {
    'name': '「晴舞台」',
    'list': [{
      'ajp': '終端へのFAQもご覧ください。',
      'a': '请参阅终端关键词相关的FAQ。'
    },
    {
      'qjp': '畏縮状態で「晴舞台」を使用しました。集中力は2になりますか？それとも畏縮が解除されるだけですか？',
      'ajp': '畏縮状態のまま集中力が2になります。'
    }]
  },
  {
    'name': '「久遠ノ花」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「千歳ノ鳥」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「無窮ノ風」',
    'list': [{
      'qjp': '相手が《攻撃》でないカード2枚を持っている場合、【攻撃後】で捨てるカードを選ぶのはどちらですか？',
      'ajp': '相手が選んで捨て札にします。'
    }]
  },
  {
    'name': '「常世ノ月」',
    'list': [{
      'qjp': '畏縮状態で「常世ノ月」を使用しました。集中力は2になりますか？それとも畏縮が解除されるだけですか？',
      'ajp': '畏縮状態のまま集中力が2になります。'
    }]
  },
  {
    'name': '「奏流し」',
    'list': [{
      'qjp': '対応によって他のメガミの切札が使用済でなくなった場合、【攻撃後】効果で山札の上に戻りますか？',
      'ajp': '【攻撃後】効果の解決時に条件を満たしていないため、山札の上には戻りません。'
    }]
  },
  {
    'name': '「陽の音」',
    'list': [{
      'qjp': '攻撃に対する対応でなくとも効果を得られますか？',
      'ajp': 'はい、得られます。'
    },
    {
      'qjp': 'オーラがない状態で「見切り」を対応で使用しました。「陽の音」の効果は適用されますか？',
      'ajp': '適用されません。「見切り」は《対応》カードではないため「陽の音」の効果を受けることはできません。'
    },
    {
      'qjp': '相手の「陽の音」を対象に「刈取り」や「皆式理解」の鬼謀効果で選ぶことはできますか？ またそうした場合桜花結晶をダストに送れますか？',
      'ajp': '対象に選ぶことは可能ですが、「陽の音」の【展開中】効果により、桜花結晶は移動しません。'
    }]
  },
  {
    'name': '「二重奏：吹弾陽明」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「畏掠め」',
    'list': [{
      'qjp': '『ダメージはあなたが選ぶ』とはどういうことですか？',
      'ajp': 'この《攻撃》によるダメージの解決において、オーラへのダメージを受けるかライフへのダメージを受けるかの選択を、ダメージを受けるプレイヤーの代わりにあなたが行います。'
    },
    {
      'qjp': '相手のオーラが1で、相手の集中力が0です。私はオーラへダメージを与えることを選べますか？',
      'ajp': 'いいえ、選べません。'
    }]
  },
  {
    'name': '「悠久ノ雪」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「徒寄ノ八重桜」',
    'list': [{
      'qjp': '「詭弁」により相手の「要返し」を使用しました。「徒寄ノ八重桜」によりオーラの上限は８と扱われますか？',
      'ajp': 'いいえ、扱われません。『あなたのカード』にのみ適用されます。'
    },
    {
      'qjp': '相手が「詭弁」により私の「誘導」を使用しました。「徒寄ノ八重桜」によりオーラの上限は８として扱われますか？',
      'ajp': 'はい、扱われます。'
    },
    {
      'qjp': '私のオーラの桜花結晶と凍結トークンの合計値が5以上のときに相手が「レタルレラ」を使用しました。どうなりますか？',
      'ajp': '対応としての使用なら打ち消しが行われ、そうでないなら何も起きません。テキストは上から解決され、最初の「相手のオーラに空きが無いならば」の時点でのオーラの上限は5なため、その下の矢印効果は解決されません。'
    }]
  }]
},
{
  name: 'OBORO 胧',
  list: [{
    name: '设置特性相关的FAQ',
    namejp: '設置全般へのFAQ',
    list: [{
      'qjp': '設置を持つカードを手札から普通に使うことは可能ですか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    },
    {
      'qjp': '開始フェイズに山札を再構成し、それに際して設置を持つカードを使用しました。そのターンのメインフェイズに全力行動を選び、《全力》を持つカードを使用できますか？',
      'ajp': 'はい、可能です。メインフェイズに標準行動か全力行動のどちらを選ぶかが、開始フェイズの内容により決められることはありません。'
    },
    {
      'qjp': '設置を持つカードの使用は山札の再構成の直前に行うとありますが、それはライフに1のダメージが与えられるより前ですか、後ですか？　例えば、私のライフが1で相手のライフが2の時、設置した「鋼糸」で相手のライフにダメージを与えれば勝利できますか？',
      'ajp': '前です。山札の再構成によるライフへのダメージは、コストではなく効果の一部と考えてください。例についても、お察しの通り勝利できます。'
    },
    {
      'qjp': '設置により使用された《攻撃》カードに対応することはできますか？また、それが「反論」かつ山札が0枚ならば焦燥は発生しますか？',
      'ajp': 'はい、可能です。そして焦燥も発生します。なぜなら設置が誘発している時点では山札の再構成は行われておらず、山札は0枚であるためです。'
    },
    {
      'qjp': '「千歳ノ鳥」や「びっくごーれむ」などの効果で山札を再構成する場合でも、設置を持つカードは使用できますか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    }]
  },
  {
    'name': '「鋼糸」',
    'list': [{
      'ajp': '設置全般へのFAQもご覧ください。',
      'a': '请参阅[设置]特性相关的FAQ。'
    }]
  },
  {
    'name': '「影菱」',
    'list': [{
      'ajp': '設置全般へのFAQもご覧ください。',
      'a': '请参阅[设置]特性相关的FAQ。'
    },
    {
      'qjp': '伏せ札から使用した場合、攻撃後に相手の手札を伏せ札にしないことを選べますか？',
      'ajp': 'いいえ、必ず手札を1枚選んで伏せ札にしなければなりません。'
    }]
  },
  {
    'name': '「斬撃乱舞」',
    'list': [{
      'qjp': '開始フェイズで設置から「鋼糸」を使用し、対応で「浦波嵐」によりオーラに0ダメージが入りました。このターンのメインフェイズで「斬撃乱舞」を使用した場合ダメージはどうなりますか？',
      'ajp': 'オーラへ0ダメージが与えられているため、4/3となります。'
    }]
  },
  {
    'name': '「忍歩」',
    'list': [{
      'ajp': 'カードを使用する効果へのFAQもご覧ください。'
    },
    {
      'ajp': '設置全般へのFAQもご覧ください。',
      'a': '请参阅[设置]特性相关的FAQ。'
    }]
  },
  {
    'name': '「誘導」',
    'list': [{
      'ajp': '設置全般へのFAQもご覧ください。',
      'a': '请参阅[设置]特性相关的FAQ。'
    },
    {
      'qjp': '相手のオーラに一切の桜花結晶がない時に、相手のオーラから相手のフレアに動かす方の効果を選択できますか？',
      'ajp': 'はい、可能です。その場合、処理としては何も起こらないことになります。もちろん、もう一方の選択肢についても同様のことが言えます。'
    }]
  },
  {
    'name': '「分身の術」',
    'list': [{
      'ajp': 'カードを使用する効果へのFAQもご覧ください。'
    },
    {
      'qjp': '「分身の術」で「影菱」を使用した場合、どうなりますか？',
      'ajp': 'まず1回目の使用は伏せ札から行われているため、【攻撃後】により相手の手札を1枚伏せ札にすることができます。2回目は捨て札から使用されているため【攻撃後】は何も起こりません。'
    },
    {
      'qjp': '「分身の術」で「忍歩」を使用した場合、追加で伏せ札から設置を持つカードを使用できますか？',
      'ajp': '1回目の使用では伏せ札から使用しているため追加で設置を持つカードを伏せ札から使用できます。2回目は捨て札から使用しているため、追加での使用はできません。'
    },
    {
      'qjp': '集中力が2であるとき、「分身の術」から「梳流し」を使用しました。この場合どうなりますか？',
      'ajp': '1回目の使用で【攻撃後】効果によって山札の上に置かれているため、2回目の使用ができません。'
    },
    {
      'qjp': '「分身の術」で使用したカードが捨て札にある場合は必ずもう一度使用しなければいけないのでしょうか？',
      'ajp': '使用したカードが捨て札にあるならば必ず使用する必要があります。使用するかどうかが任意の場合は「使用してもよい」と記述されます。'
    },
    {
      'qjp': '「分身の術」を使用した際に伏せ札が全て《全力》である場合はどうしたらよいでしょうか？',
      'ajp': '伏せ札を公開して伏せ札に《全力》しかないことを証明する必要があります。'
    }]
  },
  {
    'name': '「生体活性」',
    'list': [{
      'ajp': '設置全般へのFAQもご覧ください。',
      'a': '请参阅[设置]特性相关的FAQ。'
    },
    {
      'qjp': 'ダストならびに私のオーラに一切の桜花結晶がない時に使用した場合、【破棄時】効果をすぐに得ることは可能ですか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    }]
  },
  {
    'name': '「熊介」',
    'list': [{
      'qjp': '【攻撃後】効果で発生した攻撃への対応は可能ですか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    },
    {
      'qjp': 'それは「雅打ち」で対応すれば打ち消せますか？',
      'ajp': 'はい。【攻撃後】効果で生成された攻撃は切札ではありません。'
    },
    {
      'qjp': 'フレアに2個の桜花結晶がある時に使用されました。相手の伏せ札は6枚です。切札からの攻撃と、【攻撃後】効果による攻撃2回を受け、フレアが5になりました。その後、3回目の【攻撃後】効果による攻撃を「久遠ノ花」で打ち消すことはできますか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    },
    {
      'qjp': 'そのようにして打ち消した場合、残る3枚の【攻撃後】効果による攻撃はどうなりますか？',
      'ajp': 'そのまま発生し、あなたにダメージを与えます。「熊介」そのものが打ち消されたわけではありませんので、【攻撃後】効果は変わらず有効であるためです。'
    },
    {
      'qjp': '「浦波嵐」で「熊介」に対応した場合、【攻撃後】効果で発生する攻撃は2/2ですか？　0/2ですか？',
      'ajp': '2/2です。'
    },
    {
      'qjp': '現在の間合が4の状態で使用された「熊介」の【攻撃後】効果により、2/2の攻撃が3回発生しました。そのうちの1回目を「詩舞」で対応し、現在の間合が5になりました。3回の追加攻撃はどうなりますか？',
      'ajp': 'いずれも発生はしますが、適正距離から外れていますので失敗となります。結果、あなたは追加の攻撃からはダメージを受けません。'
    }]
  },
  {
    'name': '「鳶影」',
    'list': [{
      'ajp': '対応としてカードを使用する効果へのFAQもご覧ください。'
    }]
  },
  {
    'name': '「虚魚」',
    'list': [{
      'ajp': '設置全般へのFAQもご覧ください。',
      'a': '请参阅[设置]特性相关的FAQ。'
    },
    {
      'qjp': '一度使用したら、再構成の度に任意の枚数設置を使用できますか？',
      'ajp': 'はい、「虚魚」は一度使用したらそれ以降(未使用に戻らない限り)、再構成の度に任意の枚数設置を伏せ札から使用できます。'
    },
    {
      'qjp': '再構成の選択中に「虚魚」が未使用に戻った場合どうなりますか？',
      'ajp': 'それ以降、設置によるカードの使用はできなくなります。'
    }]
  },
  {
    'name': '「壬蔓」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「手裏剣」',
    'list': [{
      'qjp': '手札へ戻す効果と手札上限の調整はどちらが先ですか？',
      'ajp': '手札へ戻す効果が先となります。手札へ戻した結果手札が3枚以上あるなら、2枚になるように伏せ札にする必要があります。'
    }]
  },
  {
    'name': '「不意打ち」',
    'list': [{
      'qjp': '伏せ札が2枚の状態で「不意打ち」を使用されました。対応で「鳶影」から「反論」を使用してダメージを打ち消すことはできますか？',
      'ajp': 'できます。「鳶影」によって伏せ札の枚数が1枚になった結果、「不意打ち」のダメージは3/2となり、「反論」によってダメージが打ち消されます。'
    }]
  },
  {
    'name': '「神代枝」',
    'list': [{
      'qjp': '「神渉装置：枢式」で相手の「神代枝」を使用しました。「最後の結晶」は得られますか？',
      'ajp': 'あなたが「第三章」オボロを宿しているならば、あなたの追加札にある「最後の結晶」を得られます。そうでないならば、得られません。どちらの場合でも「神代枝」は取り除かれます。'
    }]
  },
  {
    'name': '「最後の結晶」',
    'list': [{
      'qjp': '「律動弧戟」の1つ目の《攻撃》によってライフが0になり「最後の結晶」を使用しました。残りの《攻撃》はどうなりますか？',
      'ajp': 'そのまま残りの《攻撃》が解決されます。'
    },
    {
      'qjp': '「神渉装置：枢式」によって「最後の結晶」が使用済にされました。その後最初に敗北をしたときに使用できますか？',
      'ajp': 'できます。「最後の結晶」の【常時】効果は使用済であるかどうかの条件を見ていません。使用済であってもそのゲーム中に最初に敗北した時に【常時】効果によって使用できます。'
    },
    {
      'qjp': '「森羅判証」などの効果によって敗北した場合でも「最後の結晶」を使用できますか？',
      'ajp': 'できます。それが最初に敗北をしているならばどのような条件で敗北したかは問いません。'
    },
    {
      'qjp': '「闇昏千影の生きる道」などの効果によって相手が勝利した場合でも「最後の結晶」を使用できますか？',
      'ajp': '『勝利する』効果はプレイヤーを敗北させずにゲームを終了するため、できません。'
    },
    {
      'qjp': '使用する際に手札が0枚だった場合どうなりますか？',
      'ajp': '手札を1枚伏せ札にすることには失敗しますが、それ以外の効果は通常通り解決されます。'
    }]
  }]
},
{
  name: 'YUKIHI 雪灯',
  list: [{
    name: '变貌特性相关的FAQ',
    namejp: '変貌全般へのFAQ',
    list: [{
      'qjp': 'ユキヒを宿していないプレイヤーが「引用」等で相手の傘アイコンを持つユキヒのカードを使用する場合、そのカードの効果はどのようになりますか？',
      'ajp': '相手の傘の状態を参照します。傘アイコンはカードの持ち主のものを参照するため、あなたがユキヒを宿していたとしても「引用」などで使用する場合は相手の傘の状態を参照します。',
      'q': '「预演/猫骗」被对方引用是怎么结算卡面？',
      'a': '根据原有者的伞面决定所引用的牌是「预演」还是「猫骗」，但所有效果均由使用者结算。'
    },
    {
      'qjp': 'ユキヒを宿していないプレイヤーが、自身が保有者であるユキヒのカードを使用する場合、そのカードの効果はどのようになりますか？',
      'ajp': 'そのカードはテキストを持たないものとして扱われます。また、《攻撃》カードであるなら、オーラへのダメージとライフへのダメージは0であり、適正距離を持ちません。'
    },
    {
      'qjp': 'ユキヒを宿していた際の終了フェイズに手札が3枚以上だった場合、傘の開閉と手札を2枚にする処理の順番はどちらが先に行われますか？',
      'ajp': '傘の開閉は手札を2枚にするよりも先に行われます。終了フェイズに行う処理は手札の調整が最後に行われます。'
    },
    {
      'q': '「预演/猫骗」被对方引用是谁结算攻击后？',
      'a': '引用「猫骗」的情况下 引用方进行伞的开闭操作（如果可能）将牌送至保有者的手牌。'
    }]
  },
  {
    'name': '「しこみばり/ふくみばり」',
    'list': [{
      'ajp': '変貌全般へのFAQもご覧ください。',
      'a': '请参阅[变貌]特性相关的FAQ。'
    }]
  },
  {
    'name': '「しこみび/ねこだまし」',
    'list': [{
      'ajp': '変貌全般へのFAQもご覧ください。',
      'a': '请参阅[变貌]特性相关的FAQ。'
    },
    {
      'qjp': '傘を閉じている状態で使用した場合、【攻撃後】効果では必ず傘の開閉を行わなければなりませんか？',
      'ajp': 'はい。傘の開閉を行うという効果が解決されるなら、必ず傘の開閉を行います。'
    }]
  },
  {
    'name': '「ふりはらい/たぐりよせ」',
    'list': [{
      'ajp': '変貌全般へのFAQもご覧ください。',
      'a': '请参阅[变貌]特性相关的FAQ。'
    }]
  },
  {
    'name': '「ふりまわし/つきさし」',
    'list': [{
      'ajp': '変貌全般へのFAQもご覧ください。',
      'a': '请参阅[变貌]特性相关的FAQ。'
    },
    {
      'qjp': '傘を閉じている状態で「ふりまわし/つきさし」を使用しました。相手のオーラが4以下の場合、相手へのダメージはどのようになりますか？',
      'ajp': '可能な限りオーラからダストへ送ります。ダメージの一方が「-」の場合、必ずもう一方のダメージが選ばれます。'
    }]
  },
  {
    'name': '「かさまわし」',
    'list': [{
      'qjp': '終了フェイズに行った傘の開閉に際しても、「かさまわし」を公開して効果を得ることができますか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    }]
  },
  {
    'name': '「ひきあし/もぐりこみ」',
    'list': [{
      'ajp': '変貌全般へのFAQもご覧ください。',
      'a': '请参阅[变貌]特性相关的FAQ。'
    }]
  },
  {
    'name': '「えんむすび」',
    'list': [{
      'qjp': '「詭弁」で相手の「えんむすび」を使用したらどうなりますか？',
      'ajp': '傘の開閉の情報を持たないため、書かれている通りの効果が解決されます。'
    }]
  },
  {
    'name': '「はらりゆき」',
    'list': [{
      'ajp': '変貌全般へのFAQもご覧ください。',
      'a': '请参阅[变貌]特性相关的FAQ。'
    },
    {
      'qjp': '傘が開いていたとしても、0/0の攻撃として使用できますか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    }]
  },
  {
    'name': '「ゆらりび」',
    'list': [{
      'ajp': '変貌全般へのFAQもご覧ください。',
      'a': '请参阅[变貌]特性相关的FAQ。'
    },
    {
      'qjp': '傘が閉じていたとしても、0/0の攻撃として使用できますか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    }]
  },
  {
    'name': '「どろりうら」',
    'list': [{
      'qjp': '両方の適正距離になるとありますが、ダメージや効果はどうなりますか？',
      'ajp': '開閉状態に依存します。傘を開いている状態であれば「しこみばり/ふくみばり」による《攻撃》は『適正距離0-2,4-6 1/2』となります。'
    },
    {
      'qjp': '「どろりうら」を展開しているプレイヤーの所有するユキヒの攻撃カードを「引用」「詭弁」「神渉装置：枢式」で使用しようとする場合、その適正距離はどうなりますか？',
      'ajp': '「どろりうら」は展開しているプレイヤーのみが効果を受けます。質問の場合、相手のユキヒの開閉状態に依存した適正距離になります。例えば相手が傘を閉じているなら、「はらりゆき」の適正距離は3-5になります。'
    },
    {
      'qjp': '「どろりうら」を展開中に、「引用」「詭弁」「神渉装置：枢式」で(「どろりうら」を展開していない)相手の所有するユキヒの攻撃カードを使用しようとする場合、その適正距離はどうなりますか？',
      'ajp': '「どろりうら」の効果を受けるので開閉の両方の適正距離を持ちます。なおダメージや効果については相手の傘の開閉に依存します。'
    },
    {
      'qjp': 'ユキヒを宿していないプレイヤーが、「どろりうら」を展開した状態で自身が保有者であるユキヒの《攻撃》カードを使用する場合、その《攻撃》はどのようになりますか？',
      'ajp': 'その《攻撃》カードは一切のテキストを持たず、オーラへのダメージ及びライフへのダメージは0ですが、適正距離は傘を閉じた状態と開いた状態両方のものを持ちます。'
    }]
  },
  {
    'name': '「くるりみ」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「ちからぞえ/おどしつけ」',
    'list': [{
      'qjp': '付与札が複数存在する場合、それらの上の桜花結晶を合計して数えるということですか。',
      'ajp': 'はい、その通りです。'
    }]
  },
  {
    'name': '「よこいと/たていと」',
    'list': [{
      'qjp': '傘が開いている状態で、開始フェイズに「ミオビキ航路」や設置等でカードを使用した場合、【攻撃後】効果によって捨て札にある他のメガミのカードを使用できますか？',
      'ajp': 'いいえ、使用できません。'
    }]
  },
  {
    'name': '「ひらりおり」',
    'list': [{
      'qjp': '傘が閉じている状態で、他のメガミのカードを使用してから「ひらりおり」を使用し、改めて別の他のメガミのカードを使用した場合、集中力を得て桜花結晶をこの上に置くことはできますか？',
      'ajp': 'いいえ、他のメガミのカードをはじめて使用した時にのみ効果が発生します。'
    },
    {
      'qjp': '展開中、傘が閉じている状態で、他のメガミのカードをはじめて使用したときにダストが0だった場合、集中力を得られますか？',
      'ajp': 'はい、得られます。'
    },
    {
      'qjp': '「神渉装置：枢式」などの効果により相手の保有する「ひらりおり」を展開している場合、どうなりますか。',
      'ajp': '「ひらりおり」の保有者の傘の状態を参照します。'
    },
    {
      'qjp': '「ひらりおり」の【展開中】効果による《攻撃》と、間合±1トークンを燃焼済にする処理や「魔食」の【使用済】はどういう順番で解決されますか？',
      'ajp': 'それらは全て同時に発生するため、ターンプレイヤーが解決順を選択します。'
    },
    {
      'qjp': '傘を開いていて、このカードの上の桜花結晶が1つの状態で私のターンを開始しました。【展開中】効果による《攻撃》は行われますか？',
      'ajp': 'はい、行われます。'
    }]
  }]
},
{
  name: 'SHINRA 森罗',
  list: [{
    name: '计略特性相关的FAQ',
    namejp: '計略全般へのFAQ',
    list: [{
      'qjp': '「引用」や「神渉装置：枢式」などで相手のシンラのカードを使用しました。その効果で計略を実行することはできますか？',
      'ajp': 'シンラを宿している場合、あなたの計略ボードの計略トークンを表にして計略を実行することになります。シンラを宿していない場合、計略ボードがないため、計略を実行する効果では何も起こりません。'
    }]
  },
  {
    'name': '「立論」',
    'list': [{
      'qjp': '山札が2枚以上ある相手に、「鐘鳴らし」でダメージを4/-にして「立論」を使用しましたが、対応で「反論」が使用されダメージが打ち消されました。相手の山札はどうなりますか？',
      'ajp': '何も行われません。元のダメージが打ち消されているため、置き換える効果についても解決されません。'
    },
    {
      'qjp': '相手の山札が毒2枚のみの状態で私が「立論」を使用した場合、どうなりますか？',
      'ajp': '山札の枚数は2枚以上あるため山札の上から2枚を伏せ札にする効果になりますが、毒は伏せ札にならないため山札に残ります。'
    },
    {
      'qjp': '相手の山札が2枚以上で一番上に毒があり、その状態で「立論」を使用した場合、毒を除いて上から何枚が伏せ札になりますか？',
      'ajp': '山札の上に毒が1枚ある場合はその下の1枚のみを伏せ札にすることになります。'
    }]
  },
  {
    'name': '「反論」',
    'list': [{
      'qjp': '相手の山札が0枚の時に使用すれば、焦燥で相手にダメージを与えられますか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    },
    {
      'qjp': '相手のオーラが0の時に使用しました。相手はカードを引きますか？',
      'ajp': 'はい、引きます。攻撃が成功していますので、ダメージの処理に関わらず【攻撃後】効果は発生します。'
    },
    {
      'qjp': '相手のライフが4で、私は「天地反駁」を展開中です。相手が「一閃」を使用し、それに対して「反論」で対応しました。「一閃」を打ち消せますか？',
      'ajp': 'はい、打ち消せます。「反論」のダメージで相手のライフは3になり、それにより「一閃」のダメージは3/2になります。その後に「反論」の【攻撃後】効果が解決され、「一閃」は打ち消されます。'
    }]
  },
  {
    'name': '「詭弁」',
    'list': [{
      'ajp': '計略全般へのFAQもご覧ください。',
      'a': '请参阅[计略]特性相关的FAQ。'
    },
    {
      'ajp': 'カードを使用する効果へのFAQもご覧ください。'
    },
    {
      'qjp': '相手の捨て札がないときに「詭弁」を使用して、計略で鬼謀を選んでいました。どうなりますか？',
      'ajp': '相手の捨て札がないので特に何も起こりません。'
    },
    {
      'qjp': '「詭弁」の鬼謀効果で相手の捨て札にあるシンラのカードを使用することになり、再度計略を実行することになりましたが、どうなりますか？',
      'ajp': '「詭弁」の計略が実行されている途中のため、鬼謀が計略として選ばれているはずです。ゆえに鬼謀の効果が解決されることになります。'
    },
    {
      'qjp': '「森羅判証」展開中に「詭弁」で使用した相手の付与札が破棄された場合、相手のライフに1ダメージを与えることはできますか？',
      'ajp': 'はい、相手のライフに1ダメージを与えます。「詭弁」で使用したカードは「詭弁」を使用したプレイヤーが使用したものと扱われます。'
    }]
  },
  {
    'name': '「引用」',
    'list': [{
      'ajp': 'カードを使用する効果へのFAQもご覧ください。'
    },
    {
      'qjp': '相手のカードを伏せ札にすることを選んだ場合、そのカードはこちら（「引用」を使ったプレイヤー）の伏せ札に置くのでしょうか？',
      'ajp': 'いいえ、相手の伏せ札に置きます。'
    },
    {
      'qjp': '《全力》の《攻撃》を選んで伏せ札にした場合でもフェイズは終了しますか？',
      'ajp': '終了します。「引用」で選んだカードが《全力》であるなら使用しても伏せ札にしてもフェイズが終了します。'
    },
    {
      'qjp': 'カードを見たうえで選ばないことはできますか？',
      'ajp': 'できます。《攻撃》カードが《全力》しかなかった場合には、選ばないことでフェイズの終了を避けることができます。'
    }]
  },
  {
    'name': '「煽動」',
    'list': [{
      'ajp': '計略全般へのFAQもご覧ください。',
      'a': '请参阅[计略]特性相关的FAQ。'
    }]
  },
  {
    'name': '「壮語」',
    'list': [{
      'ajp': '計略全般へのFAQもご覧ください。',
      'a': '请参阅[计略]特性相关的FAQ。'
    },
    {
      'qjp': '鬼謀の効果で捨て札にするカードを選ぶのはどちらですか？',
      'ajp': '相手が捨て札にするカードを選ぶことができます。'
    }]
  },
  {
    'name': '「論破」',
    'list': [{
      'qjp': '相手の伏せ札を封印することはできますか？',
      'ajp': 'いいえ、できません。'
    },
    {
      'qjp': '相手の捨て札が無い状態で「論破」を使用することはできますか？',
      'ajp': 'はい、使用することができます。《行動》カードや《付与》カードは使用するための条件はありません。'
    }]
  },
  {
    'name': '「完全論破」',
    'list': [{
      'qjp': '相手の伏せ札を封印することはできますか？',
      'ajp': 'いいえ、できません。'
    },
    {
      'qjp': '「完全論破」を「生体活性」で未使用に戻し、さらに使用した場合、複数枚のカードを封印できますか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    }]
  },
  {
    'name': '「皆式理解」',
    'list': [{
      'ajp': '計略全般へのFAQもご覧ください。',
      'a': '请参阅[计略]特性相关的FAQ。'
    },
    {
      'qjp': '鬼謀の効果で選ぶ付与札は、展開中のものに限られますか？',
      'ajp': 'はい、展開中のもののみとなります。『付与札』と記述されている場合、それは桜花結晶の載っている《付与》カードのことを指します。'
    }]
  },
  {
    'name': '「天地反駁」',
    'list': [{
      'qjp': '「天地反駁」はダメージの片方が「-」の場合でもダメージの入れ換えは発生しますか？',
      'ajp': 'はい、入れ替えが発生します。例えば「反論」の場合はダメージが「1/-」から「-/1」となります。'
    },
    {
      'qjp': '「天地反駁」の展開中に「圧気」が破棄された場合、「-/3」の《攻撃》になりますか？',
      'ajp': 'はい、そうなります。「天地反駁」によるダメージの入れ替えはあなたの行う《攻撃》全てに適用されます。'
    }]
  },
  {
    'name': '「森羅判証」',
    'list': [{
      'qjp': '『あなたの他の付与札が破棄された時』とは具体的にどのタイミングですか？',
      'ajp': '破棄される付与札の持つ【破棄時】効果を全て解決した後になります。'
    },
    {
      'qjp': '隙を持つ付与札がある時に、相手からの攻撃でライフにダメージを受け、その付与札が伏せ札になりました。「森羅判証」によるダメージは発生しますか？',
      'ajp': 'いいえ、発生しません。隙によって付与札が伏せ札になる処理は付与札の破棄ではありません。そのため「森羅判証」によるダメージもありません。'
    },
    {
      'qjp': '相手のライフが1の時、「森羅判証」と「壮語」の上に置かれた桜花結晶が同時に0になりました。勝利できますか？',
      'ajp': 'それがもしあなたのターンに起こったことならば、付与札の破棄を解決する順序をあなたが決められるため勝利できます。それが相手のターンに起こったことならば、順序を相手が選択するため、おそらくあなたは敗北することとなるでしょう。'
    },
    {
      'qjp': '「森羅判証」が展開中に「弛緩毒」が破棄された場合、「森羅判証」によるダメージは与えられますか？',
      'ajp': '与えられます。'
    }]
  },
  {
    'name': '「真言」',
    'list': [{
      'ajp': '計略全般へのFAQもご覧ください。',
      'a': '请参阅[计略]特性相关的FAQ。'
    }]
  },
  {
    'name': '「使徒」',
    'list': [{
      'ajp': '計略全般へのFAQもご覧ください。',
      'a': '请参阅[计略]特性相关的FAQ。'
    },
    {
      'qjp': '「使徒」の【展開時】効果による《攻撃》に対応して「絶唱絶華」が使われ、現在のフェイズが終了した場合どうなりますか？',
      'ajp': '次の計略を準備する事ができません。終了フェイズに計略を準備することになります。なお、「使徒」はフェイズを終了する過程で＜付与札＞領域に移動します。'
    },
    {
      'qjp': '「使徒」の【展開時】効果による《攻撃》に対応して「虚偽」が使われた場合、「使徒」の上に置かれる桜花結晶はいくつですか？',
      'ajp': '2つです。【展開時】効果による《攻撃》の時点で、既に2つの桜花結晶が「使徒」の上に置かれています。'
    }]
  },
  {
    'name': '「全知経典」',
    'list': [{
      'ajp': '計略全般へのFAQもご覧ください。',
      'a': '请参阅[计略]特性相关的FAQ。'
    },
    {
      'qjp': '【攻撃後】効果によって計略を実行したカードは、ライラを宿している場合帯電しますか？',
      'ajp': '【攻撃後】効果による計略の実行はカードの使用ではないため、帯電しません。'
    },
    {
      'qjp': '【攻撃後】効果の処理中に、新しく計略を持つカードが捨て札になりました。このカードの計略も実行できますか？',
      'ajp': '捨て札にあるため実行できます。'
    },
    {
      'qjp': '【攻撃後】効果の処理中に、一度計略を実行したカードが捨て札を離れ、また捨て札になりました。このカードの計略は実行できますか？',
      'ajp': '一時的に捨て札を離れていたとしても、一度計略を実行したカードについては計略を実行できません。'
    },
    {
      'qjp': '【攻撃後】効果によって「詭弁」の計略を鬼謀で実行し、相手の計略を持つカードを使用するなどの方法で計略が変更されました。これよりあとの計略はどうなりますか？',
      'ajp': '次の計略からは変更後の計略として実行されます。'
    }]
  }]
},
{
  name: 'HAGANE 破钟',
  list: [{
    'name': '远心特性相关的FAQ',
    'namejp': '遠心全般へのFAQ',
    'list': [{
      'ajp': '遠心の『ターン開始時の間合』は開始フェイズの処理を行う前の間合を参照します。集中力の獲得や付与札から桜花結晶を1つずつ落とす、造花結晶を燃焼済にするといった処理の前の状態を参照します。そのため「風舞台」といった間合を変化させる付与札や騎動前進/後退は遠心の条件に影響します。'
    },
    {
      'ajp': '遠心を持つカードの使用条件は『ターン開始時から間合が2以上後ろに離れていること』であり、間合が近づいている場合は遠心の条件を満たしません。単純に変化量のみを参照する場合は『2以上変化したとき』という表記になります。'
    },
    {
      'qjp': '《攻撃》が対応により間合が変化して失敗しました。このとき、間合がターン開始時よりも2以上離れていれば、攻撃を行っていないとみなし遠心の発動条件を満たすことはできますか？',
      'ajp': 'いいえ、遠心の条件は満たされません。対応により《攻撃》が失敗した場合であってもそのターン中に《攻撃》を行っているとみなされます。'
    },
    {
      'qjp': '遠心の条件である『攻撃を行っていない』は遠心を持つカードを使うプレイヤーだけを参照しますか？　例えば、相手が間合2で「柄打ち」を使用し、続けて間合4まで後退して「斬」を使用した場合に、「斬」に対応で「鳶影」を使用し「遠心撃」を使用することはできますか？',
      'ajp': 'はい、可能です。参照されるのは遠心を持つカードを使うプレイヤーだけです。'
    },
    {
      'qjp': '開始フェイズに《攻撃》を行った場合に、メインフェイズに遠心の条件を満たすことはできますか？',
      'ajp': 'できません。遠心は同じターンに《攻撃》を行っているかどうかが条件の一つとなります。そのため開始フェイズに《攻撃》を行っている場合遠心の条件を満たすことはできません。'
    },
    {
      'qjp': '開始フェイズに「圧気」が破棄されましたが、その時の間合が5でした。　メインフェイズに遠心の条件を満たすことはできますか？',
      'ajp': 'できます。効果によって発生した《攻撃》が適正距離の不正で（対応を挟まずに）失敗した場合、それは《攻撃》を行っているとはみなしません。'
    },
    {
      'qjp': '遠心を持つカードを「鳶影」「引用」などといったカードの効果で使用できますか？',
      'ajp': 'そのターン中にあなたが攻撃を行っておらず、現在の間合がターン開始時より2以上離れているなら可能です。'
    }]
  },
  {
    'name': '「遠心撃」',
    'list': [{
      'ajp': '遠心全般へのFAQもご覧ください。',
      'a': '请参阅[远心]特性相关的FAQ。'
    },
    {
      'qjp': 'ターン開始時の間合が2で、2歩後退して間合4で遠心撃を使用しました。これに対応して「ひきあし/もぐりこみ」を使用し、間合が3になりました。この場合、攻撃は失敗しますか？',
      'ajp': 'いいえ、失敗しません。遠心はあくまでカードを使用するときの制限になります。よって、カードを使用した後に間合が変化したとしても影響しません。'
    },
    {
      'qjp': '手札に伏せ札にできないカード(毒)がある場合、「遠心撃」を使用することはできますか？',
      'ajp': 'はい、使用することができます。「遠心撃」の【攻撃後】効果では毒は伏せ札にならず手札に残ることになります。'
    }]
  },
  {
    'name': '「砂風塵」',
    'list': [{
      'qjp': '間合が2以上変化するとは、近づいていても離れていてもどちらでもよいのでしょうか？',
      'ajp': 'はい、どちらでも構いません。'
    }]
  },
  {
    'name': '「大地砕き」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「超反動」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「円舞錬」',
    'list': [{
      'ajp': '遠心全般へのFAQもご覧ください。',
      'a': '请参阅[远心]特性相关的FAQ。'
    }]
  },
  {
    'name': '「鐘鳴らし」',
    'list': [{
      'ajp': '遠心全般へのFAQもご覧ください。',
      'a': '请参阅[远心]特性相关的FAQ。'
    },
    {
      'qjp': 'ライフ3以下の状態で「鐘鳴らし」の下の効果を選択したあと、「一閃」を使用した場合、そのダメージはどうなりますか？',
      'ajp': '総合ルールよりダメージの修正は分類ごとに同時に適用されます。「鐘鳴らし」の効果と決死の効果はどちらも加算であるので、同時に適用されます。元のダメージが2/2なので、「鐘鳴らし」の効果では+2/+0、決死の効果で+1/+0となり、最終的に5/2となります。'
    },
    {
      'qjp': '「鐘鳴らし」を使用した後、前進などをしてから攻撃した場合、ターン開始時の間合から2以上離れていなくても効果は適用されますか？',
      'ajp': 'はい、されます。'
    },
    {
      'qjp': '「鐘鳴らし」の下の効果を使用したあと「律動弧戟」を使用した場合、ダメージはどのようになりますか？',
      'ajp': '最初の《攻撃》のみ「鐘鳴らし」の効果を受けます。そのため「3-4,3/1」「4-5,1/1」「3-5,2/2」の《攻撃》が発生します。'
    },
    {
      'qjp': '「鐘鳴らし」を「いんだすとりあ」により複製しました。「砂風塵」を使用する前に「でゅーぷりぎあ」を使用し下の効果を1回、2回、3回選択した場合、「砂風塵」のダメージはそれぞれどのようになりますか？',
      'ajp': 'それぞれ「3/-」「5/-」「7/-」となります(なお「砂風塵」は超克を持たないため、3つ目のダメージは最終的には「5/-」となります）。「鐘鳴らし」によるダメージの加算はすべて同時に適用されます。そのため元々が「1/-」の《攻撃》への強化はすべて「+2/+0」となります。'
    },
    {
      'qjp': '「鐘鳴らし」の下の効果を選択し、「大天空クラッシュ」（X=3）を使用しました。相手はこれに対応してX=2となるように間合を移動させました。この場合、《攻撃》のダメージはどのようになりますか？',
      'ajp': '「大天空クラッシュ」のダメージは間合の変化量に応じて適宜計算されます。この場合、X=2となるため元のダメージは「2/1」となり、「鐘鳴らし」の効果によって「4/1」となります。'
    },
    {
      'q': '先打出「敲钟」，然后打出「梳流」最后攻击结算是多少？',
      'a': '-伤不能计算以上或以下，最后为-/1。'
    }]
  },
  {
    'name': '「引力場」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「大天空クラッシュ」',
    'list': [{
      'ajp': '超克へのFAQもご覧ください。',
      'a': '请参阅超克关键词相关的FAQ。'
    },
    {
      'qjp': '「大天空クラッシュ」を使用する際、相手のオーラが5であっても間合の変化が6(X=6)であった場合、ダメージは6/3という扱いになりますが、オーラで受けることができないものとして解決されるのでしょうか？',
      'ajp': '相手に何も対応がなければオーラで受けることは不可能となります。'
    },
    {
      'qjp': '「大天空クラッシュ」を使用したときに対応の「詩舞」や「ひきあし/もぐりこみ」などにより間合の変化量が変わった場合、ダメージは変化するのでしょうか？',
      'ajp': 'ダメージは変化します。対応によって間合の変化量が変わった場合、それに合わせて「大天空クラッシュ」のダメージも変化します。'
    },
    {
      'qjp': '「天地反駁」がある状態で「大天空クラッシュ」を使用したらダメージはどうなりますか？',
      'ajp': '総合ルールより数値の適用は、代入→入れ替えの順となります。まず「大天空クラッシュ」の効果によりダメージが決定され、その後「天地反駁」によりオーラとライフのダメージが入れ替わります(例えば、間合の変化が5の場合は、まず5/3となり、最終的に3/5となります)。'
    }]
  },
  {
    'name': '「大破鐘メガロベル」',
    'list': [{
      'qjp': '《付与》の切札が付与札である状態で、「大破鐘メガロベル」を使用したらどうなりますか？',
      'ajp': '付与札であるカードはまだ使用済ではありませんので、効果は適用されません（珍しい例外ですが、その付与札が相手の切札である場合だけは、あなたの切札ではないので効果を適用できます）。'
    }]
  },
  {
    'name': '「大重力アトラクト」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「大山脈リスペクト」',
    'list': [{
      'ajp': '遠心全般へのFAQもご覧ください。',
      'a': '请参阅[远心]特性相关的FAQ。'
    },
    {
      'ajp': 'カードを使用する効果へのFAQもご覧ください。'
    },
    {
      'qjp': '捨て札に2枚の「でゅーぷりぎあ」がある場合、この2枚を選ぶことはできますか？',
      'ajp': 'はい、できます。それぞれは異なるカードとして扱われます。'
    },
    {
      'qjp': 'カード2枚を選択した後、片方の解決中にフェイズが終了した場合(「遠心撃」)、もう片方はどうなりますか？',
      'ajp': 'もう片方は使用されずに捨て札のままになります。'
    },
    {
      'qjp': 'カード2枚を選択した後、1枚目の解決後に2枚目が捨て札を離れていた場合どうなりますか？',
      'ajp': '『あなたの捨て札にある～カード』でなくなっているため、2枚目のカードは使用できません。'
    }]
  },
  {
    'name': '「炉火」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「旋回起」',
    'list': [{
      'qjp': '現在の間合がターン開始時の間合から2以上変化していないときにこのカードを使用しました。集中力1は得られますか？',
      'ajp': 'いいえ、得られません。'
    }]
  },
  {
    'name': '「大錬成マテリアル」',
    'list': [{
      'ajp': '終端へのFAQもご覧ください。',
      'a': '请参阅终端关键词相关的FAQ。'
    },
    {
      'qjp': '相手の捨て札から「錬成攻撃」を使用しました。このターン私の「大錬成マテリアル」は再起しますか？',
      'ajp': 'はい、します。'
    },
    {
      'qjp': '相手のターンに対応で「錬成攻撃」を使用しました。「大錬成マテリアル」は再起しますか？',
      'ajp': 'いいえ、しません。「大錬成マテリアル」を再起させるにはあなたのターンにあなたが「錬成攻撃」を使用する必要があります。'
    }]
  },
  {
    'name': '「錬成攻撃」',
    'list': [{
      'ajp': '打ち消されないへのFAQもご覧ください。'
    },
    {
      'qjp': '金床に「梳流し」があり、集中力が2です。「錬成攻撃」を使用したなら、それは山札の一番上に戻りますか？',
      'ajp': 'いいえ、戻りません。＜使用中＞領域から＜山札＞領域へは移動しません。'
    },
    {
      'qjp': '「引用」や「影菱」により相手の手札にある「錬成攻撃」を伏せ札にできますか？また、「黒き波動」などにより捨て札にできますか？',
      'ajp': 'いいえ、できません。それらの効果で手札にある「錬成攻撃」を選ぶことはできません。'
    },
    {
      'qjp': '「砂風塵」により相手の手札にある「錬成攻撃」が公開された場合、どうなりますか？',
      'ajp': '「錬成攻撃」は捨て札になります。'
    },
    {
      'qjp': '「詭弁」により相手の捨て札にある「錬成攻撃」を使用できますか？',
      'ajp': 'はい、できます。'
    },
    {
      'qjp': '金床に桜花結晶が2つ存在するとき「錬成攻撃」が得るのは+3/+2と距離拡大(遠3)ですか？それとも+1/+1と距離拡大(遠1)ですか？',
      'ajp': 'その場合+3/+2と距離拡大(遠3)です。'
    },
    {
      'qjp': '金床に桜花結晶が2つ存在するときに「錬成攻撃」を使用し、「反論」で対応されました。ダメージは打ち消されますか？',
      'ajp': 'いいえ、「この《攻撃》は打ち消されない」を持つ場合ダメージのみの打ち消しもされません。'
    },
    {
      'qjp': 'ライラを宿していて、金床に「獣爪」があります。このカードを使用したときに帯電しますか？',
      'ajp': 'はい、します。このカードは使用者を複製しないためハガネのカードです。'
    },
    {
      'qjp': '金床に「撃ち落とし」があります。「錬成攻撃」はコダマのカードですか？',
      'ajp': 'いいえ、使用者を複製しないためハガネのカードです。'
    },
    {
      'qjp': '相手の「錬成攻撃」を使用した場合、【常時】効果ではどちらのプレイヤーの金床を参照しますか？',
      'ajp': 'カードは一部の情報を除き保有者の＜金床＞にあるカードの複製ですが、追加で得る効果では使用したプレイヤーの＜金床＞にある桜花結晶を参照します。ハガネA1を宿していないなら＜金床＞は存在しないため、0以上の効果のみ得ます。'
    },
    {
      'qjp': '「いんだすとりあ」に「ぶらすたー」が封印されており、「でゅーぷりぎあ」が金床にあります。「錬成攻撃」の使用者は誰ですか？',
      'ajp': 'ハガネになります。'
    }]
  }]
},
{
  'name': 'CHIKAGE 千影',
  list: [{
    name: '毒袋特性相关的FAQ',
    namejp: '毒袋全般へのFAQ',
    list: [{
      'qjp': '毒が手札に3枚ある状態でターンを終了したらどうなりますか？',
      'ajp': '毒は伏せ札にできないので毒3枚を手札に持った状態で相手のターンになります。'
    },
    {
      'qjp': '手札に毒がある相手に対して「砂風塵」などの手札のカードを無作為に選ぶ効果を解決しました。どのようにすればよいですか？',
      'ajp': 'ダイスなどにより無作為に選んでください。メガミタロットを裏向きにして引くようにすれば、追加のコンポーネントを用意せずに処理できます。'
    },
    {
      'qjp': '捨て札にある毒を「要返し」などの効果で山札の底に置くことはできますか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    },
    {
      'qjp': '山札が2枚以上あり、毒が山札の上に1枚ある相手に「立論」を使用したらどうなりますか？',
      'ajp': '毒の下にある1枚のカードを伏せ札にします。'
    }]
  },
  {
    'name': '「飛苦無」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「毒針」',
    'list': [{
      'ajp': '毒袋全般へのFAQもご覧ください。',
      'a': '请参阅[毒袋]特性相关的FAQ。'
    },
    {
      'qjp': '毒を相手の山札の上に置く際、表向きか裏向きかどちらで置けばよいですか？',
      'ajp': '山札にあるカードの状態は裏向きですので、裏向きで置いてください。'
    },
    {
      'qjp': '「引用」により相手の「毒針」を使用しました。毒を相手の山札に加えることはできますか？',
      'ajp': 'あなたがチカゲを宿しているならば可能です。そうでないならば、毒袋がありませんのでできません。'
    }]
  },
  {
    'name': '「遁術」',
    'list': [{
      'qjp': '相手が対応として「遁術」を使用した後、私は「見切り」などのカードで間合を近づけることはできますか？',
      'ajp': 'はい、可能です。禁止されるのは基本動作による前進だけとなります。'
    }]
  },
  {
    'name': '「首切り」',
    'list': [{
      'qjp': '【攻撃後】効果で捨て札にするカードを選ぶのはどちらですか？',
      'ajp': '相手が捨て札にするカードを選びます。'
    }]
  },
  {
    'name': '「毒霧」',
    'list': [{
      'ajp': '毒袋全般へのFAQもご覧ください。',
      'a': '请参阅[毒袋]特性相关的FAQ。'
    }]
  },
  {
    'name': '「抜き足」',
    'list': [{
      'qjp': '「抜き足」が展開中で、間合に桜花結晶がありません。その際に離脱した場合、現在の間合はどうなりますか？',
      'ajp': '現在の間合は0のままです。離脱により間合に1つの桜花結晶が置かれることとなりましたが、そこから間合が2小さくなるため0となります。'
    },
    {
      'qjp': '「抜き足」が展開中で現在の間合が8（間合に桜花結晶が10個ある）のときに後退はできますか？',
      'ajp': 'いいえ、できません。間合に置くことのできる桜花結晶の上限は10個なのでそれ以上置くような移動はできません。'
    }]
  },
  {
    'name': '「泥濘」',
    'list': [{
      'qjp': '「泥濘」が付与札である間、「跳ね兎」などのカードで間合を離すことはできますか？',
      'ajp': 'はい、可能です。禁止されるのは基本動作による離脱と後退だけとなります。'
    }]
  },
  {
    'name': '「滅灯の魂毒」',
    'list': [{
      'ajp': '毒袋全般へのFAQもご覧ください。',
      'a': '请参阅[毒袋]特性相关的FAQ。'
    }]
  },
  {
    'name': '「叛旗の纏毒」',
    'list': [{
      'qjp': 'ダメージのどちらかが「-」であるとはどういう意味でしょうか？',
      'ajp': '「梳流し」(-/1)や「浦波嵐」(2/-)のようにどちらかのダメージを持たない《攻撃》を指します。'
    }]
  },
  {
    'name': '「流転の霞毒」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「闇昏千影の生きる道」',
    'list': [{
      'qjp': '《付与》の切札が付与札である状態で、「闇昏千影の生きる道」の【破棄時】効果が解決されたらどうなりますか？',
      'ajp': '付与札であるカードはまだ使用済ではありませんので、効果は適用されません（未使用に戻ることもありません）（珍しい例外ですが、その付与札が相手の切札である場合だけは、あなたの切札ではないので効果を適用できます）。'
    },
    {
      'qjp': '開始フェイズに行う山札の再構成でも失敗しますか？',
      'ajp': 'はい、ライフへとダメージを受けているので失敗して未使用になります。隙と異なり再構成によるダメージでも失敗します。'
    },
    {
      'qjp': '「マグナムカノン」を使用した場合はどうなりますか？',
      'ajp': 'ライフへのダメージは受けていませんので失敗しません。'
    }]
  },
  {
    'name': '「仕掛け番傘」',
    'list': [{
      'qjp': '現在の間合が2で手札が2枚の相手に「引用」を使用したら、「仕掛け番傘」がありました。これを使用することはできますか？',
      'ajp': 'できます。「引用」を使用している時点で相手の手札は2枚ある状態です。攻撃カードを使用する際に間合の確認を行う場合、そのカードはまだ手札にある状態です。「仕掛け番傘」は相手の手札から使用しますが、《攻撃》を行うのは「引用」を使用したプレイヤーのため、この時の「相手の手札」は「引用」を使用したプレイヤーの相手の手札を指すことになります。'
    }]
  },
  {
    'name': '「奮迅」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「残滓の絆毒」',
    'list': [{
      'qjp': '「残滓の絆毒」への対応の結果、手札の枚数が変化した場合、どうなりますか？',
      'ajp': 'Xの値が再計算されます。'
    }]
  },
  {
    'name': '「麻痺毒」',
    'list': [{
      'qjp': '相手の《攻撃》に対して対応で「鳶影」を使用し「麻痺毒」を封印した「いんだすとりあ」により複製された「でゅーぷりぎあ」を使用した場合、相手の《攻撃》を解決せずにフェイズが終了しますか？',
      'ajp': 'はい、「麻痺毒」によりフェイズが終了するため《攻撃》は解決されません。'
    }]
  },
  {
    'name': '「幻覚毒」',
    'list': [{
      'qjp': '私のフレアが1以下であるときに「幻覚毒」を使用することはできますか？',
      'ajp': 'はい、使用できます。「幻覚毒」に限らず矢印で記述されている効果は可能な限り解決します。移動元に充分な数がなくても使用でき、「幻覚毒」を使用したときにフレアに1つしかない場合はその1つをダストに動かすことになります。'
    }]
  },
  {
    'name': '「弛緩毒」',
    'list': [{
      'qjp': '攻撃をした後に「弛緩毒」を使用することはできますか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    },
    {
      'qjp': '「弛緩毒」を展開中に「圧気」や「律動弧戟」などの効果による《攻撃》はできますか？',
      'ajp': 'はい、できます。「弛緩毒」は《攻撃》カードの使用を禁止し、「圧気」や「律動弧戟」などの効果による《攻撃》には影響しません。ただし設置からの「鋼糸」や「影菱」は《攻撃》カードであるため使用できません。'
    },
    {
      'qjp': '「弛緩毒」と「圧気」の上の桜花結晶が同時に無くなった場合、「弛緩毒」を展開していたプレイヤーは「圧気」の効果による《攻撃》に対して対応で「反論」を使用することはできますか？',
      'ajp': '「弛緩毒」と「圧気」をどの順で破棄するかによります。「弛緩毒」の破棄を先に解決した場合、「圧気」の【破棄時】効果に対応で「反論」を使用することができます。逆に「圧気」を先に破棄した場合は、「弛緩毒」はまだ＜付与札＞にあるため【展開中】効果により「反論」は使用できません。'
    }]
  },
  {
    'name': '「滅灯毒」',
    'list': [{
      'qjp': '「滅灯毒」は相手の毒袋に戻りませんが、どういうことでしょうか？',
      'ajp': 'このゲーム中は、永久にあなたのデッキに加わったままです。'
    }]
  }]
},
{
  name: 'KURURU 枢',
  list: [{
    name: '机巧特性相关的FAQ',
    namejp: '機巧全般へのFAQ',
    list: [{
      'qjp': '機巧の完成にはカードタイプの数がちょうどでなくてはいけませんか？',
      'ajp': '機巧の完成に必要な数以上あればよいので、多くてもかまいません。（例 捨て札に《攻撃》カードが3枚以上ある場合でも「とるねーど」の上の歯車枠の効果は解決されます）'
    },
    {
      'qjp': '使用しているカードそのものを機巧の完成条件に含めることはできますか？　また、表向きで封印されているカードを機巧の完成条件に含めることはできますか？',
      'ajp': 'どちらもできません。使用するカードの機巧が完成されているかどうかは、その時点での捨て札、付与札、使用済の切札のカードを参照します。その際、使用されつつあるカードはまだ捨て札に置かれていません。'
    },
    {
      'qjp': 'カードの効果で歯車枠をもつカードを使用した場合（「分身の術」など）、最初に使用したカードのカードタイプを機巧の完成条件に数えることはできますか？',
      'ajp': 'できません。カードの効果によってカードを使用している場合、元のカードはまだ捨て札や使用済の切札ではありません。'
    },
    {
      'qjp': '歯車枠の効果は条件を満たしていた場合、任意で使用できますか、それとも強制ですか？',
      'ajp': '条件を満たしている場合、効果は強制で発動します。例えば捨て札に「遁術」があるときに「りふれくた」を使用した場合、ダストに桜花結晶があれば4つまで「りふれくた」の上に乗せる必要があります。'
    },
    {
      'qjp': '機巧の条件を満たしていないカードを使用し、捨て札にすることはできますか？',
      'ajp': 'はい、できます。機巧は条件を満たしていない場合、枠内のテキストが無効となっているだけであり使用を制限しているものではありません。'
    },
    {
      'qjp': '私がチカゲとクルルを宿しているとき、相手が使用した「弛緩毒」は私の機巧の条件に含まれますか？',
      'ajp': 'いいえ、含まれません。相手が使用した「弛緩毒」は相手の付与札として数えられるため、あなたの機巧条件には数えられません。'
    },
    {
      'qjp': '追加札にあるカードを機巧の条件として数えることはできますか？',
      'ajp': 'いいえ、できません。機巧は捨て札、付与札、切札といった領域にあるカードだけを数えます。'
    },
    {
      'qjp': '「他のメガミのカードで組み立てたならば」と書かれた歯車枠の効果は他のメガミのカードとクルルのカードをそれぞれ含んで達成してもいいですか？',
      'ajp': '他のメガミのカードのみで条件を満たす必要があります。他のメガミのカードのみで条件を満たしている状態ならば、それに加えて対応するカードタイプのクルルのカードが捨て札・使用済・付与札であっても構いません。'
    }]
  },
  {
    'name': '「えれきてる」',
    'list': [{
      'ajp': '機巧全般へのFAQもご覧ください。',
      'a': '请参阅[机巧]特性相关的FAQ。'
    }]
  },
  {
    'name': '「あくせらー」',
    'list': [{
      'ajp': '機巧全般へのFAQもご覧ください。',
      'a': '请参阅[机巧]特性相关的FAQ。'
    },
    {
      'ajp': 'カードを使用する効果へのFAQもご覧ください。'
    },
    {
      'qjp': '「あくせらー」の効果で「りげいなー」を使用し《全力》の切札を使用しました。このときのそれぞれのカードの状態はどのようになりますか？',
      'ajp': '「あくせらー」、「りげいなー」、《全力》の切札はそれぞれ＜使用中＞領域になります。切札は＜使用中＞領域にある間は使用中状態となり、解決後に使用済となり＜切札＞領域に表向きで置かれます。その後「りげいなー」と「あくせらー」が＜捨て札＞領域に置かれます。'
    },
    {
      'qjp': '「あくせらー」により手札から「りげいなー」を使用しました。「りげいなー」の解決をしている間、「あくせらー」「りげいなー」は機巧の条件に数えますか？',
      'ajp': 'いいえ、数えません。「りげいなー」の解決をしている間、この効果を持つカードと「あくせらー」は＜使用中＞という領域にあるため機巧の条件として数えません。'
    }]
  },
  {
    'name': '「くるるーん」',
    'list': [{
      'qjp': '「くるるーん」を対応として使用した「鳶影」で伏せ札から使用できますか？',
      'ajp': '対応ではなく「鳶影」のカード効果としてカードを使用しているため、できません。'
    },
    {
      'qjp': '「くるるーん」で解決する効果を2つ選んだ後、それらはテキストにある上から順に解決するのでしょうか、それとも好きな順番で解決できるのでしょうか？',
      'ajp': '「くるるーん」の効果は2つの効果を選び、好きな順番で解決することができます。'
    }]
  },
  {
    'name': '「とるねーど」',
    'list': [{
      'ajp': '機巧全般へのFAQもご覧ください。',
      'a': '请参阅[机巧]特性相关的FAQ。'
    },
    {
      'qjp': '歯車枠が2つ書かれていますが、両方の条件を満たしてる場合は両方とも解決されますか？',
      'ajp': '両方とも解決されます。'
    }]
  },
  {
    'name': '「りげいなー」',
    'list': [
      {
        'ajp': '機巧全般へのFAQもご覧ください。',
        'a': '请参阅[机巧]特性相关的FAQ。'
      },
      {
        'ajp': 'カードを使用する効果へのFAQもご覧ください。'
      },
      {
        'qjp': '「りげいなー」で選んだ切札は、効果の処理を行う間は使用中の扱いになるのでしょうか？',
        'ajp': 'はい、そうなります。効果によって使用されたカードについても手札などからカードを使用した時と同様に＜使用中＞領域に置かれることになります。'
      },
      {
        'qjp': '使用済の「叛旗の纏毒」のみが私の表側のカードである時に「りげいなー」を使用し歯車枠の効果で「叛旗の纏毒」を選択し使用することは可能でしょうか？',
        'ajp': '「叛旗の纏毒」のみで「りげいなー」の機巧の条件を満たしているため使用することができます。歯車枠の効果の解決中にその機巧の条件が満たされなくなったとしても、その効果が取り消されることはありません。'
      },
      {
        'qjp': '「弛緩毒」を展開中のプレイヤーが「りげいなー」を使用し、切札の《攻撃》カードを選択することはできますか？',
        'ajp': '選択することはできますが、使用はできません。「弛緩毒」の効果によって《攻撃》カードの使用は禁止されています。'
      },
      {
        'qjp': '「あくせらー」の効果で伏せ札のこのカードを使用できますか？',
        'ajp': 'できません。カードの効果による使用は通常の方法ではありません。'
      },
      {
        'qjp': 'コストを支払わずとはどういうことですか？',
        'ajp': '消費や追加コストの支払いを行わないことを意味します。燃焼や「尸」による追加コストも支払わずに使用可能です。'
      },
      {
        'qjp': '「Roaring」のテキスト中のコストを支払わないことは可能ですか？',
        'ajp': 'いいえ、できません。コストという用語が汎用化されるに伴い生じた不整合です。機能は変化しないテキスト更新がいずれ行われる予定です(カードの配布は行われません)。'
      },
      {
        'qjp': '《攻撃》カードの適正距離やダメージを増減させて使用した場合、他のカードによって適正距離やダメージに対して数値修正が行われるとどうなりますか？',
        'ajp': '数値の増減は《攻撃》カード自体が持つ情報を変化させるものであり、《攻撃》に対する他の数値修正より先に適用されます。'
      },
      {
        'qjp': '適正距離を1増加させて「Alpha-Edge」を使用することを選択しました。「Alpha-Edge」の適正距離はどうなりますか？',
        'ajp': '2,4,6,8になります。'
      },
      {
        'qjp': '離脱した後「あくせらー」からこのカードを使用し、「手裏剣」のオーラダメージを上げて使用しました。「玄塗り」に対応された場合ダメージはどうなりますか？',
        'ajp': '2/1になります。「玄塗り」によってオーラダメージを参照した時点では3/1なため、-1/+0されます。'
      },
      {
        'qjp': '鏡映数が3のときに納を1減少させて「寄花」を使用しました。納は-1になりますか？',
        'ajp': 'いいえ、なりません。納が0未満になる場合代わりに0になります。'
      },
      {
        'qjp': '「こねくとだいぶ」の【使用済】効果を適用してこのカードを使用しました。2枚のカードを使用するにあたり、別々の領域からそれぞれ1枚ずつ選ぶことは可能ですか？',
        'ajp': 'はい、可能です。'
      },
      {
        'qjp': '「こねくとだいぶ」の【使用済】効果を適用してこのカードを使用しました。2枚のカードを使用するにあたり、増減させる値をそれぞれ別で選ぶことは可能ですか？',
        'ajp': 'はい、可能です。'
      },
      {
        'qjp': '「こねくとだいぶ」の【使用済】効果を適用してこのカードを使用しました。カードを使用するに際して値を1だけ増減させることはできますか？',
        'ajp': 'いいえ、できません。増減させる場合必ず2増減させてください。'
      }
    ]
  },
  {
    'name': '「もじゅるー」',
    'list': [{
      'qjp': '【展開中】効果で基本動作を行う際に、コスト（集中力か手札を伏せ札にする）を払う必要がありますか？',
      'ajp': 'いいえ、効果で基本動作を行う場合、コストは必要ありません。'
    },
    {
      'qjp': '「もじゅるー」の【展開中】効果は「どれーんでびる」の【使用済】効果での使用でも解決されますか？',
      'ajp': 'はい、解決されます。'
    },
    {
      'qjp': '「もじゅるー」展開中に「あくせらー」で《全力》である《行動》カードを使用した場合、基本動作は何回行うことができますか？',
      'ajp': '2回行うことができます。「あくせらー」使用による《行動》カードの使用と、「あくせらー」から使用した《全力》である《行動》カードの使用でそれぞれ「もじゅるー」の効果が発動します。'
    },
    {
      'qjp': '「もじゅるー」展開中に「分身の術」で「あくせらー」を使用しました。1回目の「あくせらー」で手札から《全力》カードを使用せず、2回目の「あくせらー」で「斬撃乱舞」を使用しました。どのようになりますか？',
      'ajp': 'まず、1回目の「あくせらー」の解決が終わり、基本動作を1回行います。その後、2回目の「あくせらー」から「斬撃乱舞」が使用され、その後に基本動作を1回行います。そしてそこまでを終えたところで「分身の術」の解決が終わるので、基本動作を1回行います。'
    },
    {
      'qjp': '相手の《攻撃》への対応として「鳶影」を使用し、伏せ札の「もじゅるー」を使用しました。「鳶影」の解決時、展開中の「もじゅるー」の効果は使用できますか？',
      'ajp': 'いいえ、使用できません。「鳶影」を使用した時には「もじゅるー」は付与札にないため【展開中】効果は解決されません。'
    },
    {
      'qjp': '「もじゅるー」展開中に相手の《攻撃》に対応して「鳶影」で《行動》カードを使用した場合、どのタイミングで何回基本動作を行いますか？',
      'ajp': 'まず「鳶影」により使用されたカードを解決します。そのカードが《行動》カードであるなら「もじゅるー」の効果で基本動作を行います。その後「鳶影」の解決が終了するため「もじゅるー」の効果により基本動作を行います。その後、相手の《攻撃》の解決を行います。'
    },
    {
      'qjp': '「もじゅるー」展開中に《行動》カードを使用し、その解決前に「もじゅるー」が破棄された場合、基本動作は行えますか？',
      'ajp': '行えます。《行動》カードを使用した直後に、『その解決後に基本動作を1回行ってもよい。』という【展開中】効果が解決されていると考えてください。'
    }]
  },
  {
    'name': '「りふれくた」',
    'list': [{
      'ajp': '機巧全般へのFAQもご覧ください。',
      'a': '请参阅[机巧]特性相关的FAQ。'
    },
    {
      'qjp': '機巧が完成しない状態で使用した場合どうなりますか？',
      'ajp': '即座に捨て札になると把握しておけば、大体は問題ありません。'
    },
    {
      'qjp': '『各ターン』は私のターンを含みますか？',
      'ajp': 'はい、含みます。'
    },
    {
      'qjp': '「りふれくた」によって打ち消される《攻撃》に対応はできますか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    },
    {
      'qjp': '「りふれくた」が付与札にある時に相手のターンの開始フェイズに間合5で「圧気」が破棄され、その後メインフェイズで相手が「斬」を使用しました。「斬」は打ち消されますか？',
      'ajp': 'いいえ、「圧気」の【破棄時】効果による《攻撃》は適正距離ではなく不正なものとして消去されているため、「斬」が相手の1回目の《攻撃》になります。'
    }]
  },
  {
    'name': '「どれーんでびる」',
    'list': [{
      'qjp': '「もじゅるー」展開中に「どれーんでびる」の【使用済】効果によって「どれーんでびる」を使用した場合基本動作を行えますか？',
      'ajp': '「どれーんでびる」は行動カードであり使用をしているので「どれーんでびる」の解決後に基本動作を1回行えます。'
    },
    {
      'qjp': '「どれーんでびる」と「Alpha-Edge」が使用済みで、相手のターンに対応で「Turbo Switch」を使用した場合、処理順はどのようになりますか？',
      'ajp': 'まず「Turbo Switch」の使用によって騎動を行います。騎動により間合が変化した場合「Alpha-Edge」が即再起によって未使用に戻ります。切札が未使用に戻ったことにより「どれーんでびる」の【使用済】効果により、「どれーんでびる」を使用します。その後、対応した《攻撃》の解決が行われます。'
    }]
  },
  {
    'name': '「びっぐごーれむ」',
    'list': [{
      'ajp': '機巧全般へのFAQもご覧ください。',
      'a': '请参阅[机巧]特性相关的FAQ。'
    },
    {
      'qjp': '「びっぐごーれむ」で再構成を行った場合、ライフダメージを受けますか？',
      'ajp': 'いいえ、効果によって再構成を行う場合ライフダメージは受けません。'
    },
    {
      'qjp': '歯車枠の効果は条件が揃ったら解決しなければいけませんか？',
      'ajp': '相手のライフに1ダメージを与えてもよい、と書かれている通りこの能力を使うかどうかは任意です。ゆえにダメージを与えない選択をすることもできます。ダメージを与えない場合は、再構成も行われません。'
    },
    {
      'qjp': 'ライフにダメージを与えて再構成をするとありますが、この時設置は使用できますか？',
      'ajp': '使用できます。設置の使用を行い、山札の再構成を行います。'
    },
    {
      'qjp': '「びっぐごーれむ」の歯車枠は終了フェイズに私の《対応》であるカード1枚と《全力》であるカードが2枚表向きになっていればよいということでしょうか？',
      'ajp': 'はい、その通りです。「びっぐごれーむ」の歯車枠は終了フェイズに効果があるため、終了フェイズに機巧が満たしてあれば使用することができます。'
    },
    {
      'qjp': '「びっぐごーれむ」の歯車枠を解決するタイミングは【常時】【展開中】と同じでしょうか？',
      'ajp': 'はい、そうなります。「びっぐごーれむ」の解決タイミングは「終了フェイズに」と記載された【常時】【展開中】と同じです。'
    },
    {
      'qjp': '切札の再起と「びっぐごーれむ」の終了フェイズの効果は任意の順番で行えますか？',
      'ajp': 'はい、行えます。「終了フェイズに」と表記されている効果についてはターンプレイヤーが任意の順番で行うことができます。'
    },
    {
      'qjp': '私の手札が3枚以上ある状態で終了フェイズを迎えた場合、手札の枚数を調整してから「びっぐごーれむ」の効果を使用して山札を再構成することはできますか？',
      'ajp': 'いいえ、できません。「終了フェイズに」と記述されている効果はルールで与えられた効果より前に解決されます。'
    },
    {
      'qjp': '「びっぐごーれむ」が使用済である状態で、《全力》である《攻撃》カードが打ち消されました。基本動作は行えますか？',
      'ajp': 'はい、攻撃が打ち消された場合や失敗となった場合でも、基本動作は行えます。'
    }]
  },
  {
    'name': '「いんだすとりあ」',
    'list': [{
      'qjp': '追加札に「でゅーぷりぎあ」がなくても使用できますか？',
      'ajp': 'できます。'
    },
    {
      'qjp': '「いんだすとりあ」が再起したとき、封印されたカードは戻り山札の再構成に含まれますか？',
      'ajp': 'いいえ、戻りません。一度「いんだすとりあ」に封印されたカードは封印されたままになり元に戻ることはありません。'
    },
    {
      'qjp': '「いんだすとりあ」のカードを封印するタイミングはいつですか？　また、手札も捨て札もないときに「いんだすとりあ」を使用することはできますか？',
      'ajp': '「いんだすとりあ」を使用し、すでに封印されているカードがないときのみ封印できます。また、手札も捨て札もない場合でも「いんだすとりあ」を使用することができます。その場合、カードを封印せず「でゅーぷりぎあ」が山札の底に加わります。'
    },
    {
      'qjp': '「いんだすとりあ」で《攻撃》カードを封印し「いんだすとりあ」が使用済の状態で「でゅーぷりぎあ」が捨て札にある場合、「でゅーぷりぎあ」機巧の条件として《攻撃》を1枚満たすことになりますか？',
      'ajp': 'はい、条件を満たします。「でゅーぷりぎあ」は「いんだすとりあ」が使用済の状態であるなら「いんだすとりあ」に封印されたカードの複製となります。これはカードタイプも含まれ、機巧の条件にも数えられます。'
    },
    {
      'qjp': '「いんだすとりあ」で「かさまわし」を封印し、手札に「でゅーぷりぎあ」が2枚以上ある状態で傘の開閉を行いました。この時に2枚を公開するとオーラは2つ増えますか？',
      'ajp': 'はい、公開した枚数分ダストからあなたのオーラへ桜花結晶を動かします。'
    },
    {
      'qjp': '「引用」で相手の手札に「でゅーぷりぎあ」がある場合、どのような扱いになりますか？',
      'ajp': '相手の手札にある「でゅーぷりぎあ」は相手の「いんだすとりあ」に封印されたカードの複製となります。ですので「いんだすとりあ」に《攻撃》カードが封印されていない場合、「引用」で選ぶことはできません。相手の「いんだすとりあ」が未使用である場合は、カードタイプが不定であるため「引用」で選ぶことはできません。'
    }]
  },
  {
    'name': '「でゅーぷりぎあ」',
    'list': [{
      'qjp': 'カードの複製となるとはどういうことですか？',
      'ajp': '「いんだすとりあ」に封印されたカードが持つ、カードタイプ、サブタイプ、テキスト、適正距離、オーラ/ライフダメージ、納などの情報を持つことになります。要するに封印されたカードのコピーになります。ただし名前だけは「でゅーぷりぎあ」となります。'
    },
    {
      'qjp': '「いんだすとりあ」で相手から送られた毒を封印しました。「でゅーぷりぎあ」はどうなりますか？',
      'ajp': '複製するという効果は、そのカードの分類（通常札、切札、毒など）を複製しません。ゆえに「でゅーぷりぎあ」は毒でない通常札としてふるまいます。よって、基本動作のためのコストとして伏せ札にすることも可能です（もちろん、使用した時の効果は毒カードのものです）。また、毒でないカードは毒袋に存在できないため、毒袋に戻る効果も解決されません。'
    },
    {
      'qjp': '「でゅーぷりぎあ」が「いんだすとりあ」に封印されているカードの複製となっている場合、そのカードはどのメガミのカードとして扱われますか？',
      'ajp': '「いんだすとりあ」に封印されているカードと同じになります。「でゅーぷりぎあ」は名前と分類以外の情報は全て「いんだすとりあ」に封印されているカードと同じになります。'
    },
    {
      'qjp': '私が「いんだすとりあ」に「引用」を封印していて、相手が「いんだすとりあ」に「斬」を封印している状態です。「でゅーぷりぎあ」を使用したら相手の手札に「でゅーぷりぎあ」がありました。どのように処理されますか？',
      'ajp': '相手の手札にある「でゅーぷりぎあ」は「斬」の複製となっています。間合が3-4であれば使用することができます。相手の「でゅーぷりぎあ」を使用することで「引用」の複製となるといったことは起こりません。'
    }]
  },
  {
    'name': '「神渉装置：枢式」',
    'list': [{
      'ajp': '機巧全般へのFAQもご覧ください。',
      'a': '请参阅[机巧]特性相关的FAQ。'
    },
    {
      'ajp': 'カードを使用する効果へのFAQもご覧ください。'
    },
    {
      'qjp': '相手が「神渉装置：枢式」を使用し、私の《付与》の切札が使用されました。この状態で「大破鐘メガロベル」を使用したらライフ回復はできますか？',
      'ajp': 'できません。あなたの切札は相手の付与札にありますが、まだ使用済となっていない状態です。そのため他の切札が使用済であるという条件を満たせず効果が解決されません。'
    },
    {
      'qjp': '「神渉装置：枢式」は機巧を完成させずに使用することはできますか？',
      'ajp': '「神渉装置：枢式」は機巧が完成していない場合でも使用でき、相手の使用済の切札を1枚選び使用することができます。'
    },
    {
      'qjp': '「神渉装置：枢式」の歯車枠の効果は『相手の切札を見て』とありますが切札全てを見ることができるのでしょうか？',
      'ajp': 'はい、できます。「神渉装置：枢式」の歯車枠の効果は相手の切札全てを見た上で1枚使用済にするものを選ぶことができます。'
    },
    {
      'qjp': '「神渉装置：枢式」の歯車枠の効果を使用し相手の付与である切札を使用済にする場合、【破棄時】効果は発生しますか？ また、「神渉装置：枢式」で「森羅判証」や「闇昏千影の生きる道」を使用した場合、【破棄時】効果はどちらのプレイヤーに適用されますか？',
      'ajp': '使用済にしただけでは【破棄時】効果は得られません。【破棄時】効果は付与札から破棄される場合に解決されます。後者については「神渉装置：枢式」を使用したプレイヤーに適用されます。'
    },
    {
      'qjp': '「神渉装置：枢式」で相手の「氷雨細音の果ての果て」や「天音揺波の底力」といった使用に条件のある切札を使用することはできますか？',
      'ajp': '「神渉装置：枢式」で使用する切札についてはそのカードに使用条件がある場合はそれを満たす必要があります。あなたのライフが3以下ならば「天音揺波の底力」は使用できます。「氷雨細音の果ての果て」は使用できません。'
    },
    {
      'qjp': '相手の切札による《攻撃》に対応で「鳶影」を使用し「あくせらー」「りげいなー」「神渉装置：枢式」を使用しました。 機巧の条件を満たしている場合、相手の使用中の切札を使用済にできますか? そうした場合、その《攻撃》は解決されますか？',
      'ajp': '使用中の切札を使用済にすることはできません。切札を見る場合、未使用のものを見て選ぶことになります。付与札にあるものについても使用済にすることはできません。'
    },
    {
      'qjp': '「神渉装置：枢式」で相手の「完全論破」を使用した場合、カードはどこに封印されますか？',
      'ajp': '相手の「完全論破」に封印された状態になります。'
    },
    {
      'qjp': '「神渉装置：枢式」を使用して相手の「大破鐘メガロベル」を使用した場合、参照するのはどちらの切札でしょうか？また、処理はどのようになりますか？ 、',
      'ajp': '「神渉装置：枢式」を使用したプレイヤーの切札を参照します。この場合「神渉装置：枢式」が使用済でないため、「大破鐘メガロベル」を使用してもなにも発生しません。'
    },
    {
      'qjp': '「神渉装置：枢式」の歯車枠の効果を使用した際に相手もクルルを宿しており切札に「神渉装置：枢式」がある場合、相手の「神渉装置：枢式」を使用済にしてかつ使用することで相手の切札をもう一枚使用済みにすることはできますか？',
      'ajp': 'はい、できます。「神渉装置：枢式」によって相手の「神渉装置：枢式」を使用済にして使用することで、再度同じ効果を行うことができます。'
    }]
  },
  {
    'name': '「あならいず」',
    'list': [{
      'ajp': '機巧全般へのFAQもご覧ください。',
      'a': '请参阅[机巧]特性相关的FAQ。'
    },
    {
      'qjp': '相手の伏せ札が0枚である時に機巧を満たした「あならいず」を使用した場合、私の伏せ札を1枚捨て札にしなくてはなりませんか？',
      'ajp': 'はい。'
    }]
  },
  {
    'name': '「だうじんぐ」',
    'list': [{
      'ajp': '機巧全般へのFAQもご覧ください。',
      'a': '请参阅[机巧]特性相关的FAQ。'
    },
    {
      'ajp': 'カードを使用する効果へのFAQもご覧ください。'
    },
    {
      'qjp': '相手の捨て札から「圧気」などのサブタイプを持たないカードを選んだ場合、歯車枠の機巧はどうなりますか？',
      'ajp': '機巧Yは何も示していないものと扱われます。「圧気」であれば、歯車枠の機巧は{攻}{付}となります。'
    },
    {
      'qjp': '相手の捨て札から複製になっていない「でゅーぷりぎあ」を選んだ場合どうなりますか？',
      'ajp': '機巧X・Yともに何も示していないと扱われるため、歯車枠の機巧は{攻}となります。しかし、機巧が完成していたとしても、「でゅーぷりぎあ」は《不定》カードであるため使用することができません。'
    }]
  },
  {
    'name': '「らすとりさーち」',
    'list': [{
      'ajp': '終端へのFAQもご覧ください。',
      'a': '请参阅终端关键词相关的FAQ。'
    },
    {
      'ajp': '機巧全般へのFAQもご覧ください。',
      'a': '请参阅[机巧]特性相关的FAQ。'
    },
    {
      'qjp': '相手が使用した「らすとりさーち」の効果により伏せ札を1枚選ぶ前に、伏せ札を切り直してもよいでしょうか？',
      'ajp': '問題ありません。＜伏せ札＞領域には順序の情報は保存されていないため、ゲーム中任意のタイミングでそれらの配置を変更しても構いません。'
    },
    {
      'qjp': '世紀の大発見を行うに際し、選んだプレイヤーの＜追加札＞領域にある切札は得られますか？',
      'ajp': '得られません。＜ゲーム外＞領域にあるカードのみが得られます。'
    },
    {
      'qjp': '世紀の大発見を行うに際し、効果によってゲームから取り除かれたカード（「灰滅」など）は得られますか？',
      'ajp': '得られません。世紀の大発見は＜ゲーム外＞に裏向きで置かれたカードだけに影響し、それらのカードは表向きになっています。'
    },
    {
      'qjp': '世紀の大発見を行うに際し、選んだプレイヤーがオリジン版メガミを宿していた場合、アナザー版メガミのカードは得られますか？',
      'ajp': '得られません。それらのカードは眼前構築の準備時点で用意されておらず、眼前構築に際し＜ゲーム外＞に置かれません。'
    },
    {
      'qjp': '「神渉装置：枢式」により相手の「らすとりさーち」を使用し、世紀の大発見を行うことはできますか？',
      'ajp': 'できます。その場合、相手の「らすとりさーち」を取り除き、あなたの＜追加札＞領域から「ぐらんがりばー」を未使用で得ることになります（「ぐらんがりばー」があなたの＜追加札＞領域に存在しなければ得られません）。'
    },
    {
      'qjp': '世紀の大発見を既に行っているプレイヤーが、再度世紀の大発見を行う場合どうなりますか？',
      'ajp': '1回目と同様に解決します。以前選んだプレイヤーを再度選ぶこともできますが、その場合新たに切札を得ることはできません。'
    },
    {
      'qjp': 'ユキヒを宿していないプレイヤーが世紀の大発見を行って得た「ゆらりび」を使用することはできますか？',
      'ajp': 'その「ゆらりび」は適正距離を持たないものとして扱われるため、使用できません。'
    },
    {
      'qjp': '私がクルルとホノカを宿し、相手がホノカを宿しています。相手の「胸に想いを」を世紀の大発見を行って得た後使用した場合、それは私の＜追加札＞にある「両手に華を」と交換されますか？',
      'ajp': '交換されます。その「胸に想いを」と交換先の「両手に華を」の保有者が一致し、カード名が効果に記載されているものと一致し、交換先の「両手に華を」はあなたの＜追加札＞領域にあるので、交換を適正に行えます。'
    }]
  },
  {
    'name': '「ぐらんがりばー」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「ぶらすたー」',
    'list': [{
      'ajp': '機巧全般へのFAQもご覧ください。',
      'a': '请参阅[机巧]特性相关的FAQ。'
    }]
  },
  {
    'name': '「れーるがん」',
    'list': [{
      'ajp': '機巧全般へのFAQもご覧ください。',
      'a': '请参阅[机巧]特性相关的FAQ。'
    },
    {
      'qjp': '「この攻撃が行われた時」とはいつですか？',
      'ajp': '《攻撃》の解決が開始された時です。より細かくは追加コストの支払い・潜水の解決後で、対応の前です。'
    }]
  },
  {
    'name': '「こねくとだいぶ」',
    'list': [{
      'ajp': '機巧全般へのFAQもご覧ください。',
      'a': '请参阅[机巧]特性相关的FAQ。'
    },
    {
      'qjp': '機巧枠とはなんですか？',
      'ajp': '歯車枠の表記揺れです。大変申し訳ございません。'
    },
    {
      'qjp': 'このカードの歯車枠に対してこのカードの効果を適用できますか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    },
    {
      'qjp': '一度の歯車枠の解決に際して複数回このカードの効果を適用できますか？',
      'ajp': 'いいえ、できません。各【常時】効果は条件を満たした時に一回のみ解決されます。'
    }]
  }]
},
{
  name: 'THALLYA 萨莉娅',
  list: [{
    name: '造花结晶・骑动特性相关的FAQ',
    namejp: '造花結晶・騎動全般へのFAQ',
    list: [{
      'ajp': '燃焼は追加コストです。追加コストへのFAQもご覧ください。'
    },
    {
      'qjp': '「間合+1トークン」となっている造花結晶を基本動作《前進》でオーラに動かすことはできますか？',
      'ajp': 'できません。間合に置かれている「間合+1トークン」は桜花結晶ではないので選べず、結果として動かせません。'
    },
    {
      'qjp': '「間合-1トークン」が置かれている桜花結晶を基本動作《前進》でオーラに動かすことはできますか？',
      'ajp': 'できません。「間合-1トークン」が置かれている桜花結晶は選べませんので、動かせません。'
    },
    {
      'qjp': '開始フェイズに「間合-1トークン」が2つ燃焼済になりました。その後、間合を変化させずに遠心を持つカードを使用できますか？',
      'ajp': 'できます。ターン開始時の間合は開始フェイズの処理を行う前に決定されます。その後開始フェイズに「間合-1トークン」が2つ消えたことにより間合が2離れている状態となるので遠心の条件を満たします。'
    },
    {
      'qjp': '燃焼済の造花結晶を回復するときに「間合＋1トークン」となっている造花結晶をマシンに戻すことはできますか？',
      'ajp': 'できません。「間合＋1トークン」は燃焼済の造花結晶ではありません。'
    },
    {
      'qjp': '騎動前進で間合を2（達人の間合）以下にすることはできますか？',
      'ajp': 'はい、できます。騎動前進は基本動作の前進とは異なります。ただし間合に桜花結晶がない場合には騎動前進を選ぶことができません。'
    },
    {
      'qjp': '開始フェイズに間合に置かれた造花結晶を燃焼済にするとありますが、集中力の獲得までの流れはどのようになりますか？',
      'ajp': '最初にターン開始時の間合が決定されます（遠心などに影響します）。その後、騎動によって間合に置かれた造花結晶を燃焼済にしてから集中力の獲得を行い、以降の開始フェイズの処理を行います。'
    },
    {
      'qjp': '騎動により使用する造花結晶は燃焼済領域の物も選択できますか？',
      'ajp': 'いいえ、できません。騎動により使用する造花結晶はマシンにあるもののみ選択でき、燃焼済にある造花結晶は選択できません。'
    },
    {
      'qjp': '遠心の効果や他の間合変化を参照するカードは騎動で間合が変化した場合でも間合の変化として数えますか？',
      'ajp': '騎動による間合の変化も通常の間合変化と同じように扱います。例えばターン開始時の間合から後退1回と「Turbo Switch」で騎動後退を行えば遠心の条件を満たします。'
    },
    {
      'qjp': '騎動はターン開始時に間合から間合±1トークンを取り除くことを含みますか？また、それにより間合が変化した場合、「Alpha-Edge」は再起しますか？',
      'ajp': 'いいえ、開始フェイズに間合にある造花結晶を燃焼済にする処理は騎動とはみなされません。そのため「Alpha-Edge」も再起しません。'
    },
    {
      'qjp': '騎動はマシンに造花結晶がある場合、必ず行わなくてはならないのでしょうか？',
      'ajp': 'はい。サリヤの「Burning Steam」「Waving Edge」等には『騎動を行う』とあるため、造花結晶がある場合必ず行う必要があります。'
    }]
  },
  {
    'name': '「Burning Steam」',
    'list': [{
      'ajp': '造花結晶・騎動全般へのFAQもご覧ください。',
      'a': '请参阅[造花结晶·骑动]特性相关的FAQ。'
    }]
  },
  {
    'name': '「Waving Edge」',
    'list': [{
      'ajp': '造花結晶・騎動全般へのFAQもご覧ください。',
      'a': '请参阅[造花结晶·骑动]特性相关的FAQ。'
    },
    {
      'qjp': 'マシンに造花結晶が1つしかない状態で「Waving Edge」を使用したら騎動は行いますか？',
      'ajp': '行いません。まず燃焼によるコストの支払いのためマシンにある造花結晶が燃焼済になります。その後騎動を行う時にマシンには造花結晶がないため何も行いません。'
    }]
  },
  {
    'name': '「Shield Charge」',
    'list': [{
      'ajp': '造花結晶・騎動全般へのFAQもご覧ください。',
      'a': '请参阅[造花结晶·骑动]特性相关的FAQ。'
    },
    {
      'qjp': '「衝音晶」や「浦波嵐」などでオーラダメージを減らしてダメージを受けた場合、間合に動かす桜花結晶はどうなりますか？',
      'ajp': '実際にダメージを受けた分だけ動かします。例えば「衝音晶」で-1/+0となるとダメージは2/2なので、オーラへのダメージを選択したら、2つの桜花結晶が間合へと動くことになります。逆にダメージが増えている場合も同様です。'
    },
    {
      'qjp': '間合に造花結晶が大量に間合-1トークンとして置かれていて、間合の空きがない状態で「Shield Charge」を使用された場合、間合に移動できない分のダメージや桜花結晶の移動はどのようになりますか？',
      'ajp': '移動できなかった分の桜花結晶については元の領域に留まります。例えば間合に空きが1つしかないときに「Shield Charge」のダメージをオーラで受けた場合、オーラから1つだけ間合に移動し残りはオーラに留まります。'
    }]
  },
  {
    'name': '「Steam Cannon」',
    'list': [{
      'ajp': '造花結晶・騎動全般へのFAQもご覧ください。',
      'a': '请参阅[造花结晶·骑动]特性相关的FAQ。'
    }]
  },
  {
    'name': '「Stunt」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「Roaring」',
    'list': [{
      'ajp': '造花結晶・騎動全般へのFAQもご覧ください。',
      'a': '请参阅[造花结晶·骑动]特性相关的FAQ。'
    },
    {
      'qjp': '「Roaring」を使用した時、マシンに造花結晶が2つ以上あるなら必ず2つ燃焼済にしなければなりませんか？ また同様に集中力が2以上あるなら支払わなければなりませんか？',
      'ajp': 'いいえ。コストの支払いについては任意です。コストを払わなかった場合は、「そうした場合～」で記述されている部分の効果は解決されません。'
    },
    {
      'qjp': '「Roaring」はどの順番で効果を解決しますか？',
      'ajp': '上から順に解決します。上の効果によって集中力が2になった場合、下のコストを支払うことができます。'
    },
    {
      'qjp': '相手の集中力が0の場合、上の効果は解決されますか？',
      'ajp': 'されます。結果としてあなたは集中力を1得て、相手の集中力は変化せず、相手を畏縮させます。'
    }]
  },
  {
    'name': '「Turbo Switch」',
    'list': [{
      'ajp': '造花結晶・騎動全般へのFAQもご覧ください。',
      'a': '请参阅[造花结晶·骑动]特性相关的FAQ。'
    }]
  },
  {
    'name': '「Alpha-Edge」',
    'list': [{
      'ajp': '造花結晶・騎動全般へのFAQもご覧ください。',
      'a': '请参阅[造花结晶·骑动]特性相关的FAQ。'
    }]
  },
  {
    'name': '「Omega-Burst」',
    'list': [{
      'ajp': '造花結晶・騎動全般へのFAQもご覧ください。',
      'a': '请参阅[造花结晶·骑动]特性相关的FAQ。'
    }]
  },
  {
    'name': '「Thallya\'s Masterpiece」',
    'list': [{
      'ajp': '造花結晶・騎動全般へのFAQもご覧ください。',
      'a': '请参阅[造花结晶·骑动]特性相关的FAQ。'
    },
    {
      'qjp': '造花結晶がないときに騎動を行った場合、どうなりますか？',
      'ajp': '騎動による間合の変化が起こらないため、効果は得られません。'
    }]
  },
  {
    'name': '「Julia\'s BlackBox」',
    'list': [{
      'ajp': '造花結晶・騎動全般へのFAQもご覧ください。',
      'a': '请参阅[造花结晶·骑动]特性相关的FAQ。'
    },
    {
      'qjp': 'マシンに造花結晶がなければ、全て燃焼済でなくてもTransFormしますか？',
      'ajp': 'TransFormします。「間合＋1トークン」などとして間合に造花結晶が残っていてもマシンに造花結晶がなければTransFormします。'
    },
    {
      'qjp': 'すでにTransFormカードが有効になっている状態で再度「Julia’s BlackBox」を使用したらどうなりますか？',
      'ajp': '別のTransFormカードをマシンに追加します。結果として、2枚のTransFormカードが有効になります。「Julia’s BlackBox」を3回使用できれば全てのTransFormカードが追加されることになります。'
    },
    {
      'qjp': 'サリヤを宿していないプレイヤーが「神渉装置：枢式」で「Julia’s BlackBox」を使用したらどうなりますか？',
      'ajp': 'まず、マシンに造花結晶がないためTransFormしますが、追加札にTransFormカードがないため何も起こりません。そして使用済になります。'
    }]
  },
  {
    'name': '「Form:YAKSHA」',
    'list': [{
      'ajp': '造花結晶・騎動全般へのFAQもご覧ください。',
      'a': '请参阅[造花结晶·骑动]特性相关的FAQ。'
    },
    {
      'qjp': '「Beta-Edge」を使用したときに間合にある桜花結晶全てに造花結晶が乗っている場合、攻撃後に騎動前進を選択することはできますか？',
      'ajp': 'いいえ、できません。騎動を行う際に造花結晶が乗っていない桜花結晶がない場合、騎動前進を選ぶことはできません。'
    },
    {
      'qjp': '変形時効果を受けた相手が、次の開始フェイズ中にカードの効果でカードを引く場合（「反論」他）、どうなりますか？',
      'ajp': '『開始フェイズ中にカードを1枚しか引けない』ため、開始フェイズ規定処理の前に1枚以上カードを引いている場合、そのフェイズ中はそれ以降カードを引けなくなります。'
    }]
  },
  {
    'name': '「Form:NAGA」',
    'list': [{
      'qjp': '相手の山札がないときに「Gamma-Ray」を使用したらどうなりますか？',
      'ajp': '何も起こりません。'
    }]
  },
  {
    'name': '「Form:GARUDA」',
    'list': [{
      'qjp': '「Delta-Wing」は間合8以上で選択できますか？',
      'ajp': 'はい、できます。追加基本動作については桜花結晶が移動しない場合でも選択が可能です。'
    }]
  },
  {
    'name': '「Quick Change」',
    'list': [{
      'ajp': '造花結晶・騎動全般へのFAQもご覧ください。',
      'a': '请参阅[造花结晶·骑动]特性相关的FAQ。'
    },
    {
      'qjp': '使用したことによりTransFormしたことになりますか？',
      'ajp': 'いいえ、TransFormはしていません。'
    },
    {
      'qjp': '展開時、TransFormカードの変形時効果は有効になりますか？',
      'ajp': 'いいえ、有効になるのは追加基本動作と常時効果のみです。'
    },
    {
      'qjp': '「詭弁」などで相手の「Quick Change」を使用した場合どうなりますか？',
      'ajp': 'あなたの追加札にTransFormカードがあるなら、それを1枚選んで封印し、その追加基本動作と常時を有効にすることができます。'
    }]
  },
  {
    'name': '「BlackBox NEO」',
    'list': [{
      'ajp': '終端へのFAQもご覧ください。',
      'a': '请参阅终端关键词相关的FAQ。'
    },
    {
      'qjp': '燃焼済の造花結晶がなくても、このカードを使用してこのカードの上に桜花結晶を置くことはできますか？',
      'ajp': 'はい、できます。'
    }]
  },
  {
    'name': '「OMNIS-Blaster」',
    'list': [{
      'qjp': '『TransFormした回数』を数えるに際し、TransFormしたときに追加札からマシンにTransFormカードを動かせなかった場合を含めますか？',
      'ajp': '含めます。'
    }]
  },
  {
    'name': '「Form:KINNARI」',
    'list': [{
      'qjp': '相手がカードの効果によって再構成を行った場合にも「Zeta-Voice」による《攻撃》は発生しますか？',
      'ajp': 'はい、発生します。'
    },
    {
      'qjp': '「Zeta-Voice」による《攻撃》は設置によるカードの使用とどちらが先ですか？',
      'ajp': '設置によるカードの使用が先です。'
    },
    {
      'qjp': '「Zeta-Voice」による《攻撃》は「いんだすとりあ」や「らすとりさーち」の即再起とどちらが先ですか？',
      'ajp': 'ターンプレイヤーの任意の順で行われます。'
    }]
  },
  {
    'name': '「Form:ASURA」',
    'list': [{
      'qjp': '「Quick Change」によって追加基本動作が有効になっている際に、一度「Sigma-Drive」を行った後「Quick Change」を破棄し再度展開した場合、「Sigma-Drive」をもう一度行うことはできますか？',
      'ajp': 'いいえ、できません。いかなる方法によっても「Sigma-Drive」を1ターン中に2回以上行うことはできません。'
    }]
  },
  {
    'name': '「Form:DEVA」',
    'list': [{
      'ajp': '造花結晶・騎動全般へのFAQもご覧ください。',
      'a': '请参阅[造花结晶·骑动]特性相关的FAQ。'
    },
    {
      'qjp': '相手が手札からカードを使用した場合、相手のカードの解決より先に「Phi-Cycle」により集中力を得られますか？',
      'ajp': 'いいえ。カードの使用に際し、まずそのカードは使用中領域に移動し、解決後に捨て札領域に移動します。'
    },
    {
      'qjp': '相手の捨て札が減ることで相手の捨て札の枚数が0でない2の倍数になったときに「Phi-Cycle」で集中を得られますか？',
      'ajp': 'はい、得られます。'
    },
    {
      'qjp': '相手が捨て札からカードを使用した場合どうなりますか？',
      'ajp': 'まず、使用することによってそのカードが使用中領域に移動します。この時点で捨て札の枚数を確認します。'
    },
    {
      'qjp': '相手の捨て札が1枚である時に「壮語」により2枚のカードが捨て札になった場合、「Phi-Cycle」により集中力を得られますか？',
      'ajp': 'いいえ、得られません。相手の捨て札にあるカードの枚数が0でない2の倍数である瞬間は存在しません。'
    },
    {
      'qjp': '相手の捨て札が1枚である時に「Form:ASURA」の変形時効果により2枚のカードが捨て札になった場合、「Phi-Cycle」により集中力を得られますか？',
      'ajp': 'はい。「Form:ASURA」の変形時効果はカードを1枚ずつ捨て札にするため、0でない2の倍数の枚数になったときに「Phi-Cycle」により集中力を得られます。'
    },
    {
      'qjp': '相手の捨て札が1枚である時に相手が設置でカードを使用しました。「Phi-Cycle」で集中は得られますか？',
      'ajp': 'はい、設置で使用したカードは再構成の直前に捨て札になるため、その時捨て札の枚数が0でない2の倍数になったなら「Phi-Cycle」により集中が得られます。'
    },
    {
      'q': '对方1弃牌，打出「预演/猫骗」然后这卡回手，可以拿1集中吗？',
      'a': '不进弃牌直接回收，所以不触发，牌是从"使用中"回"手牌"。'
    },
    {
      'q': '对方「忍步」「钢丝」，可以拿1集中吗？',
      'a': '无论如何都会触发。'
    }]
  }]
},
{
  name: 'RAIRA 雷螺',
  list: [{
    name: '风雷特性相关的FAQ',
    namejp: '風雷全般へのFAQ',
    list: [{
      'q': '涨槽如何判定？',
      'a': '按卡牌使用次数增加槽。'
    },
    {
      'qjp': '使用してから帯電しているカードが「論破」によって封印され、その後戻ってきました。これを帯電解除できますか？',
      'ajp': 'いいえ、できません。「論破」により捨て札から移動した時点で、そのカードは帯電状態ではなくなっています。'
    },
    {
      'qjp': 'ライラを宿していない相手が「引用」や「詭弁」、「神渉装置：枢式」などで私のカードを使用し、その後捨て札や切り札に戻ってきました。このカードを帯電解除できますか？',
      'ajp': 'いいえ、できません。カードが帯電する条件は『ライラを宿すプレイヤーがライラ以外のメガミのカードを使用した時』であるため、それらのカードは帯電しません。'
    },
    {
      'qjp': 'また、ライラを宿している相手が「引用」などで私のカードを使用し、帯電解除せずにこちらに戻ってきました。このカードは帯電解除できますか？',
      'ajp': 'いいえ、できません。総合ルールにより、あなたの捨て札へと移動した時点で、それらのカードの帯電状態は失われています。'
    },
    {
      'qjp': '隙を持つ付与が帯電状態で展開されているとき、相手のターンでライフダメージを受けました。この場合この付与の帯電を解除してゲージを上げる事はできずに伏せ札になるという認識でよろしいですか？',
      'ajp': 'はい、合っています。ダメージの解決から隙の失敗の間に帯電を解除するタイミングはありません。'
    },
    {
      'qjp': '帯電条件には「カードを使用した時」とありましたが、無窮の風などで捨て札になったカードは帯電されますか？また、すでに帯電解除したカードを論破によって封印され、その後戻ってきた場合には帯電状態はどうなっていますか？',
      'ajp': 'それらは帯電していません。'
    },
    {
      'qjp': '「どれーんでびる」を自身の【使用済】効果により再使用した時、これは帯電状態になりますか？',
      'ajp': 'はい、帯電します。'
    },
    {
      'qjp': 'カードの効果による再構成の直前に、捨て札のカードの帯電を解除できますか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    },
    {
      'qjp': '毒や兵員を使用した場合帯電しますか？',
      'ajp': 'いいえ、帯電しません。毒や兵員は使用者の情報を持ちません。',
      'q': '毒或者兵员卡牌涨槽吗？',
      'a': '不。'
    },
    {
      'qjp': '嵐の力による《攻撃》はライラの《攻撃》ですか？',
      'ajp': 'はい。'
    },
    {
      'qjp': '相手が「スモーク」を展開中です。嵐の力の風1の効果で間合→ダスト:1を行うことはできますか？',
      'ajp': 'いいえ、間合の桜花結晶は動きません。(風1を選択することはできます。)'
    },
    {
      'qjp': '私がオリジン版ライラを、相手がアナザー版ライラを宿しています。私が「暴風」などの相手のカードを使用したとき、嵐の力を使用することはできますか？',
      'ajp': 'はい、できます。'
    }]
  },
  {
    'name': '「獣爪」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「風雷撃」',
    'list': [{
      'ajp': '風雷全般へのFAQもご覧ください。',
      'a': '请参阅[风雷]特性相关的FAQ。'
    },
    {
      'qjp': 'ライラを宿していないプレイヤーが「引用」で「風雷撃」を使用しました。ダメージはどうなりますか？',
      'ajp': '「引用」を使用したプレイヤーに風雷ボードがないので、X=0として扱われダメージは0/2になります。'
    },
    {
      'qjp': '「天地反駁」を展開中に、風神ゲージ、雷神ゲージがともに6で「風雷撃」を使用したらダメージはどうなりますか？',
      'ajp': 'ダメージは2/6になります。ダメージの入れ替えが行われた後にオーラダメージが上限になります。'
    }]
  },
  {
    'name': '「流転爪」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「風走り」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「風雷の知恵」',
    'list': [{
      'ajp': '風雷全般へのFAQもご覧ください。',
      'a': '请参阅[风雷]特性相关的FAQ。'
    }]
  },
  {
    'name': '「呼び声」',
    'list': [{
      'ajp': '風雷全般へのFAQもご覧ください。',
      'a': '请参阅[风雷]特性相关的FAQ。'
    }]
  },
  {
    'name': '「空駆け」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「雷螺風神爪」',
    'list': [{
      'ajp': '風雷全般へのFAQもご覧ください。',
      'a': '请参阅[风雷]特性相关的FAQ。'
    }]
  },
  {
    'name': '「天雷召喚陣」',
    'list': [{
      'ajp': '風雷全般へのFAQもご覧ください。',
      'a': '请参阅[风雷]特性相关的FAQ。'
    }]
  },
  {
    'name': '「風魔招来孔」',
    'list': [{
      'ajp': '風雷全般へのFAQもご覧ください。',
      'a': '请参阅[风雷]特性相关的FAQ。'
    }]
  },
  {
    'name': '「風魔旋風」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「風魔纏廻」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「風魔天狗道」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「円環輪廻旋」',
    'list': [{
      'ajp': '風雷全般へのFAQもご覧ください。',
      'a': '请参阅[风雷]特性相关的FAQ。'
    },
    {
      'qjp': '展開中に相手が八相を満たして「八方振り」を使用した場合、どうなりますか？',
      'ajp': '「八方振り」の【攻撃後】効果による《攻撃》の解決後に【展開中】効果を処理します。その後、「八方振り」自体の解決が終了するため、もう一度【展開中】効果が処理されます。'
    },
    {
      'qjp': '片方の効果のみ解決することはできますか？',
      'ajp': 'いいえ、できません。間合↔︎ダスト:1とゲージを上げる効果の両方を行うか、両方行わないかのどちらかです。'
    },
    {
      'qjp': '相手の「スモーク」が展開中であるとき、間合→ダスト:1と風雷ゲージの上昇を行えますか？',
      'ajp': '風雷ゲージは上昇させられますが、間合の桜花結晶は「スモーク」により動きません。'
    }]
  },
  {
    'name': '「暴風」',
    'list': [{
      'ajp': '風雷全般へのFAQもご覧ください。',
      'a': '请参阅[风雷]特性相关的FAQ。'
    }]
  },
  {
    'name': '「大嵐」',
    'list': [{
      'ajp': '風雷全般へのFAQもご覧ください。',
      'a': '请参阅[风雷]特性相关的FAQ。'
    },
    {
      'qjp': 'ダストがない場合にも、『このカードの上にダストから桜花結晶を1つ置く』を選べますか？',
      'ajp': 'はい、選べます。その場合特に何も起きません。'
    }]
  },
  {
    'name': '「陣風祭天儀」',
    'list': [{
      'ajp': '風雷全般へのFAQもご覧ください。',
      'a': '请参阅[风雷]特性相关的FAQ。'
    },
    {
      'qjp': '1つ目の【使用済】効果により「大嵐」などの効果による風雷ゲージの上昇も起きなくなりますか？',
      'ajp': 'いいえ、あなたが使用した他のメガミのカードが帯電状態にならなくなるだけであり、効果による風雷ゲージの上昇は通常通り行われます。'
    }]
  }]
},
{
  name: 'UTSURO 虚路',
  list: [{
    'name': '「円月」',
    'list': [{
      'qjp': '対応によりダストが11以下から12以上になったらダメージは2/2から-/2に変化しますか？',
      'ajp': '変化します。ダストにある桜花結晶の数に応じてダメージは適宜変更されます。'
    },
    {
      'qjp': '相手が「叛旗の纏毒」を展開中です。ダストが11以下の時に「円月」を使用し、対応によりダスト12以上になりました。この攻撃は打ち消されますか？',
      'ajp': 'はい、打ち消されます。ダストが12以上ある場合、「円月」のダメージは-/2となるため「叛旗の纏毒」によって打ち消されます。'
    },
    {
      'qjp': 'ダストが11以下の時に連火を達成した「バックドラフト」を使用後に「円月」を使用しました。相手が《対応》で「浦波嵐」を使用し、ダストが12以上になりました。ダメージはどうなりますか？',
      'ajp': 'オーラへのダメージが-になったため、「バックドラフト」のダメージ修正は消え、-/2になります。'
    }]
  },
  {
    'name': '「黒き波動」',
    'list': [{
      'qjp': '相手がオーラへのダメージを選んだ際に手札を見てカードを選ばないことはできますか？',
      'ajp': 'いいえ。相手に手札がある場合、選んで捨て札にする必要があります。'
    },
    {
      'qjp': '手札がないときにオーラへのダメージを選ぶことはできますか？',
      'ajp': 'できます。'
    },
    {
      'qjp': '毒を捨て札にすることはできますか？',
      'ajp': 'できます。'
    },
    {
      'qjp': '対応によりオーラへのダメージが0になった場合も【攻撃後】効果は発生しますか？',
      'ajp': '発生します。オーラへのダメージを選んでいるため【攻撃後】効果が解決されます。'
    }]
  },
  {
    'name': '「刈取り」',
    'list': [{
      'qjp': '相手のオーラなどから桜花結晶をダストに送るのはどちらが選びますか？',
      'ajp': '攻撃を受けた側が選びます。'
    },
    {
      'qjp': 'オーラが0の状態でオーラから移動することを選ぶことはできますか？',
      'ajp': 'できません。フレアやライフから桜花結晶を2つ選んでダストに送る必要があります。'
    },
    {
      'qjp': '1つ目の【攻撃後】効果で「無音壁」の上の結晶を選ぶことはできますか？',
      'ajp': 'できません。「無音壁」はダメージを受けるときにのみオーラにあるものとして扱います。'
    },
    {
      'qjp': '2つ目の【攻撃後】効果で付与札を選ぶのはどちらですか？',
      'ajp': '《攻撃》を行った側です。'
    },
    {
      'qjp': '桜花結晶が1つしか置かれていない付与札を選ぶことはできますか？',
      'ajp': 'できます。その場合、その1つをダストに移動させることになります。'
    },
    {
      'qjp': '2つ目の【攻撃後】効果で「陽の音」を選べますか？ また選んだ場合どうなりますか？',
      'ajp': '「陽の音」を選ぶことは可能ですが、相手のターン中でないなら、【展開中】効果によって「陽の音」の上の桜花結晶は移動しません。'
    }]
  },
  {
    'name': '「重圧」',
    'list': [{
      'qjp': 'オーラが0の状態でオーラから移動することを選ぶことはできますか？',
      'ajp': 'できません。フレアやライフから桜花結晶を1つ選んでダストに送る必要があります。'
    },
    {
      'qjp': '「無音壁」の上の結晶を選ぶことはできますか？',
      'ajp': 'できません。「無音壁」はダメージを受けるときにのみオーラにあるものとして扱います。'
    },
    {
      'qjp': 'ダストが11の時に「重圧」を使用した場合、相手は畏縮しますか？',
      'ajp': 'はい。カードの効果は上から順に解決されるので、上の効果でダストが12になるため灰塵の条件を満たします。'
    }]
  },
  {
    'name': '「影の翅」',
    'list': [{
      'qjp': '現在の間合が9の時に使用したらどうなりますか？',
      'ajp': '現在の間合は11になります。'
    }]
  },
  {
    'name': '「影の壁」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「遺灰呪」',
    'list': [{
      'qjp': '複数の付与が展開されている際、桜花結晶をダストに移す順番によって【破棄時】効果を解決されないようにすることはできますか？',
      'ajp': 'できません。付与札から桜花結晶をダストに移すのは全て同時に行われます。'
    }]
  },
  {
    'name': '「灰滅」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「虚偽」',
    'list': [{
      'qjp': '「虚偽」を展開中に相手の「論破」が破棄された場合、封印されたカードはどうなりますか？',
      'ajp': '封印されたままになります。その旨が分かるように置いておいてください。'
    },
    {
      'qjp': '先ほどの質問と同じ手順で封印されたままのカードがあります。その後に「虚偽」がない状態で、再度「論破」を使用し、そして「論破」が破棄された場合はどうなりますか？',
      'ajp': '封印されたままのカードと今回封印されたカードの両方が捨て札に戻ります。'
    },
    {
      'qjp': '「圧気」の【破棄時】効果に対応して「虚偽」を使用した場合、【破棄時】効果による攻撃を無効にできますか？',
      'ajp': 'できません。すでに「圧気」による【破棄時】効果による《攻撃》の解決中のため、その対応で「虚偽」を使用したとしても《攻撃》は消滅しません。'
    },
    {
      'qjp': '「虚偽」によって、すでに置かれている付与札から桜花結晶を1つ落としますか？',
      'ajp': 'いいえ。すでに付与札として置かれているカードには影響を与えません。'
    },
    {
      'qjp': '私が「どろりうら」を展開していて、相手が「虚偽」を展開しています。この時ユキヒのカードの適正距離はどうなりますか？',
      'ajp': '開閉の適正距離を合わせた後に距離縮小（近1）が適用されます。例えば、「ふりまわし/つきさし」の適正距離は「1-2,4-6」となります。'
    }]
  },
  {
    'name': '「終末」',
    'list': [{
      'qjp': '『あなたに1以上のダメージを与えた《攻撃》の解決後』とはどういったタイミングですか？',
      'ajp': '《攻撃》の【攻撃後】効果までを解決し終えた後になります。'
    },
    {
      'qjp': '「終末」が破棄されるときに同時に他の付与札が破棄される場合どうなりますか？',
      'ajp': 'そのターンプレイヤーが【破棄時】効果を解決する順番を選びます。先に「終末」の【破棄時】効果を解決した場合、残りの付与は【破棄時】効果を解決せずに捨て札（もしくは使用済の切札）におかれます。'
    },
    {
      'qjp': '「終末」の展開中に「熊介」を受けた場合どうなりますか？',
      'ajp': 'まず「熊介」によるダメージを受けることにより「終末」の【展開中】効果が誘発します。次に「熊介」の【攻撃後】効果により追加攻撃が行われます。そして1回目の追加攻撃のダメージにより「終末」の【展開中】効果が再び誘発し、その追加攻撃の解決後に「終末」が破棄され【破棄時】効果によりフェイズが終了します(結果として、追加攻撃の2回目以降は行われません)。'
    },
    {
      'qjp': '相手が「終末」展開中のとき、開始フェイズに設置により《攻撃》を行った場合、どのような処理になりますか？',
      'ajp': 'フェイズ終了により処理が飛ばされるため再構成は行われません。具体的には設置で使用したカードは捨て札になり、再構成によるライフの支払いなどは発生しません。'
    },
    {
      'qjp': '「森羅判証」と「終末」を展開していて、「終末」が破棄されました。ダメージは入りますか？',
      'q': '假如「森罗判证」展开中 「终末」和另一张付与牌破弃，那么先破弃「终末」另一张付与牌不会造成命伤？',
      'ajp': '入りません。付与札が破棄されたとは【破棄時】効果を全て解決した後になります。「終末」の【破棄時】効果によりフェイズが終了した場合、「森羅判証」によるダメージの処理が飛ばされるためダメージは入りません。',
      'a': '不触发，这张牌因结束当前阶段的效果直接离开付与区'
    },
    {
      'q': '洗牌「钢丝」触发终末，洗牌会被终止吗？',
      'a': '会。不掉血不洗牌直接进入主要阶段。'
    }]
  },
  {
    'name': '「魔食」',
    'list': [{
      'qjp': '処理を行うタイミングは、間合にある造花結晶を燃焼済に移動させるのと同じと考えてよろしいでしょうか？',
      'ajp': '同じです。集中力を得るよりも前に効果が解決されます。'
    }]
  },
  {
    'name': '「蝕みの塵」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「残響装置：枢式」',
    'list': [{
      'qjp': '「刈取り」や「四葉鏡のわらべ唄」の効果で「残響装置：枢式」を選択しました。どうなりますか？',
      'ajp': 'まず、自身のライフが6以下かつダスト13個以上の条件が満たされていないなら、「残響装置：枢式」の【展開時】効果によって桜花結晶は移動しないため、何も起きません。　条件が満たされているなら、桜花結晶が移動し、その結果「残響装置：枢式」に載っている桜花結晶がなくなれば破棄されますが、それが起きたフェイズが開始フェイズでないのなら、何も起きません。'
    },
    {
      'qjp': '毒が手札や山札などにある状況で、終焉の影が蘇るとどうなりますか？',
      'ajp': 'あなたが所有する毒もゲームから取り除かれます。相手の＜毒袋＞には戻りません。'
    },
    {
      'qjp': '「詭弁」によって相手のカードが私の付与札にある状況で、終焉の影が蘇るとどうなりますか？',
      'ajp': 'あなたの付与札にある相手のカードもゲームから取り除かれます。'
    },
    {
      'qjp': 'ライラを宿しているなら、終焉の影が蘇る際に切札に加わる「望我」は帯電しますか？',
      'ajp': '使用していないので帯電しません。'
    }]
  },
  {
    'name': '「望我」',
    'list': [{
      'qjp': 'ダメージは受けないとありますが、開始フェイズに再構成は行えますか？',
      'ajp': '行えます。'
    },
    {
      'qjp': '「望我」が使用済の状態で、相手が「蝕みの塵」を使用しました。どのように解決しますか？',
      'ajp': '『ダメージを受けない』とある場合、ダメージの選択を含めたダメージの処理が行われません。したがって「蝕みの塵」は何もしません。'
    },
    {
      'qjp': '相手の「望我」が使用済であるとき、「びっぐごーれむ」の1つ目の【使用済】効果により自身の山札を再構成することはできますか？',
      'ajp': 'いいえ、できません。『ダメージを受けない』により相手のライフに1ダメージを与えることに失敗しているため、『そうした場合』を満たしていません。'
    }]
  },
  {
    'name': '「万象乖ク殲滅ノ影」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「我ヲ亡クシテ静寂ヲ往ク」',
    'list': [{
      'qjp': 'TransFormカードの追加基本動作を行うことを選べますか？',
      'ajp': '選べます。'
    }]
  },
  {
    'name': '「終焉、来タレ」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  }]
},
{
  name: 'HONOKA 仄佳',
  list: [{
    name: '开花特性相关的FAQ',
    namejp: '開花全般へのFAQ',
    list: [{
      'qjp': 'シンラとホノカを宿しており、相手もホノカを宿しています。「引用」で相手のホノカのカードを使用した場合、私の追加札にあるカードと交換することはできますか？',
      'ajp': 'できません。'
    },
    {
      'qjp': '「いんだすとりあ」に「精霊式」が封印されています。その際に「でゅーぷりぎあ」を使用した場合、その「でゅーぷりぎあ」を「守護霊式」に交換することはできますか？',
      'ajp': 'いいえ、できません。カードの交換を行うには双方の名前が正しい必要があります。'
    }]
  },
  {
    'name': '「精霊式」',
    'list': [{
      'ajp': '開花全般へのFAQもご覧ください。',
      'a': '请参阅[开花]特性相关的FAQ。'
    }]
  },
  {
    'name': '「守護霊式」',
    'list': [{
      'ajp': '開花全般へのFAQもご覧ください。',
      'a': '请参阅[开花]特性相关的FAQ。'
    },
    {
      'qjp': '対応で使用しなかった場合でも交換はできますか？',
      'ajp': 'はい、可能です。',
      'a': '可以。'
    }]
  },
  {
    'name': '「突撃霊式」',
    'list': [{
      'ajp': '開花全般へのFAQもご覧ください。',
      'a': '请参阅[开花]特性相关的FAQ。'
    }]
  },
  {
    'name': '「神霊ヲウカ」',
    'list': [{
      'ajp': '開花全般へのFAQもご覧ください。',
      'a': '请参阅[开花]特性相关的FAQ。'
    }]
  },
  {
    'name': '「桜吹雪」',
    'list': [{
      'qjp': '私のオーラに空きがないときに間合から私のオーラへの移動を選ぶことはできますか？',
      'ajp': 'はい、可能です。結果として結晶の移動は発生しません。'
    },
    {
      'qjp': '相手のオーラに桜花結晶がないときに相手のオーラから間合への移動を選ぶことはできますか？',
      'ajp': 'はい、可能です。結果として結晶の移動は発生しません。'
    }]
  },
  {
    'name': '「義旗共振」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「桜の翅」',
    'list': [{
      'ajp': '開花全般へのFAQもご覧ください。',
      'a': '请参阅[开花]特性相关的FAQ。'
    }]
  },
  {
    'name': '「再生」',
    'list': [{
      'ajp': '開花全般へのFAQもご覧ください。',
      'a': '请参阅[开花]特性相关的FAQ。'
    }]
  },
  {
    'name': '「桜花のお守り」',
    'list': [{
      'ajp': '開花全般へのFAQもご覧ください。',
      'a': '请参阅[开花]特性相关的FAQ。'
    },
    {
      'qjp': '私のターンに対応でなく使用することはできますか？',
      'ajp': 'できます。「仄かなる輝き」へ交換することができます。'
    },
    {
      'qjp': '切札に対応して使用することはできますか？',
      'ajp': 'できますが打ち消しは行われません。「仄かなる輝き」へ交換することはできます。'
    },
    {
      'qjp': '毒を伏せて相手の攻撃を打ち消すことはできますか？',
      'ajp': '毒は伏せ札にできないため、打ち消せません。'
    }]
  },
  {
    'name': '「仄かなる輝き」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「指揮」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「追い風」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「胸に想いを」',
    'list': [{
      'ajp': '開花全般へのFAQもご覧ください。',
      'a': '请参阅[开花]特性相关的FAQ。'
    },
    {
      'qjp': '「両手に華を」に交換するに際し、「どれーんでびる」の【使用済】効果の条件を満たしますか？',
      'ajp': 'はい。交換の処理の過程で「両手に華を」は一度使用済になった後に未使用に戻るため、「どれーんでびる」の【使用済】効果の条件を満たします。'
    }]
  },
  {
    'name': '「両手に華を」',
    'list': [{
      'ajp': '開花全般へのFAQもご覧ください。',
      'a': '请参阅[开花]特性相关的FAQ。'
    },
    {
      'qjp': '1つ目の効果による基本動作《纏い》を行うに際し、「両手に華を」の上に桜花結晶を移動させることはできますか？',
      'ajp': 'いいえ、まだ「両手に華を」が使用済でないため、その【使用済】効果は有効になっていません。'
    },
    {
      'qjp': '《纏い》を行い、桜花結晶をこのカードの上にも私のオーラにも動かさないことを選べますか？',
      'ajp': 'いいえ、桜花結晶1つをダストからあなたのオーラに動かすか、桜花結晶1つをダストまたはあなたのオーラからこのカードの上に置くかを選んでください。'
    },
    {
      'qjp': 'ダストがない場合にも、《纏い》によって私のオーラからこのカードの上に桜花結晶を置くことを選べますか？',
      'ajp': 'はい、選べます。'
    },
    {
      'qjp': 'ダストがない場合にも、《纏い》によってダストからこのカードの上に桜花結晶を置くことを選べますか？',
      'ajp': 'いいえ、桜花結晶が移動しない基本動作を選択することはできません。'
    },
    {
      'qjp': '私のオーラがない場合にも、《纏い》によって私のオーラからこのカードの上に桜花結晶を置くことを選べますか？',
      'ajp': 'いいえ、桜花結晶が移動しない基本動作を選択することはできません。'
    },
    {
      'qjp': '「陽の音」や「守護霊式」などのダスト→オーラ:1の矢印効果でこのカードの上に桜花結晶を置くことはできますか？',
      'ajp': 'いいえ、基本動作《纏い》ではないためできません。'
    },
    {
      'qjp': '「そして新たな幕開けを」に交換するに際し、「どれーんでびる」の【使用済】効果の条件を満たしますか？',
      'ajp': '交換の処理の過程で「そして新たな幕開けを」は使用済の状態で切札に加わった後に未使用に戻るため、「どれーんでびる」の【使用済】効果の条件を満たします。'
    },
    {
      'qjp': '「生体活性」により未使用に戻した場合、桜花結晶はどうなりますか？',
      'ajp': '桜花結晶は「両手に華を」に紐付けられたまま＜切札＞領域に残ります。再度使用すればまた「両手に華を」に桜花結晶を移動させることができます。'
    },
    {
      'qjp': '「りげいなー」により再度使用した場合、桜花結晶はどうなりますか？',
      'ajp': '桜花結晶は「両手に華を」に紐付けられたまま＜切札＞領域に残ります。'
    }]
  },
  {
    'name': '「そして新たな幕開けを」',
    'list': [{
      'qjp': '領域とは何ですか？',
      'ajp': 'ゲームにおける領域とは、＜間合＞、＜ライフ＞(2箇所)、＜オーラ＞(2箇所)、＜フレア＞(2箇所)、＜ダスト＞、＜山札＞(2箇所)、＜捨て札＞(2箇所)、＜伏せ札＞(2箇所)、＜付与札＞(2箇所)、＜手札＞(2箇所)、＜切札＞(2箇所)、＜追加札＞(2箇所)、＜封印＞、＜使用中＞、＜攻撃中＞、＜ゲーム外＞のことを指します。 　そのうち、終了フェイズに桜花結晶が存在しうる領域は、＜間合＞、＜ライフ＞(2箇所)、＜オーラ＞(2箇所)、＜フレア＞(2箇所)、＜ダスト＞、＜付与札＞(2箇所)、＜切札＞(2箇所)、＜ゲーム外＞の計13箇所です。'
    }]
  },
  {
    'name': '「この旗の名の下に」',
    'list': [{
      'qjp': '捨て札にある《付与》カードを選び、そこに桜花結晶を置くことはできますか？',
      'ajp': 'いいえ、できません。捨て札にある《付与》カードは付与札ではありません。'
    },
    {
      'qjp': '隙を持つ付与札を選びましたが、対応によってその付与札が伏せ札になりました。この場合どうなりますか？',
      'ajp': '移動させる付与札が存在しないため、通常通りのダメージの処理が行われます。'
    }]
  },
  {
    'name': '「四季はまた廻り来る」',
    'list': [{
      'qjp': '「四季はまた廻り来る」の3つ目の効果に際して、伏せ札にするカードに毒を選択できますか？',
      'ajp': '毒を伏せ札にするカードとして選択することはできません。'
    },
    {
      'qjp': '＜マシン＞領域に「Form:YAKSHA」が存在し、造花結晶がありません。「四季はまた廻り来る」の3つ目の効果はどう解決されますか？',
      'ajp': 'その場合でも手札を1枚伏せ札にしなくてはなりません。その上で、「Form:YAKSHA」の【常時】効果により基本動作が行えないため、《纏い》を行うこともできません。'
    },
    {
      'qjp': '「毒霧」を使用し、相手の＜手札＞領域に毒を移動させました。「四季はまた廻り来る」の【使用済】効果は発生しますか？',
      'ajp': '発生しません。毒は＜追加札＞領域からではなく、＜毒袋＞領域から移動しています。'
    },
    {
      'qjp': '「Julia\'s BlackBox」の効果でTransFormしました。「四季はまた廻り来る」の【使用済】効果は発生しますか？',
      'ajp': '発生します。TransFormにより、いずれかのTransFormカードが＜追加札＞領域から＜マシン＞領域に移動しています。'
    },
    {
      'qjp': '「Quick Change」の効果でTransFormカードを封印しました。「四季はまた廻り来る」の【使用済】効果は発生しますか？',
      'ajp': '発生します。'
    },
    {
      'qjp': '徴兵により兵員を徴兵済にした際に、「四季はまた廻り来る」の【使用済】効果は発生しますか？',
      'ajp': '発生しません。徴兵は＜追加札＞領域に関連しません。'
    },
    {
      'qjp': '構想を準備した際に、「四季はまた廻り来る」の【使用済】効果は発生しますか？',
      'ajp': '＜追加札＞から準備したなら発生します。'
    }]
  },
  {
    'name': '「満天の花道で」',
    'list': [{
      'qjp': 'オーラに4つの桜花結晶と1つの凍結トークンが置かれています。開始フェイズに「満天の花道で」の上の桜花結晶はどうなりますか？',
      'ajp': 'オーラへと移動しようとしますが失敗します。結果として「満天の花道で」の上に留まります。'
    }]
  },
  {
    'name': '「桜の双剣」',
    'list': [{
      'ajp': '開花全般へのFAQもご覧ください。',
      'a': '请参阅[开花]特性相关的FAQ。'
    }]
  },
  {
    'name': '「影の両手」',
    'list': [{
      'ajp': '開花全般へのFAQもご覧ください。',
      'a': '请参阅[开花]特性相关的FAQ。'
    }]
  },
  {
    'name': '「ひとり目覚めて」',
    'list': [{
      'ajp': '開花全般へのFAQもご覧ください。',
      'a': '请参阅[开花]特性相关的FAQ。'
    }]
  },
  {
    'name': '「標をたどり」',
    'list': [{
      'ajp': '開花全般へのFAQもご覧ください。',
      'a': '请参阅[开花]特性相关的FAQ。'
    }]
  },
  {
    'name': '「影面見向き」',
    'list': [{
      'ajp': '開花全般へのFAQもご覧ください。',
      'a': '请参阅[开花]特性相关的FAQ。'
    }]
  },
  {
    'name': '「桜花眩く輝かん」',
    'list': [{
      'ajp': '超克へのFAQもご覧ください。',
      'a': '请参阅超克关键词相关的FAQ。'
    }]
  },
  {
    'name': '「ふたり震える手を取ろう」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「旧き虚路を歩みゆく」',
    'list': [{
      'qjp': '『相手は次のメインフェイズを失う』とはどういうことですか？',
      'ajp': '次の相手のターンの開始フェイズの後、メインフェイズを行わず、終了フェイズを行います。失ったフェイズで行われるはずであった処理はすべて消滅します。'
    }]
  }]
},
{
  name: 'KORUNU 凝努',
  list: [{
    name: '冻结特性相关的FAQ',
    namejp: '凍結全般へのFAQ',
    list: [{
      'qjp': '私がコルヌを宿していない状態で、「引用」などで相手のコルヌのカードを使用しました。相手は凍結しますか？',
      'ajp': '凍結します。'
    },
    {
      'qjp': '凍結している状態で「Stunt」を使用してオーラにある桜花結晶をフレアに移動できますか？',
      'ajp': 'できます。「Stunt」はあくまで矢印効果による桜花結晶の移動のため基本動作《宿し》ではありません。逆に「Stunt」によって凍結トークンを取り除くことはできません。'
    },
    {
      'qjp': '『相手のオーラに空きがない』とはどういうことですか？',
      'ajp': '『相手のオーラに空きがない』とは、相手のオーラに置かれている桜花結晶と凍結トークンの総数が相手のオーラの上限以上であることを指します。'
    }]
  },
  {
    'name': '「雪刃」',
    'list': [{
      'ajp': '凍結全般へのFAQもご覧ください。',
      'a': '请参阅[冻结]特性相关的FAQ。'
    }]
  },
  {
    'name': '「旋回刃」',
    'list': [{
      'qjp': '「もじゅるー」展開中の相手が、《行動》である対応カードで対応しました。「もじゅるー」の【展開時】効果と「旋回刃」の【常時】効果の解決順はどうなりますか？',
      'ajp': 'ターンプレイヤーが選択して解決します。'
    },
    {
      'qjp': '「旋回刃」による《攻撃》に対応して「鳶影」から任意のカードを使用しました。「旋回刃」の【常時】効果は何回発生しますか？',
      'ajp': '2回発生します。「鳶影」によって使用されたカードは「旋回刃」に対応したものと扱われるため、この解決後に「旋回刃」の【常時】効果が発生します。その後、「鳶影」の解決が終了したことにより、「旋回刃」の【常時】効果が再度発生します。'
    }]
  },
  {
    'name': '「剣の舞」',
    'list': [{
      'ajp': '凍結全般へのFAQもご覧ください。',
      'a': '请参阅[冻结]特性相关的FAQ。'
    }]
  },
  {
    'name': '「雪渡り」',
    'list': [{
      'ajp': '凍結全般へのFAQもご覧ください。',
      'a': '请参阅[冻结]特性相关的FAQ。'
    }]
  },
  {
    'name': '「絶対零度」',
    'list': [
      {
        'ajp': '凍結全般へのFAQもご覧ください。',
        'a': '请参阅[冻结]特性相关的FAQ。'
      },
      {
        'qjp': '間合が10のときに全力化を適用してこのカードを使用しました。相手は凍結しますか？',
        'ajp': 'はい。相手のオーラに空きがあるならそれがなくなるまで凍結します。'
      },
      {
        'qjp': '対応で使用し、全力化を適用できますか？',
        'ajp': 'いいえ、できません。全力化は自分のメインフェイズに全力行動を選択し使用した際のみ適用されます。'
      }
    ]
  },
  {
    'name': '「かじかみ」',
    'list': [{
      'ajp': '凍結全般へのFAQもご覧ください。',
      'a': '请参阅[冻结]特性相关的FAQ。'
    },
    {
      'qjp': '『基本動作《宿し》が行えない』とはどういう意味ですか？',
      'ajp': '基本動作により、オーラからフレアに桜花結晶を1つ動かすことも、オーラから凍結トークンを1つ取り除くこともできなくなります。'
    }]
  },
  {
    'name': '「霜の茨」',
    'list': [{
      'ajp': '凍結全般へのFAQもご覧ください。',
      'a': '请参阅[冻结]特性相关的FAQ。'
    },
    {
      'qjp': '同一ターン中に、切札による《攻撃》を行ってから切札でない《攻撃》を行った場合、後者は「霜の茨」により+1/+1されますか？',
      'q': '同一回合中第一张王牌攻击之后使用，第二张普通牌攻击具体如何判定？',
      'ajp': 'はい、されます。',
      'a': '即使第一张是开切的攻击牌，第二张非王牌的攻击牌依然能buff。卡文的意思是第一次的非王牌攻击上buff。'
    }]
  },
  {
    'name': '「コンルルヤンペ」',
    'list': [{
      'ajp': '凍結全般へのFAQもご覧ください。',
      'a': '请参阅[冻结]特性相关的FAQ。'
    }]
  },
  {
    'name': '「レタルレラ」',
    'list': [{
      'ajp': '凍結全般へのFAQもご覧ください。',
      'a': '请参阅[冻结]特性相关的FAQ。'
    }]
  },
  {
    'name': '「ウパシトゥム」',
    'list': [{
      'ajp': '凍結全般へのFAQもご覧ください。',
      'a': '请参阅[冻结]特性相关的FAQ。'
    }]
  },
  {
    'name': '「ポルチャルトー」',
    'list': [{
      'ajp': '凍結全般へのFAQもご覧ください。',
      'a': '请参阅[冻结]特性相关的FAQ。'
    },
    {
      'qjp': '「風魔纏廻」が使用済です。「ポルチャルトー」を自身の【常時】効果により《対応》を持つかのように使用するなら、消費はいくつになりますか？',
      'ajp': '3です。自身の【常時】効果で4を代入してから、「風魔纏廻」の【使用済】効果で1減少します。'
    },
    {
      'qjp': '「ぐらんがりばー」が使用済です。「ポルチャルトー」を自身の【常時】効果により《対応》を持つかのように使用するなら、消費はいくつになりますか？',
      'ajp': '0です。消費に対しての代入は必ず最も小さいもののみが適用されます。'
    }]
  }]
},
{
  name: 'YATSUHA 八叶',
  list: [{
    name: '镜映特性相关的FAQ',
    namejp: '鏡映全般へのFAQ',
    list: [{
      'qjp': '鏡映数を数えるに際し、「無音壁」や「遺響壁」の上に置かれた桜花結晶はオーラにあるものとみなされますか？',
      'ajp': 'いいえ、ダメージの解決ではありませんのでみなされません。'
    }]
  },
  {
    'name': '「星の爪」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「昏い咢」',
    'list': [{
      'ajp': '鏡映全般へのFAQもご覧ください。',
      'a': '请参阅[镜映]特性相关的FAQ。'
    }]
  },
  {
    'name': '「鏡の悪魔」',
    'list': [{
      'qjp': '私のライフが1のときに「鏡の悪魔」を使用し相手のライフを0にした場合、勝敗はどのようになりますか？',
      'ajp': '「鏡の悪魔」のダメージにより相手のライフが0になった瞬間に勝敗判定となり勝利します。これは【攻撃後】効果の解決前に行われるためあなたのライフが0になることはありません。'
    }]
  },
  {
    'name': '「幻影歩法」',
    'list': [{
      'qjp': '下の効果を選択し、間合に桜花結晶がありません。その際に離脱した場合、現在の間合はどうなりますか？',
      'ajp': '現在の間合は0のままです。離脱により間合に1つの桜花結晶が置かれることとなりましたが、そこから間合が1小さくなるため0となります。'
    },
    {
      'qjp': '下の効果を選択し、現在の間合が9（間合に桜花結晶が10個ある）のときに後退はできますか？',
      'ajp': 'いいえ、できません。間合に置くことのできる桜花結晶の上限は10個なのでそれ以上置くような移動はできません。'
    },
    {
      'qjp': '現在の間合が10の時に使用し、上の効果を選択した場合どうなりますか？',
      'ajp': '現在の間合は11になります。'
    }]
  },
  {
    'name': '「意志」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「契約」',
    'list': [{
      'qjp': '「契約」を使用した次の終了フェイズ中に「びっぐごーれむ」や「指揮」等でお互いのフレアが変化しました。どうなりますか？',
      'ajp': 'まず、ターンプレイヤーが終了フェイズに発生する効果の解決順を決定し、その上で「契約」の効果解決時のフレアを参照します。例えば元々の両者のフレアが2の際に先に「びっぐごーれむ」の効果を解決したならば、相手のフレアの方が大きくなるために契約の効果は解決されません。'
    }]
  },
  {
    'name': '「寄花」',
    'list': [{
      'ajp': '鏡映全般へのFAQもご覧ください。',
      'a': '请参阅[镜映]特性相关的FAQ。'
    },
    {
      'qjp': '「寄花」を使用する際にオーラから桜花結晶をこの上に置いたことによって鏡映数が変化した場合、置かれるべき桜花結晶の総数は変化しますか？',
      'ajp': 'いいえ。納の値は「寄花」を使用する時点での鏡映数によって決定されます。'
    },
    {
      'qjp': '「寄花」の【破棄時】効果による《攻撃》でオーラへのダメージを選び、続けて「斬撃乱舞」が使用された場合、「斬撃乱舞」による《攻撃》のダメージはいくつになりますか？',
      'ajp': '4/3になります。このターンオーラに0点のダメージが与えられているため、「斬撃乱舞」自身の【常時】効果による修正を受けます。'
    }]
  },
  {
    'name': '「双葉鏡の祟り神」',
    'list': [{
      'qjp': '風神ゲージ・雷神ゲージがともに4であるプレイヤーが使用した「風雷撃」を複製した場合の《攻撃》のダメージはいくつですか？',
      'ajp': '4/2になります。対応したプレイヤーがライラを宿していてもいなくても変わりません。'
    },
    {
      'qjp': 'お互いのライフが3以下であるときに使用された「一閃」を複製した場合の《攻撃》のダメージはいくつですか？',
      'ajp': '3/2になります。複製した《攻撃》は【常時】効果を持ちません。'
    },
    {
      'qjp': 'お互いに「二重奏：弾奏氷瞑」が使用済であるときに使用された「斬」(3/2)を複製した場合の《攻撃》のダメージはいくつですか？',
      'ajp': '3/3になります。3/2に対応したプレイヤーの「二重奏：弾奏氷瞑」の【使用済】による修正が加わります。'
    },
    {
      'qjp': '「クリムゾンゼロ」を複製した場合、相手は両方のダメージを選ばなくてはなりませんか？',
      'ajp': 'いいえ、【常時】効果を持たない2/2の《攻撃》であるため、相手はどちらか片方のダメージを選択して受けることになります。'
    },
    {
      'qjp': '「立論」を複製した場合どうなりますか？',
      'ajp': 'お互いの山札の枚数を問わず、2/-の《攻撃》として解決されます。'
    },
    {
      'qjp': '「陽の音」の展開中に「双葉鏡の祟り神」によって《攻撃》を複製したとき、「陽の音」の【展開中】効果は何回発生しますか？',
      'ajp': '1回です。 複製した《攻撃》は元の《攻撃》に対応したものと扱われますが、『対応したカード』が存在しないため「陽の音」の【展開中】効果を発生させません。'
    },
    {
      'qjp': '集中力が2の状態で「梳流し」を複製した場合、【攻撃後】効果はどうなりますか？',
      'ajp': '『このカード』はその効果を持つ《攻撃》カードを指すため、複製の【攻撃後】効果は何もしません。'
    },
    {
      'qjp': '「旋回刃」に対応して複製した場合、「旋回刃」の【常時】効果は何度発生しますか？',
      'ajp': '1回です。『対応したカード』は「双葉鏡の祟り神」のみです。'
    },
    {
      'qjp': '順風である相手が使用した「水雷球」を逆風である私が複製した場合どうなりますか？',
      'ajp': '2/2になり、【攻撃後】効果も有効です。'
    }]
  },
  {
    'name': '「四葉鏡のわらべ唄」',
    'list': [{
      'ajp': 'カードを使用する効果へのFAQもご覧ください。'
    },
    {
      'qjp': '「弛緩毒」や「騎兵」を選んだ場合どうなりますか？',
      'ajp': 'その上の桜花結晶を全てダストに送り、【破棄時】効果を解決し、その上でそのカードは使用できません。付与札が破棄された後、そのカードがいずれかの捨て札にないためです。'
    },
    {
      'qjp': '終端を持つ付与札を選び、使用した場合、どうなりますか？',
      'ajp': '終端を持つカードを使用したため、このターン中あなたは基本動作とカードの使用ができなくなります。'
    },
    {
      'qjp': '「圧気」を選び、その【破棄時】効果による《攻撃》に「絶唱絶華」で対応され現在のフェイズが終了した場合、破棄した「圧気」を使用することはできますか？',
      'ajp': 'フェイズが終了しているため使用できません。「圧気」は捨て札に残ります。'
    }]
  },
  {
    'name': '「六葉鏡の星の海」',
    'list': [{
      'ajp': '超克へのFAQもご覧ください。',
      'a': '请参阅超克关键词相关的FAQ。'
    }, {
      'ajp': '鏡映全般へのFAQもご覧ください。',
      'a': '请参阅[镜映]特性相关的FAQ。'
    }]
  },
  {
    'name': '「八葉鏡の向こう側」',
    'list': [{
      'ajp': '終端へのFAQもご覧ください。',
      'a': '请参阅终端关键词相关的FAQ。'
    },
    {
      'qjp': '『あなたのカード』とはなんですか？',
      'ajp': '『あなたのカード』とは、あなたが保有者であるカードのことを指します。'
    },
    {
      'qjp': '私が「八葉鏡の向こう側」を展開中に、「引用」などで相手のカードを使用した場合どうなりますか？',
      'ajp': '使用したカードは『あなたのカード』でないため、矢印は両矢印にはなりません。'
    },
    {
      'qjp': '私が「八葉鏡の向こう側」を展開中に、相手が「引用」などで私のカードを使用した場合どうなりますか？',
      'ajp': '使用されたカードは『あなたのカード』であるため、矢印は両矢印です。'
    },
    {
      'qjp': '私が「八葉鏡の向こう側」を展開中に、相手から毒が送られてきた場合どうなりますか？',
      'ajp': '渡された毒は『あなたのカード』であるため、矢印は両矢印です。'
    },
    {
      'qjp': '世紀の大発見を行ったことにより相手が眼前構築で選ばなかった切札を得ました。これらは「八葉鏡の向こう側」を展開するとどうなりますか？',
      'ajp': 'それらは『あなたのカード』になっているため、矢印は両矢印になります。'
    },
    {
      'qjp': '「八葉鏡の向こう側」展開中、「Form:GARUDA」による追加基本動作「Delta-Wing」はどうなりますか？',
      'ajp': '「Form:GARUDA」は『あなたのカード』であるため、「Delta-Wing」の矢印は両矢印です。'
    },
    {
      'qjp': '私が「八葉鏡の向こう側」を展開中に、「桜吹雪」を使用した場合どうなりますか？',
      'ajp': '相手に「間合↔︎自/オーラ:1」「相/オーラ↔︎間合:1」を選ばせた後、あなたが桜花結晶を動かす方向を決定します。'
    }]
  },
  {
    'name': '「八葉鏡の徒桜」',
    'list': [
      {
        'ajp': '終端へのFAQもご覧ください。',
        'a': '请参阅终端关键词相关的FAQ。'
      }
    ]
  },
  {
    'name': '「星辰の鉤爪」',
    'list': [
      {
        'ajp': 'このカードへのFAQはありません。',
        'a': '没有FAQ。'
      }
    ]
  },
  {
    'name': '「深淵の大口」',
    'list': [
      {
        'ajp': '鏡映全般へのFAQもご覧ください。',
        'a': '请参阅[镜映]特性相关的FAQ。'
      }
    ]
  },
  {
    'name': '「本当の怪物」',
    'list': [
      {
        'ajp': 'このカードへのFAQはありません。',
        'a': '没有FAQ。'
      }
    ]
  },
  {
    'name': '「幻影連携」',
    'list': [
      {
        'ajp': 'このカードへのFAQはありません。',
        'a': '没有FAQ。'
      }
    ]
  },
  {
    'name': '「決意」',
    'list': [
      {
        'ajp': '鏡映全般へのFAQもご覧ください。',
        'a': '请参阅[镜映]特性相关的FAQ。'
      }
    ]
  },
  {
    'name': '「盟約」',
    'list': [
      {
        'ajp': 'このカードへのFAQはありません。',
        'a': '没有FAQ。'
      }
    ]
  },
  {
    'name': '「徒寄花」',
    'list': [
      {
        'qjp': '完全態にしたカードがちょうど3枚のときにこのカードが破棄されました。3枚以下のときの効果を解決することで4枚以上のときの効果を解決できますか？',
        'ajp': 'いいえ、できません。【破棄時】効果の解決に入ったタイミングの完全態の枚数を参照し、どちらの効果を解決するか決定します。'
      }
    ]
  },
  {
    'name': '「見知らぬ世界」',
    'list': [
      {
        'qjp': '《攻撃》カードを使用し、対応によってその《攻撃》が失敗しました。その後このカードを使用した際にゲーム外から桜花結晶を納められますか？',
        'ajp': 'いいえ、納められません。《攻撃》が失敗してもカードは使用した扱いになります。'
      },
      {
        'qjp': '偽証を宣言し、反証が成功しました。その後このカードを使用した際にゲーム外から桜花結晶を納められますか？',
        'ajp': 'はい、このゲーム中にまだ他のカードを使用していないのなら納められます。反証が成功した場合、その偽証はカードの使用に数えられません。'
      }
    ]
  },
  {
    'name': '「色づく世界」',
    'list': [
      {
        'qjp': '一度旅路に出発した後もう一度このカードを使用した場合どうなりますか？',
        'ajp': 'なにも起きません。旅路への出発はそのゲーム中まだ旅時に出発していない場合のみ解決されます。'
      },
      {
        'qjp': '家路の効果の解決直後の自分の開始フェイズは「彼女にとっての桜降る代」が未使用ですが焦燥ダメージが発生しますか？',
        'ajp': 'はい、山札からカードが引けないため焦燥ダメージを受けます。'
      }
    ]
  },
  {
    'name': '「彼女にとっての桜降る代」',
    'list': [
      {
        'qjp': '＜思い出＞からカードを手札に戻す際、ヤツハのカードなら必ず公開しなければなりませんか？',
        'ajp': 'いいえ、公開しないことを選べます。その場合完全態にする処理は行われません。'
      },
      {
        'qjp': '山札にカードがある状態でも＜思い出＞からカードを手札に戻すことを選べますか？',
        'ajp': 'はい、選べます。'
      },
      {
        'qjp': '山札からカードを引く際、＜思い出＞にカードがない状態でも思い出から手札にカードを戻すことを選べますか？',
        'ajp': 'いいえ、できません。'
      }
    ]
  },
  {
    'name': '「彼女にとっての自我と決意」',
    'list': [
      {
        'qjp': '手札のヤツハのカードを公開しました。これを完全態にしないことを選べますか？',
        'ajp': 'いいえ、選べません。公開したカードが完全態にできるなら必ず交換する必要があります。'
      },
      {
        'qjp': '捨て札の既に完全態であるヤツハのカードを公開できますか？',
        'ajp': 'はい、できます。そのカードは交換されませんが山札の一番上に置くことができます。'
      },
      {
        'qjp': 'このターン既に「浦波嵐」を対応で使用しています。相手の《攻撃》に対してこのカードの【使用済】効果を適用できますか？',
        'ajp': 'はい、できます。【使用済】効果はカードの使用ではありません。'
      },
      {
        'qjp': '対応している《攻撃》に対して【使用済】効果は適用できますか？',
        'ajp': 'いいえ、できません。対応している《攻撃》に対して対応カードを選ぶ手順が存在しないため、その手順を置換するこのカードの【使用済】効果も適用できません。'
      },
      {
        'qjp': '「暁」に対して【使用済】効果を適用しました。どうなりますか？',
        'ajp': '「暁」は打ち消されます。【使用済】効果は対応ではありませんので「暁」の【常時】効果での置換は行われません。'
      }
    ]
  }]
},
{
  name: 'HATSUMI 初海',
  list: [{
    name: '航海特性相关的FAQ',
    namejp: '航海全般へのFAQ',
    list: [{
      'qjp': '直前のターンに相手から攻撃されましたが、対応により打ち消しました。このターンは順風ですか？',
      'ajp': 'いいえ、《攻撃》が打ち消されていても、攻撃されているならこのターンは逆風になります。'
    },
    {
      'qjp': '直前のターン、相手のカードの効果による《攻撃》が、適正距離の外であったために失敗しました。このターンは逆風ですか？',
      'ajp': 'いいえ、他に攻撃されていないなら順風です。適正距離の確認によって効果が不正になって《攻撃》が消去された場合、攻撃していないことになります。'
    },
    {
      'qjp': '先攻プレイヤーの第1ターンは順風ですか？',
      'ajp': 'はい。お互いのプレイヤーは順風です。'
    },
    {
      'qjp': 'ハツミを宿していないプレイヤーがハツミのカードを使用したとき、順風・逆風の状態はどうなりますか？',
      'ajp': 'いずれかのプレイヤーがハツミを宿している場合、お互いのプレイヤーが独立して順風・逆風の状態を持ちます。質問の状況においては、カードを使用したプレイヤーが順風・逆風であるかを参照します。'
    },
    {
      'qjp': '相手のターンにハツミのカードを使用する場合、順風・逆風の状態はどうなりますか？',
      'ajp': '直前のターン(あなたのターン)に相手から攻撃されていたら逆風で、そうでなければ順風です。'
    }]
  },
  {
    name: '潜水特性相关的FAQ',
    namejp: '潜水全般へのFAQ',
    list: [{
      'qjp': '潜水の解決によって相手の攻撃が失敗し、その後さらに相手が攻撃を行いました。次のターンは逆風ですか？',
      'ajp': 'いいえ、順風になります。潜水の解決によって攻撃が失敗した場合、効果によって順風になることが確定します。'
    },
    {
      'qjp': '潜水の効果とそれによって再起した「オヨギビ砲火」の【常時】効果による基本動作によって相手の攻撃の間合から外れました。次のターンは順風になりますか？',
      'ajp': 'はい、なります。「オヨギビ砲火」による基本動作は、入れ子解決によって潜水の間合確認より前に行われます。'
    },
    {
      'qjp': '潜水の解決によって相手の攻撃が失敗しました。相手はこのターン攻撃したことになりますか？',
      'ajp': 'いいえ、なりません。'
    },
    {
      'qjp': '私のターンに私が潜水を行った後、そのターン中に相手がカードを使用しました。どうなりますか？',
      'ajp': 'あなたのターンであっても、相手がカードを使用したならば相手のカードを解決する前に潜水が解決されます。'
    },
    {
      'qjp': '既に潜水状態である間に潜水しようとした場合、どうなりますか？',
      'ajp': '何も起きません。'
    },
    {
      'qjp': 'ハツミを宿していないプレイヤーがハツミのカードを使用して潜水しようとした場合、どうなりますか？',
      'ajp': 'そのプレイヤーは潜水状態になります。(ハツミを宿しているプレイヤーの潜水カードを用いて潜水状態を表すとよいでしょう)'
    }]
  },
  {
    'name': '「水雷球」',
    'list': [{
      'ajp': '航海全般へのFAQもご覧ください。',
      'a': '请参阅[航海]特性相关的FAQ。'
    }]
  },
  {
    'name': '「水流」',
    'list': [{
      'ajp': '航海全般へのFAQもご覧ください。',
      'a': '请参阅[航海]特性相关的FAQ。'
    },
    {
      'qjp': '「抜き足」や間合-1トークンなどによって、間合の空きがない状態で「水流」を全力行動で使用された場合、間合に移動できない分のダメージや桜花結晶の移動はどのようになりますか？',
      'ajp': '移動できなかった分の桜花結晶については元の領域に留まります。'
    }]
  },
  {
    'name': '「強酸」',
    'list': [{
      'ajp': '航海全般へのFAQもご覧ください。',
      'a': '请参阅[航海]特性相关的FAQ。'
    }]
  },
  {
    'name': '「海嘯」',
    'list': [{
      'ajp': '航海全般へのFAQもご覧ください。',
      'a': '请参阅[航海]特性相关的FAQ。'
    }]
  },
  {
    'name': '「準備万端」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「羅針盤」',
    'list': [{
      'qjp': '私が「どろりうら」を、相手が「羅針盤」を展開しています。どの順番で適正距離修正が適用されますか？',
      'ajp': '「どろりうら」が先、「羅針盤」が後です。'
    },
    {
      'qjp': '私が「羅針盤」を、相手が「追い風」を展開しています。相手の「奏流し」の適正距離はどのようになりますか？',
      'ajp': '適正距離を持たない《攻撃》に距離拡大は適用されないため、結果的に適正距離を持ちません。'
    }]
  },
  {
    'name': '「波呼び」',
    'list': [{
      'ajp': '航海全般へのFAQもご覧ください。',
      'a': '请参阅[航海]特性相关的FAQ。'
    },
    {
      'qjp': '展開中かつ相手のターンにライフに1以上のダメージを受けたとき、どうなりますか？',
      'ajp': '隙により伏せ札になります。紐付けられていた桜花結晶はダストに移動します。(伏せ札になったことにより、【展開中】が有効でなくなり、桜花結晶の移動に制限がなくなります)'
    }]
  },
  {
    'name': '「イサナ海域」',
    'list': [{
      'ajp': '航海全般へのFAQもご覧ください。',
      'a': '请参阅[航海]特性相关的FAQ。'
    }]
  },
  {
    'name': '「オヨギビ砲火」',
    'list': [{
      'qjp': '【常時】効果による基本動作で「Beta-Edge」などを選べますか？',
      'ajp': 'はい、選べます。'
    }]
  },
  {
    'name': '「カラハリ灯台」',
    'list': [{
      'ajp': '航海全般へのFAQもご覧ください。',
      'a': '请参阅[航海]特性相关的FAQ。'
    },
    {
      'qjp': 'カラハリ灯台で捨て札にしたカードごとの挙動はどのようになりますか？',
      'ajp': '以下のようになります。'
    },
    {
      'qjp': '潜水しており、「カラハリ灯台」が使用済である相手のターンに相手が手札から《行動》カードを使用しました。潜水は解決されますか？',
      'ajp': 'いいえ、されません。潜水はカードが解決される場合にその直前に割り込んで解決されます。カードが解決されないならば潜水はそのままです。'
    }]
  },
  {
    'name': '「ミオビキ航路」',
    'list': [{
      'ajp': '航海全般へのFAQもご覧ください。',
      'a': '请参阅[航海]特性相关的FAQ。'
    },
    {
      'qjp': '自身の効果で使用されるたび、連火のカード使用枚数に数えますか？',
      'ajp': 'はい、数えます。'
    },
    {
      'qjp': '自身の効果で使用されるたび、ライラを宿しているなら帯電しますか？',
      'ajp': 'はい、します。'
    }]
  },
  {
    'name': '「潜雷」',
    'list': [{
      'ajp': '潜水全般へのFAQもご覧ください。',
      'a': '请参阅[潜水]特性相关的FAQ。'
    }]
  },
  {
    'name': '「サギリ海域」',
    'list': [{
      'qjp': '私が「サギリ海域」と「羅針盤」を展開中です。相手の「手裏剣」の適正距離はどうなりますか？',
      'ajp': '3のみになります。まず「サギリ海域」の効果の適用を行うかを判定し、その後「羅針盤」の効果と同時に適用されます。その結果適正距離4と5が失われ、3のみになります。'
    },
    {
      'qjp': '私が「サギリ海域」を、相手が「羅針盤」を展開中です。相手の「斬」の適正距離はどうなりますか？',
      'ajp': '3,5になります。適正距離を追加する効果をすべて適用した後、適正距離を消去する効果を適用します。従って3-5になった後で、3つ以上の適正距離を持つため4が除かれます。'
    }]
  },
  {
    'name': '「ワダナカ航路」',
    'list': [{
      'ajp': '航海全般へのFAQもご覧ください。',
      'a': '请参阅[航海]特性相关的FAQ。'
    }, {
      'ajp': '潜水全般へのFAQもご覧ください。',
      'a': '请参阅[潜水]特性相关的FAQ。'
    }]
  }]
},
{
  name: 'MIZUKI 水津城',
  list: [{
    name: '统率特性相关的FAQ',
    namejp: '統率全般へのFAQ',
    list: [{
      'qjp': '『手札を1枚選ぶ』などの効果で兵舎にある徴兵済のカードを選べますか？',
      'ajp': 'いいえ、兵舎にある徴兵済のカードは手札にはありません。'
    },
    {
      'qjp': 'ライラを宿している場合、兵員は帯電しますか？',
      'ajp': 'いいえ、しません。兵員は使用者の情報を持ちません。'
    }]
  },
  {
    name: '不动特性相关的FAQ',
    namejp: '不動全般へのFAQ',
    list: [{
      'qjp': 'ターン開始時の間合から一度移動してから元の間合に戻った場合、不動の条件を満たしますか？',
      'ajp': 'いいえ、間合が変化したなら条件は満たしません。'
    },
    {
      'qjp': 'コダマとは誰ですか？',
      'ajp': '公式小説「八葉鏡の徒桜」に登場する、ミズキとは異なるメガミの一柱です。詳しくはこちらを御覧ください。'
    }]
  },

  {
    'name': '「陣頭」',
    'list': [
      {
        'ajp': '統率全般へのFAQもご覧ください。',
        'a': '请参阅[统率]特性相关的FAQ。'
      }
    ]
  },
  {
    'name': '「反攻」',
    'list': [
      {
        'ajp': 'このカードへのFAQはありません。',
        'a': '没有FAQ。'
      }
    ]
  },
  {
    'name': '「撃ち落とし」',
    'list': [
      {
        'ajp': '不動全般へのFAQもご覧ください。',
        'a': '请参阅[不动]特性相关的FAQ。'
      }
    ]
  },
  {
    'name': '「号令」',
    'list': [
      {
        'ajp': '統率全般へのFAQもご覧ください。',
        'a': '请参阅[统率]特性相关的FAQ。'
      }
    ]
  },
  {
    'name': '「防壁」',
    'list': [
      {
        'ajp': '終端へのFAQもご覧ください。',
        'a': '请参阅终端关键词相关的FAQ。'
      },
      {
        'qjp': '相手がこのターンに対応していた場合、《攻撃》を打ち消せますか？',
        'ajp': 'はい、打ち消せます。あなたが対応しているかのみを見ます。'
      }
    ]
  },
  {
    'name': '「制圧前進」',
    'list': [
      {
        'ajp': '統率全般へのFAQもご覧ください。',
        'a': '请参阅[统率]特性相关的FAQ。'
      },
      {
        'qjp': '現在の間合が達人の間合以下のときでも、《前進》を行う選択肢を選べますか?',
        'ajp': '選べますが、桜花結晶を間合からオーラへ動かすことはできません。'
      }
    ]
  },
  {
    'name': '「戦場」',
    'list': [
      {
        'ajp': '不動全般へのFAQもご覧ください。',
        'a': '请参阅[不动]特性相关的FAQ。'
      },
      {
        'qjp': '《攻撃》への対応によって間合が変化した場合、「戦場」の【展開中】効果による修正は失われますか？',
        'ajp': 'いいえ、「戦場」の修正は《攻撃》カードを使用した時点のみを見ます。'
      }
    ]
  },
  {
    'name': '「天主八龍閣」',
    'list': [
      {
        'ajp': '終端へのFAQもご覧ください。',
        'a': '请参阅终端关键词相关的FAQ。'
      },
      {
        'qjp': '「撃ち落とし」「闘神」は他のメガミのカードですか？',
        'ajp': 'はい。それらはコダマのカードです。'
      }
    ]
  },
  {
    'name': '「三重膝丸櫓」',
    'list': [
      {
        'qjp': '開始フェイズに攻撃していた場合、メインフェイズに使用できますか？',
        'ajp': 'いいえ、使用できません。'
      },
      {
        'qjp': '「らすとりさーち」や「四葉鏡のわらべ唄」等のカードが、解決中に終端を得た場合、「三重膝丸櫓」は再起しますか？',
        'ajp': 'いいえ、しません。カードを使用する時点でそのカードが終端を持っている場合にのみ再起します。'
      }
    ]
  },
  {
    'name': '「大手楯無門」',
    'list': [
      {
        'ajp': '統率全般へのFAQもご覧ください。',
        'a': '请参阅[统率]特性相关的FAQ。'
      },
      {
        'qjp': '「大手楯無門」で兵舎に「かさまわし」を置きました。この状態で傘の開閉を行った場合、兵舎から「かさまわし」を公開して効果を得ることはできますか？',
        'ajp': 'いいえ、できません。兵舎にあるカードは手札にはないため「かさまわし」を公開することはできません。'
      },
      {
        'qjp': '「大手楯無門」で兵舎に置いた通常札を使用した場合、どうなりますか？',
        'ajp': '通常通り捨て札に行きます。'
      }
    ]
  },
  {
    'name': '「闘神」',
    'list': [
      {
        'ajp': '不動全般へのFAQもご覧ください。',
        'a': '请参阅[不动]特性相关的FAQ。'
      },
      {
        'qjp': '《攻撃》への対応によって間合が変化した場合【常時】効果による修正は失われますか？',
        'ajp': 'はい。失われます。'
      },
      {
        'qjp': 'ライラを宿している場合、帯電しますか？',
        'ajp': 'はい。兵員ではなくコダマのカードであるため帯電します。'
      }
    ]
  },
  {
    'name': '「山城水津城の鬨の声」',
    'list': [
      {
        'ajp': '終端へのFAQもご覧ください。',
        'a': '请参阅终端关键词相关的FAQ。'
      },
      {
        'qjp': '捨て札などの《全力》カードもサブタイプ《全力》を失いますか？',
        'ajp': 'はい。'
      },
      {
        'qjp': 'サブタイプ《全力》を失ったカードを使用した時、「びっぐごーれむ」の【使用済】効果は発生しますか？',
        'ajp': 'しません。'
      },
      {
        'qjp': '全力化を持つカードを全力行動で使用した場合、このカードの2つ目の効果は適用されますか？',
        'ajp': 'いいえ、《全力》カードではないので適用されません。'
      }
    ]
  },
  {
    'name': '「槍兵」',
    'list': [
      {
        'ajp': '終端へのFAQもご覧ください。',
        'a': '请参阅终端关键词相关的FAQ。'
      },
      {
        'qjp': '「槍兵」による《攻撃》はミズキの《攻撃》ですか？',
        'ajp': 'いいえ、兵員は使用者の情報を持ちません。'
      }
    ]
  },
  {
    'name': '「盾兵」',
    'list': [
      {
        'ajp': '終端へのFAQもご覧ください。',
        'a': '请参阅终端关键词相关的FAQ。'
      },
      {
        'qjp': '対応不可（通常札）を持つ《攻撃》に対応できますか？',
        'ajp': 'はい。兵員は通常札ではありません、'
      }
    ]
  },
  {
    'name': '「騎兵」',
    'list': [
      {
        'ajp': '終端、対応不可を失うへのFAQもご覧ください。'
      }
    ]
  }
  ]
},
{
  name: 'MEGUMI 希',
  list: [{
    name: '异樱特性相关的FAQ',
    namejp: '異桜全般へのFAQ',
    list: [{
      'qjp': '付与カードを使用した時に種結晶が萌芽するタイミングはいつですか？',
      'ajp': '付与カードを使用し、付与に桜花結晶を乗せる前です。',
      'q': '使用付与卡的时候，种结晶的萌芽是哪个时点？',
      'a': '使用付与后，在付与上放置樱花结晶之前。'
    },
    {
      'qjp': '付与カードを使用する際、たった今萌芽した種結晶を置くことはできますか？',
      'ajp': 'はい、できます。',
      'q': '使用付与之际刚刚萌芽的种结晶可以被放置吗',
      'a': '可以。'
    },
    {
      'qjp': '付与札に置かれている種結晶が移動する場合どうなりますか？',
      'ajp': '土壌に萌芽していない状態で戻ります。',
      'q': '要移动在付与上放置的种结晶的场合会发生什么？',
      'a': '种结晶以未萌芽状态回到土壤中。'
    },
    {
      'qjp': 'ダストや私のオーラが《付与》カードの納より少ない場合、必ず種結晶を置く必要はありますか？',
      'ajp': 'いいえ、ありません。萌芽した種結晶は置かないことを選ぶことができます。',
      'q': '虚与自装的樱花结晶总数小于付与的纳的时候，一定要放置种结晶吗？',
      'a': '不需要，是否放置种结晶仍然是可选项。'
    },
    {
      'qjp': '「りふれくた」や「大嵐」の【展開時】効果で種結晶を置くことはできますか？',
      'ajp': 'いいえ、できません。種結晶を置くことができるのは《付与》カードを使用して納の数を置く時と生育の効果の時だけです。',
      'q': '可以使用《反涩装置》和《大岚》的【展开时】效果放置种结晶吗？',
      'a': '不可以，只有在使用付与后放置纳的数量的时点放置种结晶或借由生育的效果放置。'
    },
    {
      'qjp': '萌芽した種結晶が2つ以上あるときに、生育2を持つ付与を使用した場合、種結晶を1つだけ置くことはできますか？',
      'ajp': 'はい、できます。',
      'q': '有两个种结晶处于已萌芽状态，使用【生育2】的付与牌时，能否只放置一个种结晶？',
      'a': '可以。'
    },
    {
      'q': '「毒」或者「兵员」卡牌萌芽吗？',
      'a': '不。'
    },
    {
      'q': '使用付与卡牌的放置顺序？',
      'a': '先放异樱，再放装/虚的樱花结晶。'
    }]
  },
  {
    'name': '「空閃」',
    'list': [{
      'ajp': '異桜全般へのFAQもご覧ください。',
      'a': '请参阅[异樱]特性相关的FAQ。'
    },
    {
      'qjp': '土壌に種結晶が1つもないときに「空閃」を使用した場合、ダメージは2/1ですか？',
      'ajp': '3/2です。土壌に種結晶がないなら、『土壌の種結晶が全て萌芽している』という条件を満たします。'
    },
    {
      'qjp': 'メグミを宿していないプレイヤーが「空閃」を使用した場合、ダメージは2/1ですか？',
      'ajp': '3/2です。土壌を持っていないなら、『土壌の種結晶が全て萌芽している』という条件は常に満たされます。'
    }]
  },
  {
    'name': '「打擲」',
    'list': [{
      'ajp': '異桜全般へのFAQもご覧ください。',
      'a': '请参阅[异樱]特性相关的FAQ。'
    }]
  },
  {
    'name': '「殻打ち」',
    'list': [{
      'ajp': '異桜全般へのFAQもご覧ください。',
      'a': '请参阅[异樱]特性相关的FAQ。'
    },
    {
      'qjp': '「殻打ち」を2回使用した後に使用する《付与》カードは生育4を得られますか？',
      'ajp': 'はい。生育Xは合算されます。'
    }]
  },
  {
    'name': '「棹穿ち」',
    'list': [{
      'qjp': '『基本動作の効果を解決しない』とはどういうことですか？',
      'ajp': '基本動作を選択し、コストを支払った上で何も起きません。'
    }]
  },
  {
    'name': '「葦」',
    'list': [{
      'ajp': '異桜全般へのFAQもご覧ください。',
      'a': '请参阅[异樱]特性相关的FAQ。'
    }]
  },
  {
    'name': '「鳳仙花」',
    'list': [{
      'ajp': '異桜全般へのFAQもご覧ください。',
      'a': '请参阅[异樱]特性相关的FAQ。'
    },
    {
      'qjp': 'お互いに「鳳仙花」を展開している状態で私のメインフェイズになりました。先に私の「鳳仙花」の【展開中】効果を解決し、相手の「鳳仙花」が隙により伏せ札になったなら、相手の「鳳仙花」の【展開中】効果による《攻撃》は発生しますか？',
      'ajp': 'いいえ、発生しません。伏せ札になったことにより、【展開中】効果は参照できなくなっています。'
    }]
  },
  {
    'name': '「野茨」',
    'list': [{
      'ajp': '異桜全般へのFAQもご覧ください。',
      'a': '请参阅[异樱]特性相关的FAQ。'
    },
    {
      'qjp': '相手が「虚偽」を展開中に「野茨」を使用しました。生育2で置ける種結晶は減りますか？',
      'ajp': 'いいえ、減りません。生育Xで置かれる種結晶は納とは別です。'
    },
    {
      'qjp': '相手が騎動前進を行いました。2つ目の【展開中】効果は解決しますか？',
      'ajp': 'いいえ、しません。間合の桜花結晶は移動していません。'
    }]
  },
  {
    'name': '「因果律の根」',
    'list': [{
      'ajp': '異桜全般へのFAQもご覧ください。',
      'a': '请参阅[异樱]特性相关的FAQ。'
    },
    {
      'qjp': '土壌の種結晶は全て萌芽しておらず、付与札に種結晶がある状態で終了フェイズを迎えました。このカードは再起しますか？',
      'ajp': 'はい、再起します。'
    },
    {
      'qjp': 'メグミを宿していないプレイヤーが「因果律の根」を持っている場合、終了フェイズに再起しますか？',
      'ajp': '再起します。土壌を持っていないなら、『土壌に萌芽した種結晶がない』という条件は常に満たされます。'
    }]
  },
  {
    'name': '「可能性の枝」',
    'list': [{
      'ajp': '異桜全般へのFAQもご覧ください。',
      'a': '请参阅[异樱]特性相关的FAQ。'
    }]
  },
  {
    'name': '「結末の果実」',
    'list': [{
      'ajp': '打ち消されないへのFAQもご覧ください。'
    },
    {
      'ajp': '異桜全般へのFAQもご覧ください。',
      'a': '请参阅[异樱]特性相关的FAQ。'
    },
    {
      'qjp': '「圏域」とこのカードを展開している場合、「圏域」から移動する桜花結晶はどこへ移動しますか？',
      'ajp': 'ターンプレイヤーが「圏域」の効果とこのカードの効果のうちどちらを優先するか決めます。'
    },
    {
      'qjp': '開始フェイズに他の付与札が隙によって伏せ札になった場合、その上の桜花結晶は「結末の果実」に移動しますか？',
      'ajp': 'いいえ、移動しません。それは開始フェイズの処理ではありません。'
    }]
  },
  {
    'name': '「瀧河希の掌」',
    'list': [{
      'ajp': '異桜全般へのFAQもご覧ください。',
      'a': '请参阅[异樱]特性相关的FAQ。'
    },
    {
      'qjp': '-/1の《攻撃》は「瀧河希の掌」によって+1/+1されますか？',
      'ajp': 'いいえ、されません。「-」は3以下ではありません。'
    },
    {
      'qjp': '鏡映数が3です。「六葉鏡の星の海」は「瀧河希の掌」によって+1/+1されますか？',
      'ajp': 'はい、されます。加減はまだ適用されていないため、それは3/1であり、オーラへのダメージが3以下です。'
    },
    {
      'qjp': '間合が2です。「居合」は「瀧河希の掌」によって+1/+1されますか？',
      'ajp': 'いいえ、されません。加減はまだ適用されていないため、それは4/3であり、オーラへのダメージが3以下ではありません。'
    },
    {
      'qjp': 'ダストが12です。「円月」は「瀧河希の掌」によって+1/+1されますか？',
      'ajp': 'いいえ、されません。代入が先に適用されるため、それは-/2になり、オーラへのダメージが3以下でなくなります。'
    }]
  }]
},
{
  name: 'KANAWE 叶慧',
  list: [{
    name: '神话特性相关的FAQ',
    namejp: '神語全般のFAQ',
    list: [{
      'qjp': 'ダストや自分のオーラに桜花結晶がなく、自分の構想が準備されている場合、新たに構想を準備できますか。',
      'ajp': 'はい、できます。すでに準備されていた構想カードを追加札に戻し、桜花結晶をダストに移動させた後、構想カードを新たに準備して、ダストにある桜花結晶を一番左のマスに置きます。'
    },
    {
      'qjp': 'お互いにカナヱを宿しています。構想の条件が満たされた場合、どの順に解決しますか。',
      'ajp': 'ターンプレイヤーが解決順を選びます。'
    },
    {
      'qjp': '一度黄色の幕へ進み、そのあと次の幕に進んだ場合、黄色の幕の効果は継続しますか。',
      'ajp': 'いいえ、しません。黄色の幕の効果は、黄色の幕にいる間のみ有効です。'
    },
    {
      'qjp': '現在の幕の色が黄色で、かつオーラが0で「八方振り」を使用しました。【攻撃後】効果による《攻撃》は+1/+1されますか？',
      'ajp': 'いいえ、されません。効果によって生成された《攻撃》は《攻撃》カードによる《攻撃》ではありません。'
    },
    {
      'qjp': '緑の幕へと移動しました。相手の伏せ札を選ぶことはできますか？',
      'ajp': 'いいえ、できません。'
    },
    {
      'qjp': 'カナヱを宿していないプレイヤーが幕の色を参照する場合、どうなりますか？',
      'ajp': '常に白として扱います。'
    },
    {
      'qjp': 'カナヱを宿していないプレイヤーが幕の値を参照する場合、どうなりますか？',
      'ajp': '常に0になります。'
    }]
  },
  {
    'name': '「空想」',
    'list': [{
      'ajp': '神語全般へのFAQもご覧ください。',
      'a': '请参阅[神话]特性相关的FAQ。'
    },
    {
      'q': '自己无叶慧的情况下X应该是什么数值？',
      'a': '视为白0，是偶数。'
    }]
  },
  {
    'name': '「脚本化」',
    'list': [{
      'ajp': '神語全般へのFAQもご覧ください。',
      'a': '请参阅[神话]特性相关的FAQ。'
    }]
  },
  {
    'name': '「演出化」',
    'list': [{
      'ajp': '神語全般へのFAQもご覧ください。',
      'a': '请参阅[神话]特性相关的FAQ。'
    }]
  },
  {
    'name': '「断行」',
    'list': [{
      'ajp': '神語全般へのFAQもご覧ください。',
      'a': '请参阅[神话]特性相关的FAQ。'
    },
    {
      'qjp': 'ダストが0です。「断行」の効果で基本動作《纏い》を行ってもよいですか。',
      'ajp': 'はい。結果として桜花結晶は移動しません。'
    }]
  },
  {
    'name': '「残光」',
    'list': [{
      'qjp': '相手の手札が「錬成攻撃」1枚でした。相手は集中力を得ますか？',
      'ajp': 'はい、得ます。相手の手札を山札の1番下に置く効果と相手が集中力を1得る効果は無関係です。'
    },
    {
      'qjp': '現在の幕の色が緑や紫でなくても、相手は集中力を得ますか？',
      'ajp': 'はい、得ます。'
    }]
  },
  {
    'name': '「即興」',
    'list': [{
      'ajp': '神語全般へのFAQもご覧ください。',
      'a': '请参阅[神话]特性相关的FAQ。'
    },
    {
      'ajp': '対応としてカードを使用する効果へのFAQもご覧ください。'
    },
    {
      'qjp': '現在の幕の色が緑であるときに、「即興」から使用したカードによる《攻撃》が打ち消された場合、手札に戻りますか？',
      'ajp': 'はい、捨て札にあるならば手札に戻ります。'
    },
    {
      'qjp': '相手の《攻撃》に対応して「鳶影」を使用し、それにより伏せ札から「即興」を、さらにそれにより手札から「鋼糸」を使用しました。「鋼糸」は相手の《攻撃》に対応していますか？',
      'ajp': 'はい、対応しています。'
    },
    {
      'qjp': '「旋回刃」に対応して「鳶影」を使用し、それにより伏せ札から「即興」を、さらにそれにより手札から「鋼糸」を使用しました。「旋回刃」の【常時】効果は何回発生しますか？',
      'ajp': '3回です。'
    }]
  },
  {
    'name': '「封殺」',
    'list': [{
      'ajp': '神語全般へのFAQもご覧ください。',
      'a': '请参阅[神话]特性相关的FAQ。'
    },
    {
      'qjp': '現在の幕の色が赤でなくても、通常札のカードの名前を宣言してもいいですか？',
      'ajp': 'はい。'
    }]
  },
  {
    'name': '「たまゆらふみ」',
    'list': [{
      'ajp': '神語全般へのFAQもご覧ください。',
      'a': '请参阅[神话]特性相关的FAQ。'
    },
    {
      'qjp': '下の効果を選択した場合、その構想カードを達成したときの面で準備する必要がありますか？',
      'ajp': 'いいえ、新しく意思を込めるかどうか選択して準備することができます。'
    }]
  },
  {
    'name': '「ほかげきらぼし」',
    'list': [{
      'ajp': '神語全般へのFAQもご覧ください。',
      'a': '请参阅[神话]特性相关的FAQ。'
    }]
  },
  {
    'name': '「あたらよちよに」',
    'list': [{
      'qjp': '効果による《攻撃》(「圧気」の【破棄時】など)に対応した場合、どうなりますか？',
      'ajp': '《攻撃》は打ち消されます。効果を発生させたカードは移動しません。'
    },
    {
      'qjp': '「槍兵」に対応しました。「槍兵」はどうなりますか？',
      'ajp': '未徴兵の状態で兵舎へと戻ります。'
    }]
  },
  {
    'name': '「はらからのあまつそら」',
    'list': [{
      'qjp': '毒カードは選べますか？',
      'ajp': 'いいえ、選べません。毒カードは通常札ではありません。'
    },
    {
      'qjp': '「眼前構築で選んでいない」カードとして追加札は選べますか？',
      'ajp': 'いいえ、選べません。「眼前構築で選んでいない」カードは眼前構築で選択可能なカードである必要があります。'
    }]
  },
  {
    'name': '「殺陣」',
    'list': [{
      'ajp': '神語全般へのFAQもご覧ください。',
      'a': '请参阅[神话]特性相关的FAQ。'
    },
    {
      'qjp': '対応として《攻撃》カードを使用しました。何回分だと数えられますか？',
      'ajp': '2回分です。対応として使用したことと《攻撃》を行なったことで2回分として数えます。'
    },
    {
      'qjp': '対応として「鳶影」から「誘導」を使用しました。何回分だと数えられますか？',
      'ajp': '1回分です。「鳶影」から使用したカードは「鳶影」が対応した《攻撃》に対応していると扱われますが、対応での使用には当たりません。'
    }]
  },
  {
    'name': '「桜飛沫」',
    'list': [{
      'ajp': '神語全般へのFAQもご覧ください。',
      'a': '请参阅[神话]特性相关的FAQ。'
    },
    {
      'qjp': '「フルバースト」のような移動元の領域が異なっている移動が一度に行われた場合でも達成されますか？',
      'ajp': 'はい、達成されます。一度に移動したなら移動元や移動先が異なっていても構いません。'
    },
    {
      'qjp': '付与札が3枚展開されていて、開始フェイズの処理でそれぞれの上から1つずつダストへ移動しました。この構想は達成されますか？',
      'ajp': 'はい、達成されます。開始フェイズの処理での付与札から桜花結晶をダストへ送る処理はすべて一度に行われます。'
    },
    {
      'qjp': '基本動作を3回以上行う効果を解決しました。この構想は達成されますか？',
      'ajp': 'いいえ、されません。基本動作は1つずつ解決するため、一度の移動ではありません。'
    },
    {
      'qjp': '付与札から種結晶を含む桜花結晶が3つ移動しました。この構想は達成されますか？',
      'ajp': 'はい、達成されます。＜付与札＞にある種結晶は桜花結晶として扱います。'
    },
    {
      'qjp': '意思を込めたこの構想が準備されており、納5の《付与》カードを使用しました。終了フェイズにこの構想は達成されますか？',
      'ajp': '基本的には達成されます。例外として、種結晶を含めて納めた場合は達成されません。'
    },
    {
      'qjp': '桜花結晶が3つ紐付いた「桜花眩く輝かん」を使用しました。この構想は達成されますか？',
      'ajp': 'いいえ、達成されません。＜使用中＞からの、および＜使用中＞への桜花結晶の移動は無視されます。'
    }]
  },
  {
    'name': '「鼓動」',
    'list': [{
      'ajp': '神語全般へのFAQもご覧ください。',
      'a': '请参阅[神话]特性相关的FAQ。'
    },
    {
      'qjp': '意思を込めたこの構想が準備されており、開始フェイズの処理のドローで発生した焦燥を両方ライフで受けました。終了フェイズにこの構想は達成されますか？',
      'ajp': 'いいえ、されません。焦燥は1枚毎に解決されるため、一度の変化ではありません。'
    }]
  },
  {
    'name': '「明転」',
    'list': [{
      'ajp': '神語全般へのFAQもご覧ください。',
      'a': '请参阅[神话]特性相关的FAQ。'
    },
    {
      'qjp': '相手のオーラが5で「誘導」を使用して上の効果を選択しました。この構想は進みますか？',
      'ajp': 'はい、進みます。矢印効果で桜花結晶が移動しなくても解決したことにはなります。'
    }]
  },
  {
    'name': '「粒立て」',
    'list': [{
      'ajp': '神語全般へのFAQもご覧ください。',
      'a': '请参阅[神话]特性相关的FAQ。'
    },
    {
      'qjp': '全力行動にて全力化を持つカードを使用しました。この構想は進みますか？',
      'ajp': 'いいえ、進みません。全力化したカードは《全力》カードではありません。'
    }]
  },
  {
    'name': '「位置取り」',
    'list': [{
      'ajp': '神語全般へのFAQもご覧ください。',
      'a': '请参阅[神话]特性相关的FAQ。'
    }]
  },
  {
    'name': '「物语板块」',
    'list': [{
      'q': '金幕效果说明？',
      'a': '只加成攻击牌，衍生的攻击不加成，如「天雷召唤阵」和「律动」等不加成。'
    }]
  }]
},
{
  name: 'KAMUWI 神居',
  list: [{
    name: '禁忌特性相关的FAQ',
    namejp: '禁忌全般へのFAQ',
    list: [{
      'qjp': '禁忌ゲージが16以上になり「最後の結晶」を使用しました。ゲームは続行できますか？',
      'ajp': 'いいえ、できません。「最後の結晶」は使用できますがその解決後に敗北条件を満たしているので敗北となりゲームが終了します。'
    },
    {
      'qjp': '現在ライフが10で、開始フェイズの処理で再構成を行うつもりです。開始フェイズの禁忌ゲージの上昇量はどうなりますか？',
      'ajp': '0です。禁忌ゲージの上昇の処理は開始フェイズの開始時に行います。'
    },
    {
      'qjp': 'カムヰを宿していない状態で誓約枠を持つカードを使用しました。誓約枠の効果を有効にすることはできますか？',
      'ajp': 'いいえ、できません。誓約枠の効果を有効にするには禁忌ゲージを上昇させる必要があり、カムヰを宿していないならばそれができません。'
    }]
  },
  {
    'name': '「紅刃」',
    'list': [{
      'ajp': '禁忌全般へのFAQもご覧ください。',
      'a': '请参阅[禁忌]特性相关的FAQ。'
    }]
  },
  {
    'name': '「散華刃」',
    'list': [{
      'ajp': '禁忌全般へのFAQもご覧ください。',
      'a': '请参阅[禁忌]特性相关的FAQ。'
    }]
  },
  {
    'name': '「四剣乱刃」',
    'list': [{
      'ajp': '禁忌全般へのFAQもご覧ください。',
      'a': '请参阅[禁忌]特性相关的FAQ。'
    }]
  },
  {
    'name': '「斬り払い」',
    'list': [{
      'ajp': '禁忌全般へのFAQもご覧ください。',
      'a': '请参阅[禁忌]特性相关的FAQ。'
    }, {
      'qjp': '「天音揺波の底力」に対応しました。【攻撃後】効果で禁忌ゲージはいくつ上昇しますか？',
      'ajp': '2上昇します。(誓約枠のものと合わせると4の上昇となります。) "《全力》または切札であるなら禁忌ゲージを2上げる"は両方を満たしても1度しか適用されません。'
    }]
  },
  {
    'name': '「棘縫い」',
    'list': [{
      'qjp': '間合が5のときにこのカードを使用しました。1つ目の効果と2つ目の効果を適用できますか？',
      'ajp': 'いいえ、できません。効果の解決に入ったタイミングの現在の間合を参照し、どの効果を解決するか決定します。'
    }]
  },
  {
    'name': '「血晶乱流」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「血飛沫」',
    'list': [{
      'ajp': '禁忌全般へのFAQもご覧ください。',
      'a': '请参阅[禁忌]特性相关的FAQ。'
    },
    {
      'qjp': '私が「血飛沫」を展開中に、相手が「浮舟宿」を使用しました。どうなりますか？',
      'ajp': '相手のオーラにダストから桜花結晶を5つ動かす代わりに、「血飛沫」の上の桜花結晶を1つダストに送ります。'
    },
    {
      'qjp': '私が「血飛沫」を展開中に、相手がオーラの空きがない状態で「風舞台」を使用しました。どうなりますか？',
      'ajp': '桜花結晶の移動が発生する場合にのみ置換が行われます。そのため間合から桜花結晶は移動しません。'
    }]
  },
  {
    'name': '「灯」',
    'list': [{
      'ajp': '禁忌全般へのFAQもご覧ください。',
      'a': '请参阅[禁忌]特性相关的FAQ。'
    }]
  },
  {
    'name': '「暁」',
    'list': [{
      'ajp': '「カラハリ灯台」へのFAQもご覧ください。',
      'a': '请参阅卡牌「子午灯塔」的FAQ。'
    },
    {
      'qjp': '「暁」に「防壁」で対応しました。終端の効果は適用されますか？',
      'ajp': 'いいえ、されません。'
    }]
  },
  {
    'name': '「阡」',
    'list': [{
      'ajp': '禁忌全般へのFAQもご覧ください。',
      'a': '请参阅[禁忌]特性相关的FAQ。'
    },
    {
      'qjp': '私が「阡」を展開中に、相手のライフが0になりました。私は勝利できますか？',
      'ajp': 'いいえ、＜付与札＞領域にある「阡」の上に桜花結晶が乗っているため、【常時】効果により勝利できません。'
    },
    {
      'qjp': '【展開時】効果の《攻撃》により相手のライフが0になりました。私は勝利できますか？',
      'ajp': 'いいえ、＜使用中＞領域にある「阡」の上に桜花結晶が乗っているため、【常時】効果により勝利できません。'
    },
    {
      'qjp': '私が「阡」を展開中に、私が『勝利する』効果を受けました。ゲームはどうなりますか？',
      'ajp': 'あなたは勝利できません。そのままゲームを続行します。'
    },
    {
      'qjp': '私が「阡」を展開中に、相手が『敗北する』効果を受けました。ゲームはどうなりますか？',
      'ajp': '相手は敗北し、あなたの勝利でゲームを終了します。'
    },
    {
      'qjp': '私が「阡」を展開中に、私と相手のライフが共に0になりました。ゲームはどうなりますか？',
      'ajp': 'あなたの敗北としてゲームが終了します。'
    },
    {
      'qjp': '私と相手が「阡」を展開中に、私と相手のライフが共に0になりました。ゲームはどうなりますか？',
      'ajp': 'ゲームは続行します。いずれかの「阡」が破棄される際にゲームが終了するでしょう。'
    },
    {
      'qjp': '私は「阡」と「森羅判証」を展開中で、相手のライフが0です。開始フェイズに「阡」と「森羅判証」が同時に破棄されました。ゲームはどうなりますか？',
      'ajp': '2つの付与札から桜花結晶は同時にダストに送られます。「森羅判証」の【破棄時】効果を解決する前に、「阡」の上から桜花結晶がなくなり、【常時】効果が終了するため、相手はライフが0であることにより敗北します。'
    },
    {
      'qjp': '私は「最後の結晶」を切札に未使用で持っています。相手が「阡」を展開中に、私のライフが0になりました。「最後の結晶」は使用されますか？',
      'ajp': 'いいえ、使用されません。「阡」が破棄される際に、あなたは初めて敗北することになります。'
    },
    {
      'qjp': '相手が「阡」を展開中で、私のライフが0です。私は開始フェイズに再構成を行えますか？',
      'ajp': 'はい、できます。'
    }]
  },
  {
    'name': '「尸」',
    'list': [{
      'ajp': '禁忌全般へのFAQもご覧ください。',
      'a': '请参阅[禁忌]特性相关的FAQ。'
    },
    {
      'ajp': '追加コストへのFAQもご覧ください。'
    },
    {
      'qjp': '禁忌ゲージが一度に5から7になりました。即再起の条件を満たしますか？',
      'ajp': 'いいえ、満たしません。ターン開始時の禁忌ゲージ上昇や「斬り払い」、「灯」によって5から7になった場合、6である瞬間が存在しません。'
    }]
  },
  {
    'name': '「理」',
    'list': [{
      'ajp': '追加コストへのFAQもご覧ください。'
    }]
  }]
},
{
  name: 'RENRI 恋离',
  list: [{
    name: '伪证特性相关的FAQ',
    namejp: '偽証全般へのFAQ',
    list: [{
      'qjp': '間合が合っていない《攻撃》カードとして偽証することはできますか？',
      'ajp': 'いいえ、できません。'
    },
    {
      'qjp': '眼前構築で選ばなかったカードとして偽証することはできますか？',
      'ajp': 'はい、できます。'
    },
    {
      'qjp': '偽証し、反証されなかった場合に「相手が反証に失敗している」という条件を満たしますか？',
      'ajp': 'いいえ、満たしません。相手が反証を行うことを選び、その上で失敗している必要があります。'
    },
    {
      'qjp': '毒カードや兵員カードで偽証することはできますか？',
      'ajp': 'いいえ、できません。ただし兵舎に存在する通常札で偽証することはできます。'
    },
    {
      'qjp': '《攻撃》カードとして偽証された場合、それに反証するかを選択するのと、その《攻撃》への対応を選択するのはどちらが先ですか？',
      'ajp': '反証が先です。'
    },
    {
      'qjp': '反証に失敗した際の『焦燥を受ける』とはどういうことですか？',
      'ajp': 'オーラに1点かライフに1点のダメージを受けてください。オーラが0である場合はオーラを選べません。'
    },
    {
      'qjp': '偽証し、反証に成功された場合、カードを使用した枚数に数えますか？',
      'ajp': 'いいえ、数えません。'
    },
    {
      'qjp': '《攻撃》カードとして偽証し、反証に成功された場合、攻撃したことになりますか？',
      'ajp': 'いいえ、なりません。'
    },
    {
      'qjp': 'ライラを宿しています。偽証し、反証されなかったか反証が失敗したカードは帯電しますか？',
      'ajp': 'はい、帯電します。ただしカードの解決後に伏せ札になる時点で帯電状態でなくなります。'
    },
    {
      'qjp': '「でゅーぷりぎあ」や「錬成攻撃」が偽証を持つカードの複製になっています。偽証を行う際これらのカードを宣言できますか？',
      'ajp': 'いいえ、できません。元々偽証を持っているカードのみが偽証で選択できます。'
    },
    {
      'qjp': '追加コストが必要なカードとして偽証を宣言しました。反証とコスト支払いはどちらを先に行いますか。',
      'ajp': 'コストの支払いを先に行います。反証が成功した場合はカードを使用した扱いにはならないため、コストは戻ってきません。'
    }]
  },
  {
    name: '剑舞特性相关的FAQ',
    namejp: '剣舞全般へのFAQ',
    list: [{
      'qjp': '剣舞とはどんな効果ですか？',
      'ajp': '現在ルール上定義されていません。そのため意味を持たないキーワードになります。'
    },
    {
      'qjp': 'キリコとは誰ですか？',
      'ajp': '公式小説「八葉鏡の徒桜」に登場するメガミの一柱です。詳しくはこちらをご覧ください。'
    }]
  },
  {
    'name': '「嘘突き」',
    'list': [{
      'ajp': '偽証全般へのFAQもご覧ください。',
      'a': '请参阅[伪证]特性相关的FAQ。'
    },
    {
      'qjp': '表にすることができるのはどのタイミングですか？',
      'ajp': '相手が反証するかどうかを選んだ直後になります。'
    },
    {
      'qjp': '表にした場合この《攻撃》の適正距離やダメージ、効果はどうなりますか？',
      'ajp': '「嘘突き」のもののままになります。偽証で使用した時点で「嘘突き」として《攻撃》が生成されているため、使用中のカードが変化しても《攻撃》の解決に影響を与えません。'
    },
    {
      'qjp': '本物であっても表にすることはできますか？',
      'ajp': 'はい、できます。その場合は相手はオーラへのダメージを選択できます。'
    },
    {
      'qjp': 'ライラを宿し、レンリのカードで偽証を行い「嘘突き」を宣言しました。反証されなかったため表向きにし、解決後に捨て札に移動しました。捨て札に移動したカードは帯電していますか？',
      'ajp': 'はい、しています。偽証したカードの帯電が解決後に解除されるのは伏せ札に移動しているからです。'
    },
    {
      'qjp': 'ライラを宿し、ライラのカードで偽証を行い「嘘突き」を宣言しました。反証されなかったため表向きにする効果を適用したのですが、このカードの帯電を解除して風雷ゲージを上昇させることはできますか？',
      'ajp': 'はい、できます。レンリのカードとして使用されたためライラのカードであっても帯電し、捨て札に移動しても帯電を保ちます。'
    },
    {
      'qjp': '「嘘突き」の【常時】効果によって相手がオーラへのダメージを選択できなくなっています。「バックドラフト」などの効果は適用されますか？',
      'ajp': 'はい、されます。オーラへのダメージを選択できない状態はオーラへのダメージが「-」である状態とは異なります。'
    }]
  },
  {
    'name': '「都度討ち」',
    'list': [{
      'ajp': '偽証全般へのFAQもご覧ください。',
      'a': '请参阅[伪证]特性相关的FAQ。'
    }]
  },
  {
    'name': '「玄塗り」',
    'list': [{
      'ajp': '偽証全般へのFAQもご覧ください。',
      'a': '请参阅[伪证]特性相关的FAQ。'
    }]
  },
  {
    'name': '「煽り殺陣」',
    'list': [{
      'ajp': '偽証全般へのFAQもご覧ください。',
      'a': '请参阅[伪证]特性相关的FAQ。'
    }]
  },
  {
    'name': '「雲喰い」',
    'list': [{
      'ajp': '偽証全般へのFAQもご覧ください。',
      'a': '请参阅[伪证]特性相关的FAQ。'
    }]
  },
  {
    'name': '「魚吊り」',
    'list': [{
      'ajp': '偽証全般へのFAQもご覧ください。',
      'a': '请参阅[伪证]特性相关的FAQ。'
    }]
  },
  {
    'name': '「惹き騙り」',
    'list': [{
      'ajp': 'このカードへのFAQはありません。',
      'a': '没有FAQ。'
    }]
  },
  {
    'name': '「ルルララリ」',
    'list': [{
      'ajp': '偽証全般へのFAQもご覧ください。',
      'a': '请参阅[伪证]特性相关的FAQ。'
    }]
  },
  {
    'name': '「ラナラロミレリラ」',
    'list': [{
      'ajp': '対応としてカードを使用する効果へのFAQもご覧ください。'
    },
    {
      'qjp': '「他のメガミのカード」とはレンリ以外のカードを指しますか？',
      'ajp': 'はい、そうです。'
    }]
  },
  {
    'name': '「オリレテラレル」',
    'list': [{
      'ajp': '対応としてカードを使用する効果へのFAQもご覧ください。'
    },
    {
      'qjp': '一度「オリレテラレル」から使用したカードをもう一度「オリレテラレル」から使用することはできますか？',
      'ajp': 'いいえ、できません。一度使用し、取り除かれたカードは＜ゲーム外＞領域に表向きで置かれているため、『眼前構築で選んでいないカード』ではなくなっています。'
    },
    {
      'qjp': '眼前構築で選んでいない偽証を持つ通常札がもうありません。どうすればいいですか？',
      'ajp': '眼前構築で選んでいない通常札全てを相手に公開し、その事実を証明してください。'
    }]
  },
  {
    'name': '「夜山恋離のなれの果て」',
    'list': [{
      'ajp': '終端へのFAQもご覧ください。',
      'a': '请参阅终端关键词相关的FAQ。'
    }]
  },
  {
    'name': '「刻まれし衣」',
    'list': [{
      'qjp': '「封殺」によって「刻まれし衣」が宣言されています。このカードを使用することはできますか？',
      'ajp': 'はい、できます。逆に複製先のカード名が宣言されている場合は使用できません。'
    },
    {
      'qjp': '「夜山恋離のなれの果て」が未使用ですが、未使用の「刻まれし衣」が切札にあります。それを使用できますか？',
      'ajp': 'いいえ、できません。「刻まれし衣」は不定のカードのままです。'
    },
    {
      'qjp': '私が２つの「夜山恋離のなれの果て」を展開しています。この際に「刻まれし衣」はどうなりますか？',
      'ajp': '全ての「夜山恋離のなれの果て」の上に置かれた桜花結晶の個数を合計し、それを参照します。'
    }]
  },
  {
    'name': '「御劔桐子の巫女神楽」',
    'list': [{
      'ajp': '剣舞全般へのFAQもご覧ください。',
      'a': '请参阅[剑舞]特性相关的FAQ。'
    }]
  }]
}]